; ModuleID = 'utbotgo/functions/hasNegativeVarargs/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 7, !"Dwarf Version", i32 4}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"uwtable", i32 1}
!5 = !{i32 7, !"frame-pointer", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_Go, file: !7, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !8)
!7 = !DIFile(filename: "./has_negative.go", directory: "/workspace")
!8 = !{!9, !22, !24, !26, !28, !30}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "", directory: "")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !11, size: 128, align: 8, elements: !13)
!13 = !{!14, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !11, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !11, line: 1, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, align: 8, elements: !20)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "void")
!20 = !{!21}
!21 = !DISubrange(count: 1, lowerBound: 0)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!33 = !DIFile(filename: "/klee/runtime/Freestanding/memcmp.c", directory: "/klee/build/runtime/Freestanding")
!34 = distinct !DICompileUnit(language: DW_LANG_C99, file: !35, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!35 = !DIFile(filename: "/klee/runtime/Freestanding/memcpy.c", directory: "/klee/build/runtime/Freestanding")
!36 = !{!"clang version 14.0.0"}
!37 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !38, line: 1, type: !39, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!38 = !DIFile(filename: "has_negative.go", directory: ".")
!39 = !DISubroutineType(types: !40)
!40 = !{!19}
!41 = !{}
!42 = !DILocation(line: 1, column: 1, scope: !43)
!43 = !DILexicalBlockFile(scope: !37, file: !44, discriminator: 0)
!44 = !DIFile(filename: "<built-in>", directory: "")
!45 = distinct !DISubprogram(name: "main.hasNegativeSlice", scope: null, file: !38, line: 3, type: !46, scopeLine: 3, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !49}
!48 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !11, size: 192, align: 8, elements: !50)
!50 = !{!51, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!55 = !DILocalVariable(name: "a", arg: 1, scope: !45, file: !38, line: 3, type: !49)
!56 = !DILocation(line: 3, column: 23, scope: !45)
!57 = !DILocalVariable(name: "$ret0", scope: !45, file: !38, line: 3, type: !48)
!58 = !DILocation(line: 3, column: 32, scope: !45)
!59 = !DILocalVariable(name: "i", scope: !60, file: !38, line: 4, type: !15)
!60 = distinct !DILexicalBlock(scope: !45, file: !38, line: 4, column: 2)
!61 = !DILocation(line: 4, column: 6, scope: !45)
!62 = !DILocation(line: 4, column: 2, scope: !60)
!63 = !DILocation(line: 5, column: 6, scope: !60)
!64 = !DILocation(line: 5, column: 8, scope: !60)
!65 = !DILocation(line: 5, column: 7, scope: !60)
!66 = !DILocation(line: 5, column: 11, scope: !60)
!67 = !DILocation(line: 5, column: 3, scope: !60)
!68 = !DILocation(line: 0, scope: !45)
!69 = !DILocation(line: 6, column: 4, scope: !60)
!70 = !DILocation(line: 9, column: 2, scope: !45)
!71 = distinct !DISubprogram(name: "main.hasNegativeArr", scope: null, file: !38, line: 12, type: !72, scopeLine: 12, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!72 = !DISubroutineType(types: !73)
!73 = !{!48, !74}
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, align: 8, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 3, lowerBound: 0)
!77 = !DILocalVariable(name: "a", arg: 1, scope: !71, file: !38, line: 12, type: !74)
!78 = !DILocation(line: 12, column: 21, scope: !71)
!79 = !DILocalVariable(name: "$ret1", scope: !71, file: !38, line: 12, type: !48)
!80 = !DILocation(line: 12, column: 31, scope: !71)
!81 = !DILocalVariable(name: "i", scope: !82, file: !38, line: 13, type: !15)
!82 = distinct !DILexicalBlock(scope: !71, file: !38, line: 13, column: 2)
!83 = !DILocation(line: 13, column: 6, scope: !71)
!84 = !DILocation(line: 13, column: 2, scope: !82)
!85 = !DILocation(line: 14, column: 8, scope: !82)
!86 = !DILocation(line: 14, column: 7, scope: !82)
!87 = !DILocation(line: 14, column: 11, scope: !82)
!88 = !DILocation(line: 14, column: 3, scope: !82)
!89 = !DILocation(line: 0, scope: !71)
!90 = !DILocation(line: 15, column: 4, scope: !82)
!91 = !DILocation(line: 18, column: 2, scope: !71)
!92 = distinct !DISubprogram(name: "main.hasNegativeVarargs", scope: null, file: !38, line: 21, type: !46, scopeLine: 21, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!93 = !DILocalVariable(name: "a", arg: 1, scope: !92, file: !38, line: 21, type: !49)
!94 = !DILocation(line: 21, column: 25, scope: !92)
!95 = !DILocalVariable(name: "$ret2", scope: !92, file: !38, line: 21, type: !48)
!96 = !DILocation(line: 21, column: 35, scope: !92)
!97 = !DILocalVariable(name: "i", scope: !98, file: !38, line: 22, type: !15)
!98 = distinct !DILexicalBlock(scope: !92, file: !38, line: 22, column: 2)
!99 = !DILocation(line: 22, column: 6, scope: !92)
!100 = !DILocation(line: 22, column: 2, scope: !98)
!101 = !DILocation(line: 23, column: 6, scope: !98)
!102 = !DILocation(line: 23, column: 8, scope: !98)
!103 = !DILocation(line: 23, column: 7, scope: !98)
!104 = !DILocation(line: 23, column: 11, scope: !98)
!105 = !DILocation(line: 23, column: 3, scope: !98)
!106 = !DILocation(line: 0, scope: !92)
!107 = !DILocation(line: 24, column: 4, scope: !98)
!108 = !DILocation(line: 27, column: 2, scope: !92)
!109 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !38, line: 1, type: !110, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !494, !494}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !38, line: 1, size: 19456, align: 8, elements: !114)
!114 = !{!115, !175, !188, !314, !315, !316, !317, !318, !319, !320, !321, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !348, !349, !350, !351, !352, !367, !368, !436, !437, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !471, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !38, line: 1, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !38, line: 1, size: 256, align: 8, elements: !118)
!118 = !{!119, !120, !171, !172, !173, !174}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !121, size: 128, align: 64, offset: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !11, size: 128, align: 8, elements: !122)
!122 = !{!123, !170}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !44, line: 1, size: 512, align: 8, elements: !126)
!126 = !{!127, !129, !130, !132, !134, !135, !136, !137, !145, !147, !153, !169}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !44, line: 1, baseType: !128, size: 64, align: 64)
!128 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !44, line: 1, baseType: !128, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !44, line: 1, baseType: !131, size: 32, align: 32, offset: 128)
!131 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !44, line: 1, baseType: !133, size: 8, align: 8, offset: 160)
!133 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !44, line: 1, baseType: !133, size: 8, align: 8, offset: 168)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !44, line: 1, baseType: !133, size: 8, align: 8, offset: 176)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !44, line: 1, baseType: !133, size: 8, align: 8, offset: 184)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !44, line: 1, baseType: !138, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !44, line: 1, size: 64, align: 8, elements: !140)
!140 = !{!141}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !44, line: 1, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!48, !18, !18}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !44, line: 1, baseType: !146, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !44, line: 1, baseType: !148, size: 64, align: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !44, line: 1, size: 128, align: 8, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !44, line: 1, baseType: !146, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !44, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !44, line: 1, baseType: !154, size: 64, align: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !44, line: 1, size: 320, align: 8, elements: !156)
!156 = !{!157, !158, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !44, line: 1, baseType: !148, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !44, line: 1, baseType: !148, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !44, line: 1, baseType: !160, size: 192, align: 64, offset: 128)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !11, size: 192, align: 8, elements: !161)
!161 = !{!162, !53, !54}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !44, line: 1, size: 320, align: 8, elements: !165)
!165 = !{!157, !158, !166, !167, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 200)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 208)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 216)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !38, line: 1, size: 512, align: 8, elements: !178)
!178 = !{!119, !179, !181, !182, !183, !184, !185, !186, !187}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !38, line: 1, baseType: !180, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !38, line: 1, baseType: !116, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !38, line: 1, baseType: !116, size: 64, align: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 456)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !38, line: 1, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !38, line: 1, size: 17280, align: 8, elements: !191)
!191 = !{!192, !193, !195, !196, !203, !209, !210, !212, !214, !215, !216, !218, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !231, !232, !233, !237, !238, !239, !240, !241, !242, !246, !247, !249, !250, !260, !261, !262, !263, !268, !269, !270, !271, !272, !273, !274, !291, !292, !293, !295, !299, !300, !309, !310, !311, !312, !313}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !38, line: 1, baseType: !194, size: 64, align: 64, offset: 64)
!194 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !38, line: 1, baseType: !197, size: 1024, align: 64, offset: 192)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !38, line: 1, size: 1024, align: 8, elements: !198)
!198 = !{!199}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !38, line: 1, baseType: !200, size: 1024, align: 64)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 1024, align: 8, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 16, lowerBound: 0)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !38, line: 1, baseType: !204, size: 64, align: 64, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 1280)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !38, line: 1, baseType: !211, size: 64, align: 64, offset: 1344)
!211 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !38, line: 1, baseType: !213, size: 64, align: 64, offset: 1408)
!213 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !38, line: 1, baseType: !213, size: 64, align: 64, offset: 1472)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !38, line: 1, baseType: !213, size: 64, align: 64, offset: 1536)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 1600)
!217 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !38, line: 1, baseType: !219, size: 32, align: 32, offset: 1664)
!219 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !38, line: 1, baseType: !219, size: 32, align: 32, offset: 1696)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !38, line: 1, baseType: !149, size: 128, align: 64, offset: 1728)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !38, line: 1, baseType: !219, size: 32, align: 32, offset: 1856)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !38, line: 1, baseType: !219, size: 32, align: 32, offset: 1888)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !38, line: 1, baseType: !219, size: 32, align: 32, offset: 1920)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !38, line: 1, baseType: !219, size: 32, align: 32, offset: 1952)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 1984)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 1992)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 2000)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !38, line: 1, baseType: !230, size: 8, align: 8, offset: 2008)
!230 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 2016)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 2048)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !38, line: 1, baseType: !234, size: 64, align: 32, offset: 2080)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 64, align: 4, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 2, lowerBound: 0)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 2144)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !38, line: 1, baseType: !133, size: 8, align: 8, offset: 2152)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !38, line: 1, baseType: !194, size: 64, align: 64, offset: 2176)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !38, line: 1, baseType: !219, size: 32, align: 32, offset: 2240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 2272)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !38, line: 1, baseType: !243, size: 64, align: 64, offset: 2304)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !38, line: 1, size: 64, align: 8, elements: !244)
!244 = !{!245}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !38, line: 1, baseType: !128, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2368)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !38, line: 1, baseType: !248, size: 64, align: 64, offset: 2432)
!248 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !38, line: 1, baseType: !211, size: 64, align: 64, offset: 2496)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !38, line: 1, baseType: !251, size: 12288, align: 64, offset: 2560)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 12288, align: 8, elements: !258)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !38, line: 1, size: 384, align: 8, elements: !253)
!253 = !{!254, !255, !256, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !38, line: 1, baseType: !128, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !38, line: 1, baseType: !149, size: 128, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !38, line: 1, baseType: !149, size: 128, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!258 = !{!259}
!259 = !DISubrange(count: 32, lowerBound: 0)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 14848)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 14880)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !38, line: 1, baseType: !248, size: 64, align: 64, offset: 14912)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !38, line: 1, baseType: !264, size: 64, align: 64, offset: 14976)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !266)
!266 = !{!267}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !142, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 15040)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !38, line: 1, baseType: !133, size: 8, align: 8, offset: 15104)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 15168)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 15232)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 15264)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 15296)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !38, line: 1, baseType: !275, size: 192, align: 64, offset: 15360)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !11, size: 192, align: 8, elements: !276)
!276 = !{!277, !282, !283}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !11, line: 1, baseType: !278, size: 64, align: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !38, line: 1, size: 64, align: 8, elements: !279)
!279 = !{!280, !245}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !38, line: 1, baseType: !281, align: 8)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !38, line: 1, align: 1, elements: !41)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !11, line: 1, baseType: !131, size: 32, align: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !11, line: 1, baseType: !284, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !286)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!48, !48}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 15552)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 15584)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !38, line: 1, baseType: !294, align: 8, offset: 15616)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !38, line: 1, align: 1, elements: !41)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !38, line: 1, baseType: !296, size: 8, align: 8, offset: 15616)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !38, line: 1, size: 8, align: 1, elements: !297)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !38, line: 1, baseType: !133, size: 8, align: 8)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 15680)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !38, line: 1, baseType: !301, size: 1280, align: 64, offset: 15744)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 1280, align: 8, elements: !307)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !38, line: 1, size: 128, align: 8, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !38, line: 1, baseType: !128, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !38, line: 1, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!307 = !{!308}
!308 = !DISubrange(count: 10, lowerBound: 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 17024)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 17088)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 17152)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 17160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !38, line: 1, baseType: !243, size: 64, align: 64, offset: 17216)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !38, line: 1, baseType: !211, size: 64, align: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !38, line: 1, baseType: !322, size: 8, align: 8, offset: 640)
!322 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 648)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 656)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 664)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 672)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 680)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 688)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 696)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 712)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !38, line: 1, baseType: !133, size: 8, align: 8, offset: 720)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !38, line: 1, baseType: !230, size: 8, align: 8, offset: 728)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 736)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 744)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !38, line: 1, baseType: !133, size: 8, align: 8, offset: 752)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 768)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 832)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !38, line: 1, baseType: !194, size: 64, align: 64, offset: 960)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !38, line: 1, baseType: !213, size: 64, align: 64, offset: 1024)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !38, line: 1, baseType: !248, size: 64, align: 64, offset: 1088)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 1152)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !38, line: 1, baseType: !345, size: 192, align: 64, offset: 1216)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !11, size: 192, align: 8, elements: !346)
!346 = !{!347, !53, !54}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !146, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 1408)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 1472)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 1536)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 1600)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !38, line: 1, baseType: !353, size: 64, align: 64, offset: 1664)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !11, size: 192, align: 8, elements: !355)
!355 = !{!356, !53, !54}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !38, line: 1, size: 320, align: 8, elements: !359)
!359 = !{!360, !365, !366}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !38, line: 1, baseType: !361, size: 192, align: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !11, size: 192, align: 8, elements: !362)
!362 = !{!363, !53, !54}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 1728)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !38, line: 1, baseType: !369, size: 64, align: 64, offset: 1792)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !38, line: 1, size: 704, align: 8, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 416)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 424)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !38, line: 1, baseType: !385, size: 64, align: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !38, line: 1, size: 768, align: 8, elements: !387)
!387 = !{!388, !390, !391, !392, !394, !395, !427, !428, !429, !434, !435}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !38, line: 1, baseType: !389, size: 64, align: 64)
!389 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !38, line: 1, baseType: !389, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !38, line: 1, baseType: !393, size: 16, align: 16, offset: 192)
!393 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 224)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !38, line: 1, baseType: !396, size: 64, align: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !38, line: 1, size: 512, align: 8, elements: !398)
!398 = !{!399, !400, !401, !402, !404, !405, !406, !407, !408, !409, !410, !426}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !38, line: 1, baseType: !128, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !38, line: 1, baseType: !403, size: 8, align: 8, offset: 160)
!403 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !38, line: 1, baseType: !133, size: 8, align: 8, offset: 168)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !38, line: 1, baseType: !133, size: 8, align: 8, offset: 176)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !38, line: 1, baseType: !133, size: 8, align: 8, offset: 184)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !38, line: 1, baseType: !264, size: 64, align: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !38, line: 1, baseType: !146, size: 64, align: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !38, line: 1, baseType: !148, size: 64, align: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !38, line: 1, baseType: !411, size: 64, align: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !38, line: 1, size: 320, align: 8, elements: !413)
!413 = !{!414, !415, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !38, line: 1, baseType: !148, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !38, line: 1, baseType: !148, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !38, line: 1, baseType: !417, size: 192, align: 64, offset: 128)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !11, size: 192, align: 8, elements: !418)
!418 = !{!419, !53, !54}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !38, line: 1, size: 320, align: 8, elements: !422)
!422 = !{!414, !415, !423, !424, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !38, line: 1, baseType: !389, size: 64, align: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !38, line: 1, baseType: !389, size: 64, align: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !38, line: 1, baseType: !430, size: 128, align: 64, offset: 448)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !38, line: 1, size: 128, align: 8, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !38, line: 1, baseType: !430, size: 128, align: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !38, line: 1, baseType: !278, size: 64, align: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 1856)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !38, line: 1, baseType: !438, size: 64, align: 64, offset: 1920)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !38, line: 1, size: 576, align: 8, elements: !440)
!440 = !{!441, !442, !443, !444, !452, !453, !454, !455}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !38, line: 1, baseType: !213, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !38, line: 1, baseType: !445, size: 64, align: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !447)
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!19, !121, !128}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !121, size: 128, align: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !38, line: 1, baseType: !131, size: 32, align: 32, offset: 1984)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !38, line: 1, baseType: !217, size: 64, align: 64, offset: 2048)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2112)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 2176)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 2240)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 2304)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 2368)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 2432)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2496)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 2560)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2624)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !38, line: 1, baseType: !468, size: 7808, align: 64, offset: 2688)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 7808, align: 8, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 122, lowerBound: 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !38, line: 1, baseType: !472, size: 64, align: 64, offset: 10496)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !474)
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!19, !18}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 10560)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 10624)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10688)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10696)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 10752)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 10816)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10880)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10888)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10896)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10904)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10912)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !38, line: 1, baseType: !128, size: 64, align: 64, offset: 10944)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !38, line: 1, baseType: !468, size: 7808, align: 64, offset: 11008)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !38, line: 1, baseType: !493, size: 640, align: 64, offset: 18816)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 640, align: 8, elements: !307)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !11, size: 128, align: 8, elements: !496)
!496 = !{!497, !501}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !11, line: 1, baseType: !498, size: 64, align: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !38, line: 1, size: 64, align: 8, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !38, line: 1, baseType: !211, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !11, line: 1, baseType: !219, size: 32, align: 32, offset: 64)
!502 = !DILocalVariable(name: "$this21", arg: 1, scope: !109, file: !38, line: 1, type: !494)
!503 = !DILocation(line: 1, column: 1, scope: !109)
!504 = !DILocalVariable(name: "$ret3", scope: !109, file: !38, line: 1, type: !112)
!505 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !38, line: 1, type: !506, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!506 = !DISubroutineType(types: !507)
!507 = !{!19, !494, !494, !508}
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !38, line: 1, size: 128, align: 8, elements: !509)
!509 = !{!500, !510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !38, line: 1, baseType: !211, size: 64, align: 64, offset: 64)
!511 = !DILocalVariable(name: "$this22", arg: 1, scope: !505, file: !38, line: 1, type: !494)
!512 = !DILocation(line: 1, column: 1, scope: !505)
!513 = !DILocalVariable(name: "$p23", arg: 2, scope: !505, file: !38, line: 1, type: !508)
!514 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !38, line: 1, type: !515, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!515 = !DISubroutineType(types: !516)
!516 = !{!19, !494, !494, !112}
!517 = !DILocalVariable(name: "$this24", arg: 1, scope: !514, file: !38, line: 1, type: !494)
!518 = !DILocation(line: 1, column: 1, scope: !514)
!519 = !DILocalVariable(name: "$p25", arg: 2, scope: !514, file: !38, line: 1, type: !112)
!520 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !38, line: 1, type: !521, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!521 = !DISubroutineType(types: !522)
!522 = !{!48, !494, !494}
!523 = !DILocalVariable(name: "$this26", arg: 1, scope: !520, file: !38, line: 1, type: !494)
!524 = !DILocation(line: 1, column: 1, scope: !520)
!525 = !DILocalVariable(name: "$ret4", scope: !520, file: !38, line: 1, type: !48)
!526 = distinct !DISubprogram(name: "main._63_7int..eq", scope: null, file: !44, line: 1, type: !143, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!527 = !DILocalVariable(name: "key1", arg: 1, scope: !526, file: !44, line: 1, type: !18)
!528 = !DILocation(line: 1, column: 1, scope: !526)
!529 = !DILocalVariable(name: "key2", arg: 2, scope: !526, file: !44, line: 1, type: !18)
!530 = !DILocalVariable(name: "$ret5", scope: !526, file: !44, line: 1, type: !48)
!531 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !44, line: 1, type: !143, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!532 = !DILocalVariable(name: "key1", arg: 1, scope: !531, file: !44, line: 1, type: !18)
!533 = !DILocation(line: 1, column: 1, scope: !531)
!534 = !DILocalVariable(name: "key2", arg: 2, scope: !531, file: !44, line: 1, type: !18)
!535 = !DILocalVariable(name: "$ret6", scope: !531, file: !44, line: 1, type: !48)
!536 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !44, line: 1, type: !143, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!537 = !DILocalVariable(name: "key1", arg: 1, scope: !536, file: !44, line: 1, type: !18)
!538 = !DILocation(line: 1, column: 1, scope: !536)
!539 = !DILocalVariable(name: "key2", arg: 2, scope: !536, file: !44, line: 1, type: !18)
!540 = !DILocalVariable(name: "$ret7", scope: !536, file: !44, line: 1, type: !48)
!541 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !44, line: 1, type: !143, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!542 = !DILocalVariable(name: "key1", arg: 1, scope: !541, file: !44, line: 1, type: !18)
!543 = !DILocation(line: 1, column: 1, scope: !541)
!544 = !DILocalVariable(name: "key2", arg: 2, scope: !541, file: !44, line: 1, type: !18)
!545 = !DILocalVariable(name: "$ret8", scope: !541, file: !44, line: 1, type: !48)
!546 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !44, line: 1, type: !143, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!547 = !DILocalVariable(name: "key1", arg: 1, scope: !546, file: !44, line: 1, type: !18)
!548 = !DILocation(line: 1, column: 1, scope: !546)
!549 = !DILocalVariable(name: "key2", arg: 2, scope: !546, file: !44, line: 1, type: !18)
!550 = !DILocalVariable(name: "$ret9", scope: !546, file: !44, line: 1, type: !48)
