; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./recursive.go", directory: "/workspace")
!5 = !{!6, !19, !21, !23, !25, !27}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !8, size: 128, align: 8, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, align: 8, elements: !17)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "void")
!17 = !{!18}
!18 = !DISubrange(count: 1, lowerBound: 0)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!29 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !30, line: 1, type: !31, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!30 = !DIFile(filename: "recursive.go", directory: ".")
!31 = !DISubroutineType(types: !32)
!32 = !{!16}
!33 = !{}
!34 = !DILocation(line: 1, column: 1, scope: !35)
!35 = !DILexicalBlockFile(scope: !29, file: !36, discriminator: 0)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = distinct !DISubprogram(name: "main.Recursive", scope: null, file: !30, line: 4, type: !38, scopeLine: 4, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !40, !40}
!40 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!41 = !DILocalVariable(name: "a", arg: 1, scope: !37, file: !30, line: 4, type: !40)
!42 = !DILocation(line: 4, column: 16, scope: !37)
!43 = !DILocalVariable(name: "b", arg: 2, scope: !37, file: !30, line: 4, type: !40)
!44 = !DILocation(line: 4, column: 19, scope: !37)
!45 = !DILocalVariable(name: "$ret0", scope: !37, file: !30, line: 4, type: !40)
!46 = !DILocation(line: 4, column: 28, scope: !37)
!47 = !DILocation(line: 5, column: 5, scope: !37)
!48 = !DILocation(line: 5, column: 7, scope: !37)
!49 = !DILocation(line: 5, column: 2, scope: !37)
!50 = !DILocation(line: 6, column: 10, scope: !37)
!51 = !DILocation(line: 6, column: 3, scope: !37)
!52 = !DILocation(line: 8, column: 19, scope: !37)
!53 = !DILocation(line: 8, column: 24, scope: !37)
!54 = !DILocation(line: 8, column: 23, scope: !37)
!55 = !DILocation(line: 8, column: 9, scope: !37)
!56 = !DILocation(line: 8, column: 2, scope: !37)
!57 = !DILocation(line: 8, column: 22, scope: !37)
!58 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !30, line: 1, type: !59, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !445, !445}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !30, line: 1, size: 19456, align: 8, elements: !63)
!63 = !{!64, !127, !140, !265, !266, !267, !268, !269, !270, !271, !272, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !299, !300, !301, !302, !303, !318, !319, !387, !388, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !422, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !30, line: 1, size: 256, align: 8, elements: !67)
!67 = !{!68, !69, !123, !124, !125, !126}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !70, size: 128, align: 64, offset: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !8, size: 128, align: 8, elements: !71)
!71 = !{!72, !122}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 512, align: 8, elements: !75)
!75 = !{!76, !78, !79, !81, !83, !84, !85, !86, !95, !97, !103, !121}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !77, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !80, size: 32, align: 32, offset: 128)
!80 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !36, line: 1, baseType: !82, size: 8, align: 8, offset: 160)
!82 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !82, size: 8, align: 8, offset: 168)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !82, size: 8, align: 8, offset: 176)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !82, size: 8, align: 8, offset: 184)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !36, line: 1, baseType: !87, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !15, !15}
!94 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !96, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !98, size: 64, align: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !96, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !104, size: 64, align: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !98, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !98, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !110, size: 192, align: 64, offset: 128)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !8, size: 192, align: 8, elements: !111)
!111 = !{!112, !119, !120}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !115)
!115 = !{!107, !108, !116, !117, !118}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 200)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 208)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 216)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !30, line: 1, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !30, line: 1, size: 512, align: 8, elements: !130)
!130 = !{!68, !131, !133, !134, !135, !136, !137, !138, !139}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !30, line: 1, baseType: !132, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !30, line: 1, baseType: !65, size: 64, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !65, size: 64, align: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 456)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !30, line: 1, baseType: !141, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !30, line: 1, size: 17280, align: 8, elements: !143)
!143 = !{!144, !145, !147, !148, !155, !161, !162, !164, !166, !167, !168, !169, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !182, !183, !184, !188, !189, !190, !191, !192, !193, !197, !198, !200, !201, !211, !212, !213, !214, !219, !220, !221, !222, !223, !224, !225, !242, !243, !244, !246, !250, !251, !260, !261, !262, !263, !264}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !30, line: 1, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !30, line: 1, baseType: !149, size: 1024, align: 64, offset: 192)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !30, line: 1, size: 1024, align: 8, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !30, line: 1, baseType: !152, size: 1024, align: 64)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 1024, align: 8, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 16, lowerBound: 0)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !30, line: 1, baseType: !156, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1280)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 1344)
!163 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !30, line: 1, baseType: !165, size: 64, align: 64, offset: 1408)
!165 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !30, line: 1, baseType: !165, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !30, line: 1, baseType: !165, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !30, line: 1, baseType: !170, size: 32, align: 32, offset: 1664)
!170 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !30, line: 1, baseType: !170, size: 32, align: 32, offset: 1696)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !30, line: 1, baseType: !99, size: 128, align: 64, offset: 1728)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !30, line: 1, baseType: !170, size: 32, align: 32, offset: 1856)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !30, line: 1, baseType: !170, size: 32, align: 32, offset: 1888)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !30, line: 1, baseType: !170, size: 32, align: 32, offset: 1920)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !30, line: 1, baseType: !170, size: 32, align: 32, offset: 1952)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 1984)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 1992)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 2000)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !30, line: 1, baseType: !181, size: 8, align: 8, offset: 2008)
!181 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 2016)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !30, line: 1, baseType: !185, size: 64, align: 32, offset: 2080)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 64, align: 4, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 2, lowerBound: 0)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 2144)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !82, size: 8, align: 8, offset: 2152)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !30, line: 1, baseType: !146, size: 64, align: 64, offset: 2176)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !30, line: 1, baseType: !170, size: 32, align: 32, offset: 2240)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 2272)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !30, line: 1, baseType: !194, size: 64, align: 64, offset: 2304)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !30, line: 1, size: 64, align: 8, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !30, line: 1, baseType: !77, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2368)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !199, size: 64, align: 64, offset: 2432)
!199 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 2496)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !30, line: 1, baseType: !202, size: 12288, align: 64, offset: 2560)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 12288, align: 8, elements: !209)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !30, line: 1, size: 384, align: 8, elements: !204)
!204 = !{!205, !206, !207, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !30, line: 1, baseType: !77, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !30, line: 1, baseType: !99, size: 128, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !30, line: 1, baseType: !99, size: 128, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!209 = !{!210}
!210 = !DISubrange(count: 32, lowerBound: 0)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 14848)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 14880)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !30, line: 1, baseType: !199, size: 64, align: 64, offset: 14912)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !30, line: 1, baseType: !215, size: 64, align: 64, offset: 14976)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !217)
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !91, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15040)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !30, line: 1, baseType: !82, size: 8, align: 8, offset: 15104)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15168)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 15232)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 15264)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15296)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !30, line: 1, baseType: !226, size: 192, align: 64, offset: 15360)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !8, size: 192, align: 8, elements: !227)
!227 = !{!228, !233, !234}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !8, line: 1, baseType: !229, size: 64, align: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !30, line: 1, size: 64, align: 8, elements: !230)
!230 = !{!231, !196}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !30, line: 1, baseType: !232, align: 8)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !30, line: 1, align: 1, elements: !33)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !8, line: 1, baseType: !80, size: 32, align: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !8, line: 1, baseType: !235, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !237)
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!94, !94}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 15552)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 15584)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !30, line: 1, baseType: !245, align: 8, offset: 15616)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !30, line: 1, align: 1, elements: !33)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !30, line: 1, baseType: !247, size: 8, align: 8, offset: 15616)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !30, line: 1, size: 8, align: 1, elements: !248)
!248 = !{!249}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !30, line: 1, baseType: !82, size: 8, align: 8)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15680)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !30, line: 1, baseType: !252, size: 1280, align: 64, offset: 15744)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 1280, align: 8, elements: !258)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !30, line: 1, size: 128, align: 8, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !30, line: 1, baseType: !77, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !30, line: 1, baseType: !257, size: 64, align: 64, offset: 64)
!257 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!258 = !{!259}
!259 = !DISubrange(count: 10, lowerBound: 0)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 17024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 17088)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 17152)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 17160)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !30, line: 1, baseType: !194, size: 64, align: 64, offset: 17216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !30, line: 1, baseType: !273, size: 8, align: 8, offset: 640)
!273 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 648)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 656)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 664)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 672)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 680)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 688)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 696)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 704)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 712)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !30, line: 1, baseType: !82, size: 8, align: 8, offset: 720)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !30, line: 1, baseType: !181, size: 8, align: 8, offset: 728)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 736)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 744)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !30, line: 1, baseType: !82, size: 8, align: 8, offset: 752)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 768)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 896)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !30, line: 1, baseType: !146, size: 64, align: 64, offset: 960)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !30, line: 1, baseType: !165, size: 64, align: 64, offset: 1024)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !30, line: 1, baseType: !199, size: 64, align: 64, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 1152)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !30, line: 1, baseType: !296, size: 192, align: 64, offset: 1216)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !8, size: 192, align: 8, elements: !297)
!297 = !{!298, !119, !120}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !96, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 1408)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 1472)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 1536)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 1600)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !30, line: 1, baseType: !304, size: 64, align: 64, offset: 1664)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !8, size: 192, align: 8, elements: !306)
!306 = !{!307, !119, !120}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !30, line: 1, size: 320, align: 8, elements: !310)
!310 = !{!311, !316, !317}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !30, line: 1, baseType: !312, size: 192, align: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !8, size: 192, align: 8, elements: !313)
!313 = !{!314, !119, !120}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 1728)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !30, line: 1, baseType: !320, size: 64, align: 64, offset: 1792)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !30, line: 1, size: 704, align: 8, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 416)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 424)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 512)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !30, line: 1, baseType: !336, size: 64, align: 64, offset: 640)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !30, line: 1, size: 768, align: 8, elements: !338)
!338 = !{!339, !341, !342, !343, !345, !346, !378, !379, !380, !385, !386}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !30, line: 1, baseType: !340, size: 64, align: 64)
!340 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !30, line: 1, baseType: !340, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !30, line: 1, baseType: !344, size: 16, align: 16, offset: 192)
!344 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 224)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !30, line: 1, baseType: !347, size: 64, align: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !30, line: 1, size: 512, align: 8, elements: !349)
!349 = !{!350, !351, !352, !353, !355, !356, !357, !358, !359, !360, !361, !377}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !30, line: 1, baseType: !77, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !30, line: 1, baseType: !354, size: 8, align: 8, offset: 160)
!354 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !30, line: 1, baseType: !82, size: 8, align: 8, offset: 168)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !30, line: 1, baseType: !82, size: 8, align: 8, offset: 176)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !30, line: 1, baseType: !82, size: 8, align: 8, offset: 184)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !30, line: 1, baseType: !215, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !30, line: 1, baseType: !96, size: 64, align: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !30, line: 1, baseType: !98, size: 64, align: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !30, line: 1, baseType: !362, size: 64, align: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !30, line: 1, size: 320, align: 8, elements: !364)
!364 = !{!365, !366, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !30, line: 1, baseType: !98, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !30, line: 1, baseType: !98, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !30, line: 1, baseType: !368, size: 192, align: 64, offset: 128)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !8, size: 192, align: 8, elements: !369)
!369 = !{!370, !119, !120}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !30, line: 1, size: 320, align: 8, elements: !373)
!373 = !{!365, !366, !374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !30, line: 1, baseType: !340, size: 64, align: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !30, line: 1, baseType: !340, size: 64, align: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !30, line: 1, baseType: !381, size: 128, align: 64, offset: 448)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !30, line: 1, size: 128, align: 8, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !30, line: 1, baseType: !381, size: 128, align: 64, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !30, line: 1, baseType: !229, size: 64, align: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1856)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !30, line: 1, baseType: !389, size: 64, align: 64, offset: 1920)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !30, line: 1, size: 576, align: 8, elements: !391)
!391 = !{!392, !393, !394, !395, !403, !404, !405, !406}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !30, line: 1, baseType: !165, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !30, line: 1, baseType: !396, size: 64, align: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!16, !70, !77}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !70, size: 128, align: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 512)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !30, line: 1, baseType: !80, size: 32, align: 32, offset: 1984)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 2048)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2112)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 2176)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 2240)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 2304)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 2368)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 2432)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2496)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 2560)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2624)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !30, line: 1, baseType: !419, size: 7808, align: 64, offset: 2688)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 7808, align: 8, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 122, lowerBound: 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !30, line: 1, baseType: !423, size: 64, align: 64, offset: 10496)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !425)
!425 = !{!426}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!16, !15}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 10560)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 10624)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 10688)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 10696)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 10752)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 10816)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 10880)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 10888)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 10896)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 10904)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !30, line: 1, baseType: !94, size: 8, align: 8, offset: 10912)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !77, size: 64, align: 64, offset: 10944)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !30, line: 1, baseType: !419, size: 7808, align: 64, offset: 11008)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !30, line: 1, baseType: !444, size: 640, align: 64, offset: 18816)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 640, align: 8, elements: !258)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !8, size: 128, align: 8, elements: !447)
!447 = !{!448, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !8, line: 1, baseType: !449, size: 64, align: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !30, line: 1, size: 64, align: 8, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !30, line: 1, baseType: !163, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !8, line: 1, baseType: !170, size: 32, align: 32, offset: 64)
!453 = !DILocalVariable(name: "$this21", arg: 1, scope: !58, file: !30, line: 1, type: !445)
!454 = !DILocation(line: 1, column: 1, scope: !58)
!455 = !DILocalVariable(name: "$ret1", scope: !58, file: !30, line: 1, type: !61)
!456 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !30, line: 1, type: !457, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!457 = !DISubroutineType(types: !458)
!458 = !{!16, !445, !445, !459}
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !30, line: 1, size: 128, align: 8, elements: !460)
!460 = !{!451, !461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 64)
!462 = !DILocalVariable(name: "$this22", arg: 1, scope: !456, file: !30, line: 1, type: !445)
!463 = !DILocation(line: 1, column: 1, scope: !456)
!464 = !DILocalVariable(name: "$p23", arg: 2, scope: !456, file: !30, line: 1, type: !459)
!465 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !30, line: 1, type: !466, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!466 = !DISubroutineType(types: !467)
!467 = !{!16, !445, !445, !61}
!468 = !DILocalVariable(name: "$this24", arg: 1, scope: !465, file: !30, line: 1, type: !445)
!469 = !DILocation(line: 1, column: 1, scope: !465)
!470 = !DILocalVariable(name: "$p25", arg: 2, scope: !465, file: !30, line: 1, type: !61)
!471 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !30, line: 1, type: !472, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!472 = !DISubroutineType(types: !473)
!473 = !{!94, !445, !445}
!474 = !DILocalVariable(name: "$this26", arg: 1, scope: !471, file: !30, line: 1, type: !445)
!475 = !DILocation(line: 1, column: 1, scope: !471)
!476 = !DILocalVariable(name: "$ret2", scope: !471, file: !30, line: 1, type: !94)
!477 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !36, line: 1, type: !92, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!478 = !DILocalVariable(name: "key1", arg: 1, scope: !477, file: !36, line: 1, type: !15)
!479 = !DILocation(line: 1, column: 1, scope: !477)
!480 = !DILocalVariable(name: "key2", arg: 2, scope: !477, file: !36, line: 1, type: !15)
!481 = !DILocalVariable(name: "$ret3", scope: !477, file: !36, line: 1, type: !94)
!482 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !36, line: 1, type: !92, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!483 = !DILocalVariable(name: "key1", arg: 1, scope: !482, file: !36, line: 1, type: !15)
!484 = !DILocation(line: 1, column: 1, scope: !482)
!485 = !DILocalVariable(name: "key2", arg: 2, scope: !482, file: !36, line: 1, type: !15)
!486 = !DILocalVariable(name: "$ret4", scope: !482, file: !36, line: 1, type: !94)
!487 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !36, line: 1, type: !92, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!488 = !DILocalVariable(name: "key1", arg: 1, scope: !487, file: !36, line: 1, type: !15)
!489 = !DILocation(line: 1, column: 1, scope: !487)
!490 = !DILocalVariable(name: "key2", arg: 2, scope: !487, file: !36, line: 1, type: !15)
!491 = !DILocalVariable(name: "$ret5", scope: !487, file: !36, line: 1, type: !94)
!492 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !92, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!493 = !DILocalVariable(name: "key1", arg: 1, scope: !492, file: !36, line: 1, type: !15)
!494 = !DILocation(line: 1, column: 1, scope: !492)
!495 = !DILocalVariable(name: "key2", arg: 2, scope: !492, file: !36, line: 1, type: !15)
!496 = !DILocalVariable(name: "$ret6", scope: !492, file: !36, line: 1, type: !94)
!497 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !92, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!498 = !DILocalVariable(name: "key1", arg: 1, scope: !497, file: !36, line: 1, type: !15)
!499 = !DILocation(line: 1, column: 1, scope: !497)
!500 = !DILocalVariable(name: "key2", arg: 2, scope: !497, file: !36, line: 1, type: !15)
