; ModuleID = 'utbotgo/package/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./has_negative.go", directory: "/workspace")
!5 = !{!6, !19, !21, !23, !25, !27}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !8, size: 128, align: 8, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, align: 8, elements: !17)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "void")
!17 = !{!18}
!18 = !DISubrange(count: 1, lowerBound: 0)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!29 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !30, line: 1, type: !31, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!30 = !DIFile(filename: "has_negative.go", directory: ".")
!31 = !DISubroutineType(types: !32)
!32 = !{!16}
!33 = !{}
!34 = !DILocation(line: 1, column: 1, scope: !35)
!35 = !DILexicalBlockFile(scope: !29, file: !36, discriminator: 0)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = distinct !DISubprogram(name: "main.hasNegativeSlice", scope: null, file: !30, line: 3, type: !38, scopeLine: 3, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !8, size: 192, align: 8, elements: !42)
!42 = !{!43, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 128)
!47 = !DILocalVariable(name: "a", arg: 1, scope: !37, file: !30, line: 3, type: !41)
!48 = !DILocation(line: 3, column: 23, scope: !37)
!49 = !DILocalVariable(name: "$ret0", scope: !37, file: !30, line: 3, type: !40)
!50 = !DILocation(line: 3, column: 32, scope: !37)
!51 = !DILocalVariable(name: "i", scope: !52, file: !30, line: 4, type: !12)
!52 = distinct !DILexicalBlock(scope: !37, file: !30, line: 4, column: 2)
!53 = !DILocation(line: 4, column: 6, scope: !37)
!54 = !DILocation(line: 4, column: 2, scope: !52)
!55 = !DILocation(line: 5, column: 6, scope: !52)
!56 = !DILocation(line: 5, column: 8, scope: !52)
!57 = !DILocation(line: 5, column: 7, scope: !52)
!58 = !DILocation(line: 5, column: 11, scope: !52)
!59 = !DILocation(line: 5, column: 3, scope: !52)
!60 = !DILocation(line: 6, column: 4, scope: !52)
!61 = !DILocation(line: 9, column: 2, scope: !37)
!62 = distinct !DISubprogram(name: "main.hasNegativeArr", scope: null, file: !30, line: 12, type: !63, scopeLine: 12, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!63 = !DISubroutineType(types: !64)
!64 = !{!40, !65}
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, align: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3, lowerBound: 0)
!68 = !DILocalVariable(name: "a", arg: 1, scope: !62, file: !30, line: 12, type: !65)
!69 = !DILocation(line: 12, column: 21, scope: !62)
!70 = !DILocalVariable(name: "$ret1", scope: !62, file: !30, line: 12, type: !40)
!71 = !DILocation(line: 12, column: 31, scope: !62)
!72 = !DILocalVariable(name: "i", scope: !73, file: !30, line: 13, type: !12)
!73 = distinct !DILexicalBlock(scope: !62, file: !30, line: 13, column: 2)
!74 = !DILocation(line: 13, column: 6, scope: !62)
!75 = !DILocation(line: 13, column: 2, scope: !73)
!76 = !DILocation(line: 14, column: 8, scope: !73)
!77 = !DILocation(line: 14, column: 7, scope: !73)
!78 = !DILocation(line: 14, column: 11, scope: !73)
!79 = !DILocation(line: 14, column: 3, scope: !73)
!80 = !DILocation(line: 15, column: 4, scope: !73)
!81 = !DILocation(line: 18, column: 2, scope: !62)
!82 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !30, line: 1, type: !83, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !467, !467}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !30, line: 1, size: 19456, align: 8, elements: !87)
!87 = !{!88, !148, !161, !287, !288, !289, !290, !291, !292, !293, !294, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !321, !322, !323, !324, !325, !340, !341, !409, !410, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !444, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !30, line: 1, size: 256, align: 8, elements: !91)
!91 = !{!92, !93, !144, !145, !146, !147}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !94, size: 128, align: 64, offset: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !8, size: 128, align: 8, elements: !95)
!95 = !{!96, !143}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 512, align: 8, elements: !99)
!99 = !{!100, !102, !103, !105, !107, !108, !109, !110, !118, !120, !126, !142}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !101, size: 64, align: 64)
!101 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !101, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !104, size: 32, align: 32, offset: 128)
!104 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !36, line: 1, baseType: !106, size: 8, align: 8, offset: 160)
!106 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !106, size: 8, align: 8, offset: 168)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !106, size: 8, align: 8, offset: 176)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !106, size: 8, align: 8, offset: 184)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !36, line: 1, baseType: !111, size: 64, align: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!40, !15, !15}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !119, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !121, size: 64, align: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !119, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !127, size: 64, align: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !129)
!129 = !{!130, !131, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !121, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !121, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !133, size: 192, align: 64, offset: 128)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !8, size: 192, align: 8, elements: !134)
!134 = !{!135, !45, !46}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !138)
!138 = !{!130, !131, !139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 200)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 208)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 216)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !30, line: 1, baseType: !149, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !30, line: 1, size: 512, align: 8, elements: !151)
!151 = !{!92, !152, !154, !155, !156, !157, !158, !159, !160}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !30, line: 1, baseType: !153, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !30, line: 1, baseType: !89, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !89, size: 64, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 456)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !30, line: 1, baseType: !162, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !30, line: 1, size: 17280, align: 8, elements: !164)
!164 = !{!165, !166, !168, !169, !176, !182, !183, !185, !187, !188, !189, !191, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !204, !205, !206, !210, !211, !212, !213, !214, !215, !219, !220, !222, !223, !233, !234, !235, !236, !241, !242, !243, !244, !245, !246, !247, !264, !265, !266, !268, !272, !273, !282, !283, !284, !285, !286}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 64)
!167 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !30, line: 1, baseType: !170, size: 1024, align: 64, offset: 192)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !30, line: 1, size: 1024, align: 8, elements: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !30, line: 1, baseType: !173, size: 1024, align: 64)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 1024, align: 8, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 16, lowerBound: 0)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !30, line: 1, baseType: !177, size: 64, align: 64, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1280)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !30, line: 1, baseType: !184, size: 64, align: 64, offset: 1344)
!184 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !30, line: 1, baseType: !186, size: 64, align: 64, offset: 1408)
!186 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !30, line: 1, baseType: !186, size: 64, align: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !30, line: 1, baseType: !186, size: 64, align: 64, offset: 1536)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 1600)
!190 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !30, line: 1, baseType: !192, size: 32, align: 32, offset: 1664)
!192 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !30, line: 1, baseType: !192, size: 32, align: 32, offset: 1696)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !30, line: 1, baseType: !122, size: 128, align: 64, offset: 1728)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !30, line: 1, baseType: !192, size: 32, align: 32, offset: 1856)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !30, line: 1, baseType: !192, size: 32, align: 32, offset: 1888)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !30, line: 1, baseType: !192, size: 32, align: 32, offset: 1920)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !30, line: 1, baseType: !192, size: 32, align: 32, offset: 1952)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 1984)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 1992)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 2000)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !30, line: 1, baseType: !203, size: 8, align: 8, offset: 2008)
!203 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 2016)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 2048)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !30, line: 1, baseType: !207, size: 64, align: 32, offset: 2080)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 64, align: 4, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 2, lowerBound: 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 2144)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !106, size: 8, align: 8, offset: 2152)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 2176)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !30, line: 1, baseType: !192, size: 32, align: 32, offset: 2240)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 2272)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !30, line: 1, baseType: !216, size: 64, align: 64, offset: 2304)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !30, line: 1, size: 64, align: 8, elements: !217)
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !30, line: 1, baseType: !101, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2368)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !221, size: 64, align: 64, offset: 2432)
!221 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !30, line: 1, baseType: !184, size: 64, align: 64, offset: 2496)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !30, line: 1, baseType: !224, size: 12288, align: 64, offset: 2560)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 12288, align: 8, elements: !231)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !30, line: 1, size: 384, align: 8, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !30, line: 1, baseType: !101, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !30, line: 1, baseType: !122, size: 128, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !30, line: 1, baseType: !122, size: 128, align: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!231 = !{!232}
!232 = !DISubrange(count: 32, lowerBound: 0)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 14848)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 14880)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !30, line: 1, baseType: !221, size: 64, align: 64, offset: 14912)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !30, line: 1, baseType: !237, size: 64, align: 64, offset: 14976)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !239)
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !115, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15040)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !30, line: 1, baseType: !106, size: 8, align: 8, offset: 15104)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15168)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 15232)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 15264)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15296)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !30, line: 1, baseType: !248, size: 192, align: 64, offset: 15360)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !8, size: 192, align: 8, elements: !249)
!249 = !{!250, !255, !256}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !8, line: 1, baseType: !251, size: 64, align: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !30, line: 1, size: 64, align: 8, elements: !252)
!252 = !{!253, !218}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !30, line: 1, baseType: !254, align: 8)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !30, line: 1, align: 1, elements: !33)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !8, line: 1, baseType: !104, size: 32, align: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !8, line: 1, baseType: !257, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !259)
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!40, !40}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 15552)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 15584)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !30, line: 1, baseType: !267, align: 8, offset: 15616)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !30, line: 1, align: 1, elements: !33)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !30, line: 1, baseType: !269, size: 8, align: 8, offset: 15616)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !30, line: 1, size: 8, align: 1, elements: !270)
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !30, line: 1, baseType: !106, size: 8, align: 8)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15680)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !30, line: 1, baseType: !274, size: 1280, align: 64, offset: 15744)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 1280, align: 8, elements: !280)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !30, line: 1, size: 128, align: 8, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !30, line: 1, baseType: !101, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !30, line: 1, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!280 = !{!281}
!281 = !DISubrange(count: 10, lowerBound: 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 17024)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 17088)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 17152)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 17160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !30, line: 1, baseType: !216, size: 64, align: 64, offset: 17216)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !184, size: 64, align: 64, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 576)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !30, line: 1, baseType: !295, size: 8, align: 8, offset: 640)
!295 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 648)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 656)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 664)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 672)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 680)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 688)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 696)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 712)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !30, line: 1, baseType: !106, size: 8, align: 8, offset: 720)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !30, line: 1, baseType: !203, size: 8, align: 8, offset: 728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 736)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 744)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !30, line: 1, baseType: !106, size: 8, align: 8, offset: 752)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 832)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 896)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !30, line: 1, baseType: !186, size: 64, align: 64, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !30, line: 1, baseType: !221, size: 64, align: 64, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !30, line: 1, baseType: !318, size: 192, align: 64, offset: 1216)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !8, size: 192, align: 8, elements: !319)
!319 = !{!320, !45, !46}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !119, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 1408)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 1472)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 1536)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 1600)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !30, line: 1, baseType: !326, size: 64, align: 64, offset: 1664)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !8, size: 192, align: 8, elements: !328)
!328 = !{!329, !45, !46}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !30, line: 1, size: 320, align: 8, elements: !332)
!332 = !{!333, !338, !339}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !30, line: 1, baseType: !334, size: 192, align: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !8, size: 192, align: 8, elements: !335)
!335 = !{!336, !45, !46}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 1728)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !30, line: 1, baseType: !342, size: 64, align: 64, offset: 1792)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !30, line: 1, size: 704, align: 8, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 416)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 424)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 512)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 576)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !30, line: 1, baseType: !358, size: 64, align: 64, offset: 640)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !30, line: 1, size: 768, align: 8, elements: !360)
!360 = !{!361, !363, !364, !365, !367, !368, !400, !401, !402, !407, !408}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !30, line: 1, baseType: !362, size: 64, align: 64)
!362 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !30, line: 1, baseType: !362, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !30, line: 1, baseType: !366, size: 16, align: 16, offset: 192)
!366 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !30, line: 1, baseType: !369, size: 64, align: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !30, line: 1, size: 512, align: 8, elements: !371)
!371 = !{!372, !373, !374, !375, !377, !378, !379, !380, !381, !382, !383, !399}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !30, line: 1, baseType: !101, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !30, line: 1, baseType: !376, size: 8, align: 8, offset: 160)
!376 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !30, line: 1, baseType: !106, size: 8, align: 8, offset: 168)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !30, line: 1, baseType: !106, size: 8, align: 8, offset: 176)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !30, line: 1, baseType: !106, size: 8, align: 8, offset: 184)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !30, line: 1, baseType: !237, size: 64, align: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !30, line: 1, baseType: !119, size: 64, align: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !30, line: 1, baseType: !121, size: 64, align: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !30, line: 1, baseType: !384, size: 64, align: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !30, line: 1, size: 320, align: 8, elements: !386)
!386 = !{!387, !388, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !30, line: 1, baseType: !121, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !30, line: 1, baseType: !121, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !30, line: 1, baseType: !390, size: 192, align: 64, offset: 128)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !8, size: 192, align: 8, elements: !391)
!391 = !{!392, !45, !46}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !30, line: 1, size: 320, align: 8, elements: !395)
!395 = !{!387, !388, !396, !397, !398}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !30, line: 1, baseType: !362, size: 64, align: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !30, line: 1, baseType: !362, size: 64, align: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !30, line: 1, baseType: !403, size: 128, align: 64, offset: 448)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !30, line: 1, size: 128, align: 8, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !30, line: 1, baseType: !403, size: 128, align: 64, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !30, line: 1, baseType: !251, size: 64, align: 64, offset: 704)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1856)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !30, line: 1, baseType: !411, size: 64, align: 64, offset: 1920)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !30, line: 1, size: 576, align: 8, elements: !413)
!413 = !{!414, !415, !416, !417, !425, !426, !427, !428}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !30, line: 1, baseType: !186, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !30, line: 1, baseType: !418, size: 64, align: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !420)
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!16, !94, !101}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !94, size: 128, align: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !30, line: 1, baseType: !104, size: 32, align: 32, offset: 1984)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 2048)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2112)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 2176)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 2240)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 2304)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 2368)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 2432)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2496)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 2560)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2624)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !30, line: 1, baseType: !441, size: 7808, align: 64, offset: 2688)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 7808, align: 8, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 122, lowerBound: 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !30, line: 1, baseType: !445, size: 64, align: 64, offset: 10496)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !447)
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!16, !15}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 10560)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 10624)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10688)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10696)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 10752)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 10816)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10880)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10888)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10896)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10904)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10912)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !101, size: 64, align: 64, offset: 10944)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !30, line: 1, baseType: !441, size: 7808, align: 64, offset: 11008)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !30, line: 1, baseType: !466, size: 640, align: 64, offset: 18816)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 640, align: 8, elements: !280)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !8, size: 128, align: 8, elements: !469)
!469 = !{!470, !474}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !8, line: 1, baseType: !471, size: 64, align: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !30, line: 1, size: 64, align: 8, elements: !472)
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !30, line: 1, baseType: !184, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !8, line: 1, baseType: !192, size: 32, align: 32, offset: 64)
!475 = !DILocalVariable(name: "$this21", arg: 1, scope: !82, file: !30, line: 1, type: !467)
!476 = !DILocation(line: 1, column: 1, scope: !82)
!477 = !DILocalVariable(name: "$ret2", scope: !82, file: !30, line: 1, type: !85)
!478 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !30, line: 1, type: !479, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!479 = !DISubroutineType(types: !480)
!480 = !{!16, !467, !467, !481}
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !30, line: 1, size: 128, align: 8, elements: !482)
!482 = !{!473, !483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !30, line: 1, baseType: !184, size: 64, align: 64, offset: 64)
!484 = !DILocalVariable(name: "$this22", arg: 1, scope: !478, file: !30, line: 1, type: !467)
!485 = !DILocation(line: 1, column: 1, scope: !478)
!486 = !DILocalVariable(name: "$p23", arg: 2, scope: !478, file: !30, line: 1, type: !481)
!487 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !30, line: 1, type: !488, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!488 = !DISubroutineType(types: !489)
!489 = !{!16, !467, !467, !85}
!490 = !DILocalVariable(name: "$this24", arg: 1, scope: !487, file: !30, line: 1, type: !467)
!491 = !DILocation(line: 1, column: 1, scope: !487)
!492 = !DILocalVariable(name: "$p25", arg: 2, scope: !487, file: !30, line: 1, type: !85)
!493 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !30, line: 1, type: !494, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!494 = !DISubroutineType(types: !495)
!495 = !{!40, !467, !467}
!496 = !DILocalVariable(name: "$this26", arg: 1, scope: !493, file: !30, line: 1, type: !467)
!497 = !DILocation(line: 1, column: 1, scope: !493)
!498 = !DILocalVariable(name: "$ret3", scope: !493, file: !30, line: 1, type: !40)
!499 = distinct !DISubprogram(name: "main._63_7int..eq", scope: null, file: !36, line: 1, type: !116, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!500 = !DILocalVariable(name: "key1", arg: 1, scope: !499, file: !36, line: 1, type: !15)
!501 = !DILocation(line: 1, column: 1, scope: !499)
!502 = !DILocalVariable(name: "key2", arg: 2, scope: !499, file: !36, line: 1, type: !15)
!503 = !DILocalVariable(name: "$ret4", scope: !499, file: !36, line: 1, type: !40)
!504 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !36, line: 1, type: !116, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!505 = !DILocalVariable(name: "key1", arg: 1, scope: !504, file: !36, line: 1, type: !15)
!506 = !DILocation(line: 1, column: 1, scope: !504)
!507 = !DILocalVariable(name: "key2", arg: 2, scope: !504, file: !36, line: 1, type: !15)
!508 = !DILocalVariable(name: "$ret5", scope: !504, file: !36, line: 1, type: !40)
!509 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !36, line: 1, type: !116, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!510 = !DILocalVariable(name: "key1", arg: 1, scope: !509, file: !36, line: 1, type: !15)
!511 = !DILocation(line: 1, column: 1, scope: !509)
!512 = !DILocalVariable(name: "key2", arg: 2, scope: !509, file: !36, line: 1, type: !15)
!513 = !DILocalVariable(name: "$ret6", scope: !509, file: !36, line: 1, type: !40)
!514 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !36, line: 1, type: !116, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!515 = !DILocalVariable(name: "key1", arg: 1, scope: !514, file: !36, line: 1, type: !15)
!516 = !DILocation(line: 1, column: 1, scope: !514)
!517 = !DILocalVariable(name: "key2", arg: 2, scope: !514, file: !36, line: 1, type: !15)
!518 = !DILocalVariable(name: "$ret7", scope: !514, file: !36, line: 1, type: !40)
!519 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !116, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!520 = !DILocalVariable(name: "key1", arg: 1, scope: !519, file: !36, line: 1, type: !15)
!521 = !DILocation(line: 1, column: 1, scope: !519)
!522 = !DILocalVariable(name: "key2", arg: 2, scope: !519, file: !36, line: 1, type: !15)
!523 = !DILocalVariable(name: "$ret8", scope: !519, file: !36, line: 1, type: !40)
