; ModuleID = 'utbotgo/functions/Recursive/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 7, !"Dwarf Version", i32 4}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"uwtable", i32 1}
!5 = !{i32 7, !"frame-pointer", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_Go, file: !7, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !8)
!7 = !DIFile(filename: "./recursive.go", directory: "/workspace")
!8 = !{!9, !22, !24, !26, !28, !30}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "", directory: "")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !11, size: 128, align: 8, elements: !13)
!13 = !{!14, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !11, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !11, line: 1, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, align: 8, elements: !20)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "void")
!20 = !{!21}
!21 = !DISubrange(count: 1, lowerBound: 0)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!33 = !DIFile(filename: "/klee/runtime/Freestanding/memcmp.c", directory: "/klee/build/runtime/Freestanding")
!34 = distinct !DICompileUnit(language: DW_LANG_C99, file: !35, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!35 = !DIFile(filename: "/klee/runtime/Freestanding/memcpy.c", directory: "/klee/build/runtime/Freestanding")
!36 = distinct !DICompileUnit(language: DW_LANG_C89, file: !37, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!37 = !DIFile(filename: "/klee/runtime/Intrinsic/klee_div_zero_check.c", directory: "/klee/build/runtime/Intrinsic")
!38 = !{!"clang version 14.0.0"}
!39 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !40, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!40 = !DIFile(filename: "recursive.go", directory: ".")
!41 = !DISubroutineType(types: !42)
!42 = !{!19}
!43 = !{}
!44 = !DILocation(line: 1, column: 1, scope: !45)
!45 = !DILexicalBlockFile(scope: !39, file: !46, discriminator: 0)
!46 = !DIFile(filename: "<built-in>", directory: "")
!47 = distinct !DISubprogram(name: "main.Recursive", scope: null, file: !40, line: 4, type: !48, scopeLine: 4, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !50, !50}
!50 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!51 = !DILocalVariable(name: "a", arg: 1, scope: !47, file: !40, line: 4, type: !50)
!52 = !DILocation(line: 4, column: 16, scope: !47)
!53 = !DILocalVariable(name: "b", arg: 2, scope: !47, file: !40, line: 4, type: !50)
!54 = !DILocation(line: 4, column: 19, scope: !47)
!55 = !DILocalVariable(name: "$ret0", scope: !47, file: !40, line: 4, type: !50)
!56 = !DILocation(line: 4, column: 28, scope: !47)
!57 = !DILocation(line: 5, column: 5, scope: !47)
!58 = !DILocation(line: 5, column: 7, scope: !47)
!59 = !DILocation(line: 5, column: 2, scope: !47)
!60 = !DILocation(line: 0, scope: !47)
!61 = !DILocation(line: 6, column: 10, scope: !47)
!62 = !DILocation(line: 6, column: 3, scope: !47)
!63 = !DILocation(line: 8, column: 19, scope: !47)
!64 = !DILocation(line: 8, column: 24, scope: !47)
!65 = !DILocation(line: 8, column: 23, scope: !47)
!66 = !DILocation(line: 8, column: 9, scope: !47)
!67 = !DILocation(line: 8, column: 2, scope: !47)
!68 = !DILocation(line: 8, column: 22, scope: !47)
!69 = !{!"True"}
!70 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !40, line: 1, type: !71, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !457, !457}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !40, line: 1, size: 19456, align: 8, elements: !75)
!75 = !{!76, !139, !152, !277, !278, !279, !280, !281, !282, !283, !284, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !311, !312, !313, !314, !315, !330, !331, !399, !400, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !434, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !40, line: 1, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !40, line: 1, size: 256, align: 8, elements: !79)
!79 = !{!80, !81, !135, !136, !137, !138}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !40, line: 1, baseType: !82, size: 128, align: 64, offset: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !11, size: 128, align: 8, elements: !83)
!83 = !{!84, !134}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !46, line: 1, size: 512, align: 8, elements: !87)
!87 = !{!88, !90, !91, !93, !95, !96, !97, !98, !107, !109, !115, !133}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !46, line: 1, baseType: !89, size: 64, align: 64)
!89 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !46, line: 1, baseType: !89, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !46, line: 1, baseType: !92, size: 32, align: 32, offset: 128)
!92 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !46, line: 1, baseType: !94, size: 8, align: 8, offset: 160)
!94 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !46, line: 1, baseType: !94, size: 8, align: 8, offset: 168)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !46, line: 1, baseType: !94, size: 8, align: 8, offset: 176)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !46, line: 1, baseType: !94, size: 8, align: 8, offset: 184)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !46, line: 1, baseType: !99, size: 64, align: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !46, line: 1, size: 64, align: 8, elements: !101)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !46, line: 1, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !18, !18}
!106 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !46, line: 1, baseType: !108, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !46, line: 1, baseType: !110, size: 64, align: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !46, line: 1, size: 128, align: 8, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !46, line: 1, baseType: !108, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !46, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !46, line: 1, baseType: !116, size: 64, align: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !46, line: 1, size: 320, align: 8, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !46, line: 1, baseType: !110, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !46, line: 1, baseType: !110, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !46, line: 1, baseType: !122, size: 192, align: 64, offset: 128)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !11, size: 192, align: 8, elements: !123)
!123 = !{!124, !131, !132}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !46, line: 1, size: 320, align: 8, elements: !127)
!127 = !{!119, !120, !128, !129, !130}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 200)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 208)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 216)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !40, line: 1, baseType: !140, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !40, line: 1, size: 512, align: 8, elements: !142)
!142 = !{!80, !143, !145, !146, !147, !148, !149, !150, !151}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !40, line: 1, baseType: !144, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !40, line: 1, baseType: !77, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !40, line: 1, baseType: !77, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 456)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !40, line: 1, baseType: !153, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !40, line: 1, size: 17280, align: 8, elements: !155)
!155 = !{!156, !157, !159, !160, !167, !173, !174, !176, !178, !179, !180, !181, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !194, !195, !196, !200, !201, !202, !203, !204, !205, !209, !210, !212, !213, !223, !224, !225, !226, !231, !232, !233, !234, !235, !236, !237, !254, !255, !256, !258, !262, !263, !272, !273, !274, !275, !276}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !40, line: 1, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !40, line: 1, baseType: !161, size: 1024, align: 64, offset: 192)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !40, line: 1, size: 1024, align: 8, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !40, line: 1, baseType: !164, size: 1024, align: 64)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 1024, align: 8, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 16, lowerBound: 0)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !40, line: 1, baseType: !168, size: 64, align: 64, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 1280)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !40, line: 1, baseType: !175, size: 64, align: 64, offset: 1344)
!175 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !40, line: 1, baseType: !177, size: 64, align: 64, offset: 1408)
!177 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !40, line: 1, baseType: !177, size: 64, align: 64, offset: 1472)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !40, line: 1, baseType: !177, size: 64, align: 64, offset: 1536)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 1600)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !40, line: 1, baseType: !182, size: 32, align: 32, offset: 1664)
!182 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !40, line: 1, baseType: !182, size: 32, align: 32, offset: 1696)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !40, line: 1, baseType: !111, size: 128, align: 64, offset: 1728)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !40, line: 1, baseType: !182, size: 32, align: 32, offset: 1856)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !40, line: 1, baseType: !182, size: 32, align: 32, offset: 1888)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !40, line: 1, baseType: !182, size: 32, align: 32, offset: 1920)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !40, line: 1, baseType: !182, size: 32, align: 32, offset: 1952)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 1984)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 1992)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 2000)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !40, line: 1, baseType: !193, size: 8, align: 8, offset: 2008)
!193 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 2016)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 2048)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !40, line: 1, baseType: !197, size: 64, align: 32, offset: 2080)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 64, align: 4, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 2, lowerBound: 0)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 2144)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !40, line: 1, baseType: !94, size: 8, align: 8, offset: 2152)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !40, line: 1, baseType: !158, size: 64, align: 64, offset: 2176)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !40, line: 1, baseType: !182, size: 32, align: 32, offset: 2240)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 2272)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !40, line: 1, baseType: !206, size: 64, align: 64, offset: 2304)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !40, line: 1, size: 64, align: 8, elements: !207)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !40, line: 1, baseType: !89, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2368)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !40, line: 1, baseType: !211, size: 64, align: 64, offset: 2432)
!211 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !40, line: 1, baseType: !175, size: 64, align: 64, offset: 2496)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !40, line: 1, baseType: !214, size: 12288, align: 64, offset: 2560)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 12288, align: 8, elements: !221)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !40, line: 1, size: 384, align: 8, elements: !216)
!216 = !{!217, !218, !219, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !40, line: 1, baseType: !89, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !40, line: 1, baseType: !111, size: 128, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !40, line: 1, baseType: !111, size: 128, align: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !40, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!221 = !{!222}
!222 = !DISubrange(count: 32, lowerBound: 0)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 14848)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 14880)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !40, line: 1, baseType: !211, size: 64, align: 64, offset: 14912)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !40, line: 1, baseType: !227, size: 64, align: 64, offset: 14976)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !229)
!229 = !{!230}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !103, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 15040)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !40, line: 1, baseType: !94, size: 8, align: 8, offset: 15104)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !40, line: 1, baseType: !15, size: 64, align: 64, offset: 15168)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 15232)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 15264)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 15296)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !40, line: 1, baseType: !238, size: 192, align: 64, offset: 15360)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !11, size: 192, align: 8, elements: !239)
!239 = !{!240, !245, !246}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !11, line: 1, baseType: !241, size: 64, align: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !40, line: 1, size: 64, align: 8, elements: !242)
!242 = !{!243, !208}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !40, line: 1, baseType: !244, align: 8)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !40, line: 1, align: 1, elements: !43)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !11, line: 1, baseType: !92, size: 32, align: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !11, line: 1, baseType: !247, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!106, !106}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 15552)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 15584)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !40, line: 1, baseType: !257, align: 8, offset: 15616)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !40, line: 1, align: 1, elements: !43)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !40, line: 1, baseType: !259, size: 8, align: 8, offset: 15616)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !40, line: 1, size: 8, align: 1, elements: !260)
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !40, line: 1, baseType: !94, size: 8, align: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !40, line: 1, baseType: !15, size: 64, align: 64, offset: 15680)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !40, line: 1, baseType: !264, size: 1280, align: 64, offset: 15744)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 1280, align: 8, elements: !270)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !40, line: 1, size: 128, align: 8, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !40, line: 1, baseType: !89, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !40, line: 1, baseType: !269, size: 64, align: 64, offset: 64)
!269 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!270 = !{!271}
!271 = !DISubrange(count: 10, lowerBound: 0)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 17024)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 17088)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 17152)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 17160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !40, line: 1, baseType: !206, size: 64, align: 64, offset: 17216)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !40, line: 1, baseType: !175, size: 64, align: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !40, line: 1, baseType: !285, size: 8, align: 8, offset: 640)
!285 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 648)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 656)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 664)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 672)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 680)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 688)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 696)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 712)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !40, line: 1, baseType: !94, size: 8, align: 8, offset: 720)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !40, line: 1, baseType: !193, size: 8, align: 8, offset: 728)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 736)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 744)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !40, line: 1, baseType: !94, size: 8, align: 8, offset: 752)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !40, line: 1, baseType: !158, size: 64, align: 64, offset: 960)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !40, line: 1, baseType: !177, size: 64, align: 64, offset: 1024)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !40, line: 1, baseType: !211, size: 64, align: 64, offset: 1088)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 1152)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !40, line: 1, baseType: !308, size: 192, align: 64, offset: 1216)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !11, size: 192, align: 8, elements: !309)
!309 = !{!310, !131, !132}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !108, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 1408)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 1472)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 1536)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 1600)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !40, line: 1, baseType: !316, size: 64, align: 64, offset: 1664)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !11, size: 192, align: 8, elements: !318)
!318 = !{!319, !131, !132}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !40, line: 1, size: 320, align: 8, elements: !322)
!322 = !{!323, !328, !329}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !40, line: 1, baseType: !324, size: 192, align: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !11, size: 192, align: 8, elements: !325)
!325 = !{!326, !131, !132}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 1728)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !40, line: 1, baseType: !332, size: 64, align: 64, offset: 1792)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !40, line: 1, size: 704, align: 8, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 416)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 424)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !40, line: 1, baseType: !348, size: 64, align: 64, offset: 640)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !40, line: 1, size: 768, align: 8, elements: !350)
!350 = !{!351, !353, !354, !355, !357, !358, !390, !391, !392, !397, !398}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !40, line: 1, baseType: !352, size: 64, align: 64)
!352 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !40, line: 1, baseType: !352, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !40, line: 1, baseType: !356, size: 16, align: 16, offset: 192)
!356 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 224)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !40, line: 1, baseType: !359, size: 64, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !40, line: 1, size: 512, align: 8, elements: !361)
!361 = !{!362, !363, !364, !365, !367, !368, !369, !370, !371, !372, !373, !389}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !40, line: 1, baseType: !89, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !40, line: 1, baseType: !366, size: 8, align: 8, offset: 160)
!366 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !40, line: 1, baseType: !94, size: 8, align: 8, offset: 168)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !40, line: 1, baseType: !94, size: 8, align: 8, offset: 176)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !40, line: 1, baseType: !94, size: 8, align: 8, offset: 184)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !40, line: 1, baseType: !227, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !40, line: 1, baseType: !108, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !40, line: 1, baseType: !110, size: 64, align: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !40, line: 1, baseType: !374, size: 64, align: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !40, line: 1, size: 320, align: 8, elements: !376)
!376 = !{!377, !378, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !40, line: 1, baseType: !110, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !40, line: 1, baseType: !110, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !40, line: 1, baseType: !380, size: 192, align: 64, offset: 128)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !11, size: 192, align: 8, elements: !381)
!381 = !{!382, !131, !132}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !40, line: 1, size: 320, align: 8, elements: !385)
!385 = !{!377, !378, !386, !387, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !40, line: 1, baseType: !352, size: 64, align: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !40, line: 1, baseType: !352, size: 64, align: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !40, line: 1, baseType: !393, size: 128, align: 64, offset: 448)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !40, line: 1, size: 128, align: 8, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !40, line: 1, baseType: !393, size: 128, align: 64, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !40, line: 1, baseType: !241, size: 64, align: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 1856)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !40, line: 1, baseType: !401, size: 64, align: 64, offset: 1920)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !40, line: 1, size: 576, align: 8, elements: !403)
!403 = !{!404, !405, !406, !407, !415, !416, !417, !418}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !40, line: 1, baseType: !177, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !40, line: 1, baseType: !408, size: 64, align: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!19, !82, !89}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !40, line: 1, baseType: !82, size: 128, align: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !40, line: 1, baseType: !92, size: 32, align: 32, offset: 1984)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 2048)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2112)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 2176)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 2240)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 2304)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 2368)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 2432)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2496)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 2560)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2624)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !40, line: 1, baseType: !431, size: 7808, align: 64, offset: 2688)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 7808, align: 8, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 122, lowerBound: 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !40, line: 1, baseType: !435, size: 64, align: 64, offset: 10496)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !437)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!19, !18}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 10560)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 10624)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 10688)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 10696)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 10752)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 10816)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 10880)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 10888)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 10896)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 10904)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !40, line: 1, baseType: !106, size: 8, align: 8, offset: 10912)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !40, line: 1, baseType: !89, size: 64, align: 64, offset: 10944)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !40, line: 1, baseType: !431, size: 7808, align: 64, offset: 11008)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !40, line: 1, baseType: !456, size: 640, align: 64, offset: 18816)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 640, align: 8, elements: !270)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !11, size: 128, align: 8, elements: !459)
!459 = !{!460, !464}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !11, line: 1, baseType: !461, size: 64, align: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !40, line: 1, size: 64, align: 8, elements: !462)
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !40, line: 1, baseType: !175, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !11, line: 1, baseType: !182, size: 32, align: 32, offset: 64)
!465 = !DILocalVariable(name: "$this21", arg: 1, scope: !70, file: !40, line: 1, type: !457)
!466 = !DILocation(line: 1, column: 1, scope: !70)
!467 = !DILocalVariable(name: "$ret1", scope: !70, file: !40, line: 1, type: !73)
!468 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !40, line: 1, type: !469, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!469 = !DISubroutineType(types: !470)
!470 = !{!19, !457, !457, !471}
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !40, line: 1, size: 128, align: 8, elements: !472)
!472 = !{!463, !473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !40, line: 1, baseType: !175, size: 64, align: 64, offset: 64)
!474 = !DILocalVariable(name: "$this22", arg: 1, scope: !468, file: !40, line: 1, type: !457)
!475 = !DILocation(line: 1, column: 1, scope: !468)
!476 = !DILocalVariable(name: "$p23", arg: 2, scope: !468, file: !40, line: 1, type: !471)
!477 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !40, line: 1, type: !478, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!478 = !DISubroutineType(types: !479)
!479 = !{!19, !457, !457, !73}
!480 = !DILocalVariable(name: "$this24", arg: 1, scope: !477, file: !40, line: 1, type: !457)
!481 = !DILocation(line: 1, column: 1, scope: !477)
!482 = !DILocalVariable(name: "$p25", arg: 2, scope: !477, file: !40, line: 1, type: !73)
!483 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !40, line: 1, type: !484, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!484 = !DISubroutineType(types: !485)
!485 = !{!106, !457, !457}
!486 = !DILocalVariable(name: "$this26", arg: 1, scope: !483, file: !40, line: 1, type: !457)
!487 = !DILocation(line: 1, column: 1, scope: !483)
!488 = !DILocalVariable(name: "$ret2", scope: !483, file: !40, line: 1, type: !106)
!489 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !46, line: 1, type: !104, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!490 = !DILocalVariable(name: "key1", arg: 1, scope: !489, file: !46, line: 1, type: !18)
!491 = !DILocation(line: 1, column: 1, scope: !489)
!492 = !DILocalVariable(name: "key2", arg: 2, scope: !489, file: !46, line: 1, type: !18)
!493 = !DILocalVariable(name: "$ret3", scope: !489, file: !46, line: 1, type: !106)
!494 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !46, line: 1, type: !104, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!495 = !DILocalVariable(name: "key1", arg: 1, scope: !494, file: !46, line: 1, type: !18)
!496 = !DILocation(line: 1, column: 1, scope: !494)
!497 = !DILocalVariable(name: "key2", arg: 2, scope: !494, file: !46, line: 1, type: !18)
!498 = !DILocalVariable(name: "$ret4", scope: !494, file: !46, line: 1, type: !106)
!499 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !46, line: 1, type: !104, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!500 = !DILocalVariable(name: "key1", arg: 1, scope: !499, file: !46, line: 1, type: !18)
!501 = !DILocation(line: 1, column: 1, scope: !499)
!502 = !DILocalVariable(name: "key2", arg: 2, scope: !499, file: !46, line: 1, type: !18)
!503 = !DILocalVariable(name: "$ret5", scope: !499, file: !46, line: 1, type: !106)
!504 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !46, line: 1, type: !104, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!505 = !DILocalVariable(name: "key1", arg: 1, scope: !504, file: !46, line: 1, type: !18)
!506 = !DILocation(line: 1, column: 1, scope: !504)
!507 = !DILocalVariable(name: "key2", arg: 2, scope: !504, file: !46, line: 1, type: !18)
!508 = !DILocalVariable(name: "$ret6", scope: !504, file: !46, line: 1, type: !106)
!509 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !46, line: 1, type: !104, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!510 = !DILocalVariable(name: "key1", arg: 1, scope: !509, file: !46, line: 1, type: !18)
!511 = !DILocation(line: 1, column: 1, scope: !509)
!512 = !DILocalVariable(name: "key2", arg: 2, scope: !509, file: !46, line: 1, type: !18)
