; ModuleID = 'utbotgo/functions/goroutine/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 7, !"Dwarf Version", i32 4}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"uwtable", i32 1}
!5 = !{i32 7, !"frame-pointer", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_Go, file: !7, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !8)
!7 = !DIFile(filename: "./goroutine.go", directory: "/workspace")
!8 = !{!9, !22, !24, !26, !28, !30}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "", directory: "")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !11, size: 128, align: 8, elements: !13)
!13 = !{!14, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !11, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !11, line: 1, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, align: 8, elements: !20)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "void")
!20 = !{!21}
!21 = !DISubrange(count: 1, lowerBound: 0)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!33 = !DIFile(filename: "/klee/runtime/Freestanding/memcmp.c", directory: "/klee/build/runtime/Freestanding")
!34 = distinct !DICompileUnit(language: DW_LANG_C99, file: !35, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!35 = !DIFile(filename: "/klee/runtime/Freestanding/memcpy.c", directory: "/klee/build/runtime/Freestanding")
!36 = !{!"clang version 14.0.0"}
!37 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !38, line: 1, type: !39, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!38 = !DIFile(filename: "goroutine.go", directory: ".")
!39 = !DISubroutineType(types: !40)
!40 = !{!19}
!41 = !{}
!42 = !DILocation(line: 1, column: 1, scope: !43)
!43 = !DILexicalBlockFile(scope: !37, file: !44, discriminator: 0)
!44 = !DIFile(filename: "<built-in>", directory: "")
!45 = distinct !DISubprogram(name: "main.goroutine", scope: null, file: !38, line: 3, type: !46, scopeLine: 3, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!46 = !DISubroutineType(types: !47)
!47 = !{!15, !15}
!48 = !DILocalVariable(name: "a", arg: 1, scope: !45, file: !38, line: 3, type: !15)
!49 = !DILocation(line: 3, column: 16, scope: !45)
!50 = !DILocalVariable(name: "$ret0", scope: !45, file: !38, line: 3, type: !15)
!51 = !DILocation(line: 3, column: 23, scope: !45)
!52 = !DILocation(line: 4, column: 2, scope: !45)
!53 = !DILocation(line: 7, column: 5, scope: !45)
!54 = !DILocation(line: 7, column: 7, scope: !45)
!55 = !DILocation(line: 7, column: 2, scope: !45)
!56 = !DILocation(line: 0, scope: !45)
!57 = !DILocation(line: 8, column: 3, scope: !45)
!58 = !DILocation(line: 10, column: 2, scope: !45)
!59 = distinct !DISubprogram(name: "main.goroutine..func1", scope: null, file: !38, line: 4, type: !39, scopeLine: 4, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!60 = !DILocation(line: 5, column: 3, scope: !59)
!61 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !38, line: 1, type: !62, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !449, !449}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !38, line: 1, size: 19456, align: 8, elements: !66)
!66 = !{!67, !130, !143, !269, !270, !271, !272, !273, !274, !275, !276, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !303, !304, !305, !306, !307, !322, !323, !391, !392, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !426, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !38, line: 1, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !38, line: 1, size: 256, align: 8, elements: !70)
!70 = !{!71, !72, !126, !127, !128, !129}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !73, size: 128, align: 64, offset: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !11, size: 128, align: 8, elements: !74)
!74 = !{!75, !125}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !44, line: 1, size: 512, align: 8, elements: !78)
!78 = !{!79, !81, !82, !84, !86, !87, !88, !89, !98, !100, !106, !124}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !44, line: 1, baseType: !80, size: 64, align: 64)
!80 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !44, line: 1, baseType: !80, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !44, line: 1, baseType: !83, size: 32, align: 32, offset: 128)
!83 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !44, line: 1, baseType: !85, size: 8, align: 8, offset: 160)
!85 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !44, line: 1, baseType: !85, size: 8, align: 8, offset: 168)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !44, line: 1, baseType: !85, size: 8, align: 8, offset: 176)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !44, line: 1, baseType: !85, size: 8, align: 8, offset: 184)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !44, line: 1, baseType: !90, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !44, line: 1, size: 64, align: 8, elements: !92)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !44, line: 1, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !18, !18}
!97 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !44, line: 1, baseType: !99, size: 64, align: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !44, line: 1, baseType: !101, size: 64, align: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !44, line: 1, size: 128, align: 8, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !44, line: 1, baseType: !99, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !44, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !44, line: 1, baseType: !107, size: 64, align: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !44, line: 1, size: 320, align: 8, elements: !109)
!109 = !{!110, !111, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !44, line: 1, baseType: !101, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !44, line: 1, baseType: !101, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !44, line: 1, baseType: !113, size: 192, align: 64, offset: 128)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !11, size: 192, align: 8, elements: !114)
!114 = !{!115, !122, !123}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !44, line: 1, size: 320, align: 8, elements: !118)
!118 = !{!110, !111, !119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 200)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 208)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 216)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !38, line: 1, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !38, line: 1, size: 512, align: 8, elements: !133)
!133 = !{!71, !134, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !38, line: 1, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !38, line: 1, baseType: !68, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !38, line: 1, baseType: !68, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 456)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !38, line: 1, baseType: !144, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !38, line: 1, size: 17280, align: 8, elements: !146)
!146 = !{!147, !148, !150, !151, !158, !164, !165, !167, !169, !170, !171, !173, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !186, !187, !188, !192, !193, !194, !195, !196, !197, !201, !202, !204, !205, !215, !216, !217, !218, !223, !224, !225, !226, !227, !228, !229, !246, !247, !248, !250, !254, !255, !264, !265, !266, !267, !268}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !38, line: 1, baseType: !149, size: 64, align: 64, offset: 64)
!149 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !38, line: 1, baseType: !152, size: 1024, align: 64, offset: 192)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !38, line: 1, size: 1024, align: 8, elements: !153)
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !38, line: 1, baseType: !155, size: 1024, align: 64)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 1024, align: 8, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 16, lowerBound: 0)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !38, line: 1, baseType: !159, size: 64, align: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !161)
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !38, line: 1, baseType: !166, size: 64, align: 64, offset: 1344)
!166 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !38, line: 1, baseType: !168, size: 64, align: 64, offset: 1408)
!168 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !38, line: 1, baseType: !168, size: 64, align: 64, offset: 1472)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !38, line: 1, baseType: !168, size: 64, align: 64, offset: 1536)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 1600)
!172 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !38, line: 1, baseType: !174, size: 32, align: 32, offset: 1664)
!174 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !38, line: 1, baseType: !174, size: 32, align: 32, offset: 1696)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !38, line: 1, baseType: !102, size: 128, align: 64, offset: 1728)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !38, line: 1, baseType: !174, size: 32, align: 32, offset: 1856)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !38, line: 1, baseType: !174, size: 32, align: 32, offset: 1888)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !38, line: 1, baseType: !174, size: 32, align: 32, offset: 1920)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !38, line: 1, baseType: !174, size: 32, align: 32, offset: 1952)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 1984)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 1992)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 2000)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !38, line: 1, baseType: !185, size: 8, align: 8, offset: 2008)
!185 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 2016)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 2048)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !38, line: 1, baseType: !189, size: 64, align: 32, offset: 2080)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, align: 4, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 2, lowerBound: 0)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 2144)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !38, line: 1, baseType: !85, size: 8, align: 8, offset: 2152)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !38, line: 1, baseType: !149, size: 64, align: 64, offset: 2176)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !38, line: 1, baseType: !174, size: 32, align: 32, offset: 2240)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 2272)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !38, line: 1, baseType: !198, size: 64, align: 64, offset: 2304)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !38, line: 1, size: 64, align: 8, elements: !199)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !38, line: 1, baseType: !80, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2368)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !38, line: 1, baseType: !203, size: 64, align: 64, offset: 2432)
!203 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !38, line: 1, baseType: !166, size: 64, align: 64, offset: 2496)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !38, line: 1, baseType: !206, size: 12288, align: 64, offset: 2560)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 12288, align: 8, elements: !213)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !38, line: 1, size: 384, align: 8, elements: !208)
!208 = !{!209, !210, !211, !212}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !38, line: 1, baseType: !80, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !38, line: 1, baseType: !102, size: 128, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !38, line: 1, baseType: !102, size: 128, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!213 = !{!214}
!214 = !DISubrange(count: 32, lowerBound: 0)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 14848)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 14880)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !38, line: 1, baseType: !203, size: 64, align: 64, offset: 14912)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !38, line: 1, baseType: !219, size: 64, align: 64, offset: 14976)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !221)
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !94, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 15040)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !38, line: 1, baseType: !85, size: 8, align: 8, offset: 15104)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 15168)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 15232)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 15264)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 15296)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !38, line: 1, baseType: !230, size: 192, align: 64, offset: 15360)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !11, size: 192, align: 8, elements: !231)
!231 = !{!232, !237, !238}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !11, line: 1, baseType: !233, size: 64, align: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !38, line: 1, size: 64, align: 8, elements: !234)
!234 = !{!235, !200}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !38, line: 1, baseType: !236, align: 8)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !38, line: 1, align: 1, elements: !41)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !11, line: 1, baseType: !83, size: 32, align: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !11, line: 1, baseType: !239, size: 64, align: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !241)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!97, !97}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 15552)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 15584)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !38, line: 1, baseType: !249, align: 8, offset: 15616)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !38, line: 1, align: 1, elements: !41)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !38, line: 1, baseType: !251, size: 8, align: 8, offset: 15616)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !38, line: 1, size: 8, align: 1, elements: !252)
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !38, line: 1, baseType: !85, size: 8, align: 8)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 15680)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !38, line: 1, baseType: !256, size: 1280, align: 64, offset: 15744)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 1280, align: 8, elements: !262)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !38, line: 1, size: 128, align: 8, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !38, line: 1, baseType: !80, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !38, line: 1, baseType: !261, size: 64, align: 64, offset: 64)
!261 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!262 = !{!263}
!263 = !DISubrange(count: 10, lowerBound: 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 17024)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 17088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 17152)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 17160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !38, line: 1, baseType: !198, size: 64, align: 64, offset: 17216)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !38, line: 1, baseType: !166, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !38, line: 1, baseType: !277, size: 8, align: 8, offset: 640)
!277 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 648)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 656)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 672)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 680)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 688)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 696)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 712)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !38, line: 1, baseType: !85, size: 8, align: 8, offset: 720)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !38, line: 1, baseType: !185, size: 8, align: 8, offset: 728)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 736)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 744)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !38, line: 1, baseType: !85, size: 8, align: 8, offset: 752)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 832)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 896)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !38, line: 1, baseType: !149, size: 64, align: 64, offset: 960)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !38, line: 1, baseType: !168, size: 64, align: 64, offset: 1024)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !38, line: 1, baseType: !203, size: 64, align: 64, offset: 1088)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 1152)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !38, line: 1, baseType: !300, size: 192, align: 64, offset: 1216)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !11, size: 192, align: 8, elements: !301)
!301 = !{!302, !122, !123}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !99, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 1408)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 1472)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 1536)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 1600)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !38, line: 1, baseType: !308, size: 64, align: 64, offset: 1664)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !11, size: 192, align: 8, elements: !310)
!310 = !{!311, !122, !123}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !38, line: 1, size: 320, align: 8, elements: !314)
!314 = !{!315, !320, !321}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !38, line: 1, baseType: !316, size: 192, align: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !11, size: 192, align: 8, elements: !317)
!317 = !{!318, !122, !123}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 1728)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !38, line: 1, baseType: !324, size: 64, align: 64, offset: 1792)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !38, line: 1, size: 704, align: 8, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 416)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 424)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !38, line: 1, baseType: !340, size: 64, align: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !38, line: 1, size: 768, align: 8, elements: !342)
!342 = !{!343, !345, !346, !347, !349, !350, !382, !383, !384, !389, !390}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !38, line: 1, baseType: !344, size: 64, align: 64)
!344 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !38, line: 1, baseType: !344, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !38, line: 1, baseType: !348, size: 16, align: 16, offset: 192)
!348 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !38, line: 1, baseType: !351, size: 64, align: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !38, line: 1, size: 512, align: 8, elements: !353)
!353 = !{!354, !355, !356, !357, !359, !360, !361, !362, !363, !364, !365, !381}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !38, line: 1, baseType: !80, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !38, line: 1, baseType: !358, size: 8, align: 8, offset: 160)
!358 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !38, line: 1, baseType: !85, size: 8, align: 8, offset: 168)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !38, line: 1, baseType: !85, size: 8, align: 8, offset: 176)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !38, line: 1, baseType: !85, size: 8, align: 8, offset: 184)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !38, line: 1, baseType: !219, size: 64, align: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !38, line: 1, baseType: !99, size: 64, align: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !38, line: 1, baseType: !101, size: 64, align: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !38, line: 1, baseType: !366, size: 64, align: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !38, line: 1, size: 320, align: 8, elements: !368)
!368 = !{!369, !370, !371}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !38, line: 1, baseType: !101, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !38, line: 1, baseType: !101, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !38, line: 1, baseType: !372, size: 192, align: 64, offset: 128)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !11, size: 192, align: 8, elements: !373)
!373 = !{!374, !122, !123}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !38, line: 1, size: 320, align: 8, elements: !377)
!377 = !{!369, !370, !378, !379, !380}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !38, line: 1, baseType: !344, size: 64, align: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !38, line: 1, baseType: !344, size: 64, align: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !38, line: 1, baseType: !385, size: 128, align: 64, offset: 448)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !38, line: 1, size: 128, align: 8, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !38, line: 1, baseType: !385, size: 128, align: 64, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !38, line: 1, baseType: !233, size: 64, align: 64, offset: 704)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 1856)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !38, line: 1, baseType: !393, size: 64, align: 64, offset: 1920)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !38, line: 1, size: 576, align: 8, elements: !395)
!395 = !{!396, !397, !398, !399, !407, !408, !409, !410}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !38, line: 1, baseType: !168, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !38, line: 1, baseType: !400, size: 64, align: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!19, !73, !80}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !73, size: 128, align: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !38, line: 1, baseType: !83, size: 32, align: 32, offset: 1984)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 2048)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2112)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 2176)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 2240)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 2304)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 2368)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 2432)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2496)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 2560)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2624)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !38, line: 1, baseType: !423, size: 7808, align: 64, offset: 2688)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 7808, align: 8, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 122, lowerBound: 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !38, line: 1, baseType: !427, size: 64, align: 64, offset: 10496)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!19, !18}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 10560)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 10624)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 10688)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 10696)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 10752)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 10816)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 10880)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 10888)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 10896)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 10904)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !38, line: 1, baseType: !97, size: 8, align: 8, offset: 10912)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !38, line: 1, baseType: !80, size: 64, align: 64, offset: 10944)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !38, line: 1, baseType: !423, size: 7808, align: 64, offset: 11008)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !38, line: 1, baseType: !448, size: 640, align: 64, offset: 18816)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 640, align: 8, elements: !262)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !11, size: 128, align: 8, elements: !451)
!451 = !{!452, !456}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !11, line: 1, baseType: !453, size: 64, align: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !38, line: 1, size: 64, align: 8, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !38, line: 1, baseType: !166, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !11, line: 1, baseType: !174, size: 32, align: 32, offset: 64)
!457 = !DILocalVariable(name: "$this21", arg: 1, scope: !61, file: !38, line: 1, type: !449)
!458 = !DILocation(line: 1, column: 1, scope: !61)
!459 = !DILocalVariable(name: "$ret1", scope: !61, file: !38, line: 1, type: !64)
!460 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !38, line: 1, type: !461, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!461 = !DISubroutineType(types: !462)
!462 = !{!19, !449, !449, !463}
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !38, line: 1, size: 128, align: 8, elements: !464)
!464 = !{!455, !465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !38, line: 1, baseType: !166, size: 64, align: 64, offset: 64)
!466 = !DILocalVariable(name: "$this22", arg: 1, scope: !460, file: !38, line: 1, type: !449)
!467 = !DILocation(line: 1, column: 1, scope: !460)
!468 = !DILocalVariable(name: "$p23", arg: 2, scope: !460, file: !38, line: 1, type: !463)
!469 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !38, line: 1, type: !470, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!470 = !DISubroutineType(types: !471)
!471 = !{!19, !449, !449, !64}
!472 = !DILocalVariable(name: "$this24", arg: 1, scope: !469, file: !38, line: 1, type: !449)
!473 = !DILocation(line: 1, column: 1, scope: !469)
!474 = !DILocalVariable(name: "$p25", arg: 2, scope: !469, file: !38, line: 1, type: !64)
!475 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !38, line: 1, type: !476, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!476 = !DISubroutineType(types: !477)
!477 = !{!97, !449, !449}
!478 = !DILocalVariable(name: "$this26", arg: 1, scope: !475, file: !38, line: 1, type: !449)
!479 = !DILocation(line: 1, column: 1, scope: !475)
!480 = !DILocalVariable(name: "$ret2", scope: !475, file: !38, line: 1, type: !97)
!481 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !44, line: 1, type: !95, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!482 = !DILocalVariable(name: "key1", arg: 1, scope: !481, file: !44, line: 1, type: !18)
!483 = !DILocation(line: 1, column: 1, scope: !481)
!484 = !DILocalVariable(name: "key2", arg: 2, scope: !481, file: !44, line: 1, type: !18)
!485 = !DILocalVariable(name: "$ret3", scope: !481, file: !44, line: 1, type: !97)
!486 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !44, line: 1, type: !95, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!487 = !DILocalVariable(name: "key1", arg: 1, scope: !486, file: !44, line: 1, type: !18)
!488 = !DILocation(line: 1, column: 1, scope: !486)
!489 = !DILocalVariable(name: "key2", arg: 2, scope: !486, file: !44, line: 1, type: !18)
!490 = !DILocalVariable(name: "$ret4", scope: !486, file: !44, line: 1, type: !97)
!491 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !44, line: 1, type: !95, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!492 = !DILocalVariable(name: "key1", arg: 1, scope: !491, file: !44, line: 1, type: !18)
!493 = !DILocation(line: 1, column: 1, scope: !491)
!494 = !DILocalVariable(name: "key2", arg: 2, scope: !491, file: !44, line: 1, type: !18)
!495 = !DILocalVariable(name: "$ret5", scope: !491, file: !44, line: 1, type: !97)
!496 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !44, line: 1, type: !95, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!497 = !DILocalVariable(name: "key1", arg: 1, scope: !496, file: !44, line: 1, type: !18)
!498 = !DILocation(line: 1, column: 1, scope: !496)
!499 = !DILocalVariable(name: "key2", arg: 2, scope: !496, file: !44, line: 1, type: !18)
!500 = !DILocalVariable(name: "$ret6", scope: !496, file: !44, line: 1, type: !97)
!501 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !44, line: 1, type: !95, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!502 = !DILocalVariable(name: "key1", arg: 1, scope: !501, file: !44, line: 1, type: !18)
!503 = !DILocation(line: 1, column: 1, scope: !501)
!504 = !DILocalVariable(name: "key2", arg: 2, scope: !501, file: !44, line: 1, type: !18)
