; ModuleID = 'utbotgo/functions/getSign/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 7, !"Dwarf Version", i32 4}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"uwtable", i32 1}
!5 = !{i32 7, !"frame-pointer", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_Go, file: !7, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !8)
!7 = !DIFile(filename: "./get_sign.go", directory: "/workspace")
!8 = !{!9, !22, !24, !26, !28, !30}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "", directory: "")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !11, size: 128, align: 8, elements: !13)
!13 = !{!14, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !11, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !11, line: 1, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, align: 8, elements: !20)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "void")
!20 = !{!21}
!21 = !DISubrange(count: 1, lowerBound: 0)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!33 = !DIFile(filename: "/klee/runtime/Freestanding/memcmp.c", directory: "/klee/build/runtime/Freestanding")
!34 = distinct !DICompileUnit(language: DW_LANG_C99, file: !35, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!35 = !DIFile(filename: "/klee/runtime/Freestanding/memcpy.c", directory: "/klee/build/runtime/Freestanding")
!36 = !{!"clang version 14.0.0"}
!37 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !38, line: 1, type: !39, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!38 = !DIFile(filename: "get_sign.go", directory: ".")
!39 = !DISubroutineType(types: !40)
!40 = !{!19}
!41 = !{}
!42 = !DILocation(line: 1, column: 1, scope: !43)
!43 = !DILexicalBlockFile(scope: !37, file: !44, discriminator: 0)
!44 = !DIFile(filename: "<built-in>", directory: "")
!45 = distinct !DISubprogram(name: "main.getSign", scope: null, file: !38, line: 3, type: !46, scopeLine: 3, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!46 = !DISubroutineType(types: !47)
!47 = !{!15, !48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!49 = !DILocalVariable(name: "i", arg: 1, scope: !45, file: !38, line: 3, type: !48)
!50 = !DILocation(line: 3, column: 14, scope: !45)
!51 = !DILocalVariable(name: "$ret0", scope: !45, file: !38, line: 3, type: !15)
!52 = !DILocation(line: 3, column: 22, scope: !45)
!53 = !DILocation(line: 4, column: 6, scope: !45)
!54 = !DILocation(line: 4, column: 5, scope: !45)
!55 = !DILocation(line: 4, column: 8, scope: !45)
!56 = !DILocation(line: 4, column: 2, scope: !45)
!57 = !DILocation(line: 0, scope: !45)
!58 = !DILocation(line: 5, column: 3, scope: !45)
!59 = !DILocation(line: 7, column: 6, scope: !45)
!60 = !DILocation(line: 7, column: 5, scope: !45)
!61 = !DILocation(line: 7, column: 8, scope: !45)
!62 = !DILocation(line: 7, column: 2, scope: !45)
!63 = !DILocation(line: 8, column: 3, scope: !45)
!64 = !DILocation(line: 10, column: 2, scope: !45)
!65 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !38, line: 1, type: !66, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !453, !453}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !38, line: 1, size: 19456, align: 8, elements: !70)
!70 = !{!71, !134, !147, !273, !274, !275, !276, !277, !278, !279, !280, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !307, !308, !309, !310, !311, !326, !327, !395, !396, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !430, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !38, line: 1, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !38, line: 1, size: 256, align: 8, elements: !74)
!74 = !{!75, !76, !130, !131, !132, !133}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !77, size: 128, align: 64, offset: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !11, size: 128, align: 8, elements: !78)
!78 = !{!79, !129}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !44, line: 1, size: 512, align: 8, elements: !82)
!82 = !{!83, !85, !86, !88, !90, !91, !92, !93, !102, !104, !110, !128}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !44, line: 1, baseType: !84, size: 64, align: 64)
!84 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !44, line: 1, baseType: !84, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !44, line: 1, baseType: !87, size: 32, align: 32, offset: 128)
!87 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !44, line: 1, baseType: !89, size: 8, align: 8, offset: 160)
!89 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !44, line: 1, baseType: !89, size: 8, align: 8, offset: 168)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !44, line: 1, baseType: !89, size: 8, align: 8, offset: 176)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !44, line: 1, baseType: !89, size: 8, align: 8, offset: 184)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !44, line: 1, baseType: !94, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !44, line: 1, size: 64, align: 8, elements: !96)
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !44, line: 1, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !18, !18}
!101 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !44, line: 1, baseType: !103, size: 64, align: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !44, line: 1, baseType: !105, size: 64, align: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !44, line: 1, size: 128, align: 8, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !44, line: 1, baseType: !103, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !44, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !44, line: 1, baseType: !111, size: 64, align: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !44, line: 1, size: 320, align: 8, elements: !113)
!113 = !{!114, !115, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !44, line: 1, baseType: !105, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !44, line: 1, baseType: !105, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !44, line: 1, baseType: !117, size: 192, align: 64, offset: 128)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !11, size: 192, align: 8, elements: !118)
!118 = !{!119, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !44, line: 1, size: 320, align: 8, elements: !122)
!122 = !{!114, !115, !123, !124, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 200)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 208)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 216)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !38, line: 1, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !38, line: 1, size: 512, align: 8, elements: !137)
!137 = !{!75, !138, !140, !141, !142, !143, !144, !145, !146}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !38, line: 1, baseType: !139, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !38, line: 1, baseType: !72, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !38, line: 1, baseType: !72, size: 64, align: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 456)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !38, line: 1, baseType: !148, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !38, line: 1, size: 17280, align: 8, elements: !150)
!150 = !{!151, !152, !154, !155, !162, !168, !169, !171, !173, !174, !175, !177, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !190, !191, !192, !196, !197, !198, !199, !200, !201, !205, !206, !208, !209, !219, !220, !221, !222, !227, !228, !229, !230, !231, !232, !233, !250, !251, !252, !254, !258, !259, !268, !269, !270, !271, !272}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !38, line: 1, baseType: !153, size: 64, align: 64, offset: 64)
!153 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !38, line: 1, baseType: !156, size: 1024, align: 64, offset: 192)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !38, line: 1, size: 1024, align: 8, elements: !157)
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !38, line: 1, baseType: !159, size: 1024, align: 64)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 1024, align: 8, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 16, lowerBound: 0)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !38, line: 1, baseType: !163, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !165)
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 1280)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !38, line: 1, baseType: !170, size: 64, align: 64, offset: 1344)
!170 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 1408)
!172 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 1600)
!176 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !38, line: 1, baseType: !178, size: 32, align: 32, offset: 1664)
!178 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !38, line: 1, baseType: !178, size: 32, align: 32, offset: 1696)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !38, line: 1, baseType: !106, size: 128, align: 64, offset: 1728)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !38, line: 1, baseType: !178, size: 32, align: 32, offset: 1856)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !38, line: 1, baseType: !178, size: 32, align: 32, offset: 1888)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !38, line: 1, baseType: !178, size: 32, align: 32, offset: 1920)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !38, line: 1, baseType: !178, size: 32, align: 32, offset: 1952)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 1984)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 1992)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 2000)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !38, line: 1, baseType: !189, size: 8, align: 8, offset: 2008)
!189 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 2016)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 2048)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !38, line: 1, baseType: !193, size: 64, align: 32, offset: 2080)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 64, align: 4, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 2, lowerBound: 0)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 2144)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !38, line: 1, baseType: !89, size: 8, align: 8, offset: 2152)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !38, line: 1, baseType: !153, size: 64, align: 64, offset: 2176)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !38, line: 1, baseType: !178, size: 32, align: 32, offset: 2240)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 2272)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !38, line: 1, baseType: !202, size: 64, align: 64, offset: 2304)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !38, line: 1, size: 64, align: 8, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !38, line: 1, baseType: !84, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2368)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !38, line: 1, baseType: !207, size: 64, align: 64, offset: 2432)
!207 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !38, line: 1, baseType: !170, size: 64, align: 64, offset: 2496)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !38, line: 1, baseType: !210, size: 12288, align: 64, offset: 2560)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 12288, align: 8, elements: !217)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !38, line: 1, size: 384, align: 8, elements: !212)
!212 = !{!213, !214, !215, !216}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !38, line: 1, baseType: !84, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !38, line: 1, baseType: !106, size: 128, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !38, line: 1, baseType: !106, size: 128, align: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!217 = !{!218}
!218 = !DISubrange(count: 32, lowerBound: 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 14848)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 14880)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !38, line: 1, baseType: !207, size: 64, align: 64, offset: 14912)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !38, line: 1, baseType: !223, size: 64, align: 64, offset: 14976)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !225)
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !98, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 15040)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !38, line: 1, baseType: !89, size: 8, align: 8, offset: 15104)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 15168)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 15232)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 15264)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 15296)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !38, line: 1, baseType: !234, size: 192, align: 64, offset: 15360)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !11, size: 192, align: 8, elements: !235)
!235 = !{!236, !241, !242}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !11, line: 1, baseType: !237, size: 64, align: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !38, line: 1, size: 64, align: 8, elements: !238)
!238 = !{!239, !204}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !38, line: 1, baseType: !240, align: 8)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !38, line: 1, align: 1, elements: !41)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !11, line: 1, baseType: !87, size: 32, align: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !11, line: 1, baseType: !243, size: 64, align: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !245)
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!101, !101}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 15552)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 15584)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !38, line: 1, baseType: !253, align: 8, offset: 15616)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !38, line: 1, align: 1, elements: !41)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !38, line: 1, baseType: !255, size: 8, align: 8, offset: 15616)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !38, line: 1, size: 8, align: 1, elements: !256)
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !38, line: 1, baseType: !89, size: 8, align: 8)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 15680)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !38, line: 1, baseType: !260, size: 1280, align: 64, offset: 15744)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 1280, align: 8, elements: !266)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !38, line: 1, size: 128, align: 8, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !38, line: 1, baseType: !84, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !38, line: 1, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!266 = !{!267}
!267 = !DISubrange(count: 10, lowerBound: 0)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 17024)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 17088)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 17152)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 17160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !38, line: 1, baseType: !202, size: 64, align: 64, offset: 17216)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !38, line: 1, baseType: !170, size: 64, align: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !38, line: 1, baseType: !281, size: 8, align: 8, offset: 640)
!281 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 648)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 656)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 664)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 672)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 680)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 688)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 696)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 712)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !38, line: 1, baseType: !89, size: 8, align: 8, offset: 720)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !38, line: 1, baseType: !189, size: 8, align: 8, offset: 728)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 736)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 744)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !38, line: 1, baseType: !89, size: 8, align: 8, offset: 752)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 832)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 896)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !38, line: 1, baseType: !153, size: 64, align: 64, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 1024)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !38, line: 1, baseType: !207, size: 64, align: 64, offset: 1088)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 1152)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !38, line: 1, baseType: !304, size: 192, align: 64, offset: 1216)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !11, size: 192, align: 8, elements: !305)
!305 = !{!306, !126, !127}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !103, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 1408)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 1472)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 1536)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 1600)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !38, line: 1, baseType: !312, size: 64, align: 64, offset: 1664)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !11, size: 192, align: 8, elements: !314)
!314 = !{!315, !126, !127}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !38, line: 1, size: 320, align: 8, elements: !318)
!318 = !{!319, !324, !325}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !38, line: 1, baseType: !320, size: 192, align: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !11, size: 192, align: 8, elements: !321)
!321 = !{!322, !126, !127}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 1728)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !38, line: 1, baseType: !328, size: 64, align: 64, offset: 1792)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !38, line: 1, size: 704, align: 8, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 416)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 424)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 512)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !38, line: 1, baseType: !344, size: 64, align: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !38, line: 1, size: 768, align: 8, elements: !346)
!346 = !{!347, !349, !350, !351, !353, !354, !386, !387, !388, !393, !394}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !38, line: 1, baseType: !348, size: 64, align: 64)
!348 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !38, line: 1, baseType: !348, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !38, line: 1, baseType: !352, size: 16, align: 16, offset: 192)
!352 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !38, line: 1, baseType: !355, size: 64, align: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !38, line: 1, size: 512, align: 8, elements: !357)
!357 = !{!358, !359, !360, !361, !363, !364, !365, !366, !367, !368, !369, !385}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !38, line: 1, baseType: !84, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !38, line: 1, baseType: !362, size: 8, align: 8, offset: 160)
!362 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !38, line: 1, baseType: !89, size: 8, align: 8, offset: 168)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !38, line: 1, baseType: !89, size: 8, align: 8, offset: 176)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !38, line: 1, baseType: !89, size: 8, align: 8, offset: 184)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !38, line: 1, baseType: !223, size: 64, align: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !38, line: 1, baseType: !103, size: 64, align: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !38, line: 1, baseType: !105, size: 64, align: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !38, line: 1, baseType: !370, size: 64, align: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !38, line: 1, size: 320, align: 8, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !38, line: 1, baseType: !105, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !38, line: 1, baseType: !105, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !38, line: 1, baseType: !376, size: 192, align: 64, offset: 128)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !11, size: 192, align: 8, elements: !377)
!377 = !{!378, !126, !127}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !38, line: 1, size: 320, align: 8, elements: !381)
!381 = !{!373, !374, !382, !383, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !38, line: 1, baseType: !348, size: 64, align: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !38, line: 1, baseType: !348, size: 64, align: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !38, line: 1, baseType: !389, size: 128, align: 64, offset: 448)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !38, line: 1, size: 128, align: 8, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !38, line: 1, baseType: !389, size: 128, align: 64, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !38, line: 1, baseType: !237, size: 64, align: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 1856)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !38, line: 1, baseType: !397, size: 64, align: 64, offset: 1920)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !38, line: 1, size: 576, align: 8, elements: !399)
!399 = !{!400, !401, !402, !403, !411, !412, !413, !414}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !38, line: 1, baseType: !172, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !38, line: 1, baseType: !404, size: 64, align: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !406)
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!19, !77, !84}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !77, size: 128, align: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !38, line: 1, baseType: !87, size: 32, align: 32, offset: 1984)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !38, line: 1, baseType: !176, size: 64, align: 64, offset: 2048)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2112)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 2176)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 2240)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 2304)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 2368)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 2432)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2496)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 2560)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2624)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !38, line: 1, baseType: !427, size: 7808, align: 64, offset: 2688)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 7808, align: 8, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 122, lowerBound: 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !38, line: 1, baseType: !431, size: 64, align: 64, offset: 10496)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!19, !18}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 10560)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 10624)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 10688)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 10696)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 10752)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 10816)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 10880)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 10888)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 10896)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 10904)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !38, line: 1, baseType: !101, size: 8, align: 8, offset: 10912)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !38, line: 1, baseType: !84, size: 64, align: 64, offset: 10944)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !38, line: 1, baseType: !427, size: 7808, align: 64, offset: 11008)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !38, line: 1, baseType: !452, size: 640, align: 64, offset: 18816)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 640, align: 8, elements: !266)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !11, size: 128, align: 8, elements: !455)
!455 = !{!456, !460}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !11, line: 1, baseType: !457, size: 64, align: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !38, line: 1, size: 64, align: 8, elements: !458)
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !38, line: 1, baseType: !170, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !11, line: 1, baseType: !178, size: 32, align: 32, offset: 64)
!461 = !DILocalVariable(name: "$this21", arg: 1, scope: !65, file: !38, line: 1, type: !453)
!462 = !DILocation(line: 1, column: 1, scope: !65)
!463 = !DILocalVariable(name: "$ret1", scope: !65, file: !38, line: 1, type: !68)
!464 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !38, line: 1, type: !465, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!465 = !DISubroutineType(types: !466)
!466 = !{!19, !453, !453, !467}
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !38, line: 1, size: 128, align: 8, elements: !468)
!468 = !{!459, !469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !38, line: 1, baseType: !170, size: 64, align: 64, offset: 64)
!470 = !DILocalVariable(name: "$this22", arg: 1, scope: !464, file: !38, line: 1, type: !453)
!471 = !DILocation(line: 1, column: 1, scope: !464)
!472 = !DILocalVariable(name: "$p23", arg: 2, scope: !464, file: !38, line: 1, type: !467)
!473 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !38, line: 1, type: !474, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!474 = !DISubroutineType(types: !475)
!475 = !{!19, !453, !453, !68}
!476 = !DILocalVariable(name: "$this24", arg: 1, scope: !473, file: !38, line: 1, type: !453)
!477 = !DILocation(line: 1, column: 1, scope: !473)
!478 = !DILocalVariable(name: "$p25", arg: 2, scope: !473, file: !38, line: 1, type: !68)
!479 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !38, line: 1, type: !480, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!480 = !DISubroutineType(types: !481)
!481 = !{!101, !453, !453}
!482 = !DILocalVariable(name: "$this26", arg: 1, scope: !479, file: !38, line: 1, type: !453)
!483 = !DILocation(line: 1, column: 1, scope: !479)
!484 = !DILocalVariable(name: "$ret2", scope: !479, file: !38, line: 1, type: !101)
!485 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !44, line: 1, type: !99, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!486 = !DILocalVariable(name: "key1", arg: 1, scope: !485, file: !44, line: 1, type: !18)
!487 = !DILocation(line: 1, column: 1, scope: !485)
!488 = !DILocalVariable(name: "key2", arg: 2, scope: !485, file: !44, line: 1, type: !18)
!489 = !DILocalVariable(name: "$ret3", scope: !485, file: !44, line: 1, type: !101)
!490 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !44, line: 1, type: !99, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!491 = !DILocalVariable(name: "key1", arg: 1, scope: !490, file: !44, line: 1, type: !18)
!492 = !DILocation(line: 1, column: 1, scope: !490)
!493 = !DILocalVariable(name: "key2", arg: 2, scope: !490, file: !44, line: 1, type: !18)
!494 = !DILocalVariable(name: "$ret4", scope: !490, file: !44, line: 1, type: !101)
!495 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !44, line: 1, type: !99, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!496 = !DILocalVariable(name: "key1", arg: 1, scope: !495, file: !44, line: 1, type: !18)
!497 = !DILocation(line: 1, column: 1, scope: !495)
!498 = !DILocalVariable(name: "key2", arg: 2, scope: !495, file: !44, line: 1, type: !18)
!499 = !DILocalVariable(name: "$ret5", scope: !495, file: !44, line: 1, type: !101)
!500 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !44, line: 1, type: !99, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!501 = !DILocalVariable(name: "key1", arg: 1, scope: !500, file: !44, line: 1, type: !18)
!502 = !DILocation(line: 1, column: 1, scope: !500)
!503 = !DILocalVariable(name: "key2", arg: 2, scope: !500, file: !44, line: 1, type: !18)
!504 = !DILocalVariable(name: "$ret6", scope: !500, file: !44, line: 1, type: !101)
!505 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !44, line: 1, type: !99, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!506 = !DILocalVariable(name: "key1", arg: 1, scope: !505, file: !44, line: 1, type: !18)
!507 = !DILocation(line: 1, column: 1, scope: !505)
!508 = !DILocalVariable(name: "key2", arg: 2, scope: !505, file: !44, line: 1, type: !18)
