; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./panic.go", directory: "/workspace")
!5 = !{!6, !19, !21, !23, !25, !27}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !8, size: 128, align: 8, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, align: 8, elements: !17)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "void")
!17 = !{!18}
!18 = !DISubrange(count: 1, lowerBound: 0)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!29 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !30, line: 1, type: !31, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!30 = !DIFile(filename: "panic.go", directory: ".")
!31 = !DISubroutineType(types: !32)
!32 = !{!16}
!33 = !{}
!34 = !DILocation(line: 1, column: 1, scope: !35)
!35 = !DILexicalBlockFile(scope: !29, file: !36, discriminator: 0)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = distinct !DISubprogram(name: "main.panicFunc", scope: null, file: !30, line: 3, type: !38, scopeLine: 3, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!38 = !DISubroutineType(types: !39)
!39 = !{!12, !12}
!40 = !DILocalVariable(name: "a", arg: 1, scope: !37, file: !30, line: 3, type: !12)
!41 = !DILocation(line: 3, column: 16, scope: !37)
!42 = !DILocalVariable(name: "$ret0", scope: !37, file: !30, line: 3, type: !12)
!43 = !DILocation(line: 3, column: 23, scope: !37)
!44 = !DILocation(line: 4, column: 5, scope: !37)
!45 = !DILocation(line: 4, column: 7, scope: !37)
!46 = !DILocation(line: 4, column: 2, scope: !37)
!47 = !DILocation(line: 5, column: 3, scope: !37)
!48 = !DILocation(line: 7, column: 5, scope: !37)
!49 = !DILocation(line: 7, column: 7, scope: !37)
!50 = !DILocation(line: 7, column: 2, scope: !37)
!51 = !DILocation(line: 8, column: 3, scope: !37)
!52 = !DILocation(line: 10, column: 2, scope: !37)
!53 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !30, line: 1, type: !54, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !441, !441}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !30, line: 1, size: 19456, align: 8, elements: !58)
!58 = !{!59, !122, !135, !261, !262, !263, !264, !265, !266, !267, !268, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !295, !296, !297, !298, !299, !314, !315, !383, !384, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !418, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !30, line: 1, size: 256, align: 8, elements: !62)
!62 = !{!63, !64, !118, !119, !120, !121}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !65, size: 128, align: 64, offset: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !8, size: 128, align: 8, elements: !66)
!66 = !{!67, !117}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 512, align: 8, elements: !70)
!70 = !{!71, !73, !74, !76, !78, !79, !80, !81, !90, !92, !98, !116}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !72, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !75, size: 32, align: 32, offset: 128)
!75 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !36, line: 1, baseType: !77, size: 8, align: 8, offset: 160)
!77 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !77, size: 8, align: 8, offset: 168)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !77, size: 8, align: 8, offset: 176)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !77, size: 8, align: 8, offset: 184)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !36, line: 1, baseType: !82, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !84)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!89, !15, !15}
!89 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !91, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !93, size: 64, align: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !91, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !99, size: 64, align: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !101)
!101 = !{!102, !103, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !93, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !93, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !105, size: 192, align: 64, offset: 128)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !8, size: 192, align: 8, elements: !106)
!106 = !{!107, !114, !115}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !110)
!110 = !{!102, !103, !111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 200)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 208)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 216)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !30, line: 1, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !30, line: 1, size: 512, align: 8, elements: !125)
!125 = !{!63, !126, !128, !129, !130, !131, !132, !133, !134}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !30, line: 1, baseType: !127, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !30, line: 1, baseType: !60, size: 64, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !60, size: 64, align: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 456)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !30, line: 1, baseType: !136, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !30, line: 1, size: 17280, align: 8, elements: !138)
!138 = !{!139, !140, !142, !143, !150, !156, !157, !159, !161, !162, !163, !165, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !178, !179, !180, !184, !185, !186, !187, !188, !189, !193, !194, !196, !197, !207, !208, !209, !210, !215, !216, !217, !218, !219, !220, !221, !238, !239, !240, !242, !246, !247, !256, !257, !258, !259, !260}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !30, line: 1, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !30, line: 1, baseType: !144, size: 1024, align: 64, offset: 192)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !30, line: 1, size: 1024, align: 8, elements: !145)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !30, line: 1, baseType: !147, size: 1024, align: 64)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 1024, align: 8, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 16, lowerBound: 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !30, line: 1, baseType: !151, size: 64, align: 64, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !153)
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !30, line: 1, baseType: !158, size: 64, align: 64, offset: 1344)
!158 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !30, line: 1, baseType: !160, size: 64, align: 64, offset: 1408)
!160 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !30, line: 1, baseType: !160, size: 64, align: 64, offset: 1472)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !30, line: 1, baseType: !160, size: 64, align: 64, offset: 1536)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 1600)
!164 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !30, line: 1, baseType: !166, size: 32, align: 32, offset: 1664)
!166 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !30, line: 1, baseType: !166, size: 32, align: 32, offset: 1696)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !30, line: 1, baseType: !94, size: 128, align: 64, offset: 1728)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !30, line: 1, baseType: !166, size: 32, align: 32, offset: 1856)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !30, line: 1, baseType: !166, size: 32, align: 32, offset: 1888)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !30, line: 1, baseType: !166, size: 32, align: 32, offset: 1920)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !30, line: 1, baseType: !166, size: 32, align: 32, offset: 1952)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 1984)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 1992)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 2000)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !30, line: 1, baseType: !177, size: 8, align: 8, offset: 2008)
!177 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 2016)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 2048)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !30, line: 1, baseType: !181, size: 64, align: 32, offset: 2080)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, align: 4, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 2, lowerBound: 0)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 2144)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !77, size: 8, align: 8, offset: 2152)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !30, line: 1, baseType: !141, size: 64, align: 64, offset: 2176)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !30, line: 1, baseType: !166, size: 32, align: 32, offset: 2240)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 2272)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 2304)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !30, line: 1, size: 64, align: 8, elements: !191)
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !30, line: 1, baseType: !72, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2368)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !195, size: 64, align: 64, offset: 2432)
!195 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !30, line: 1, baseType: !158, size: 64, align: 64, offset: 2496)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !30, line: 1, baseType: !198, size: 12288, align: 64, offset: 2560)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 12288, align: 8, elements: !205)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !30, line: 1, size: 384, align: 8, elements: !200)
!200 = !{!201, !202, !203, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !30, line: 1, baseType: !72, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !30, line: 1, baseType: !94, size: 128, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !30, line: 1, baseType: !94, size: 128, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!205 = !{!206}
!206 = !DISubrange(count: 32, lowerBound: 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 14848)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 14880)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !30, line: 1, baseType: !195, size: 64, align: 64, offset: 14912)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !30, line: 1, baseType: !211, size: 64, align: 64, offset: 14976)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !213)
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !86, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15040)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !30, line: 1, baseType: !77, size: 8, align: 8, offset: 15104)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15168)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 15232)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 15264)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15296)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !30, line: 1, baseType: !222, size: 192, align: 64, offset: 15360)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !8, size: 192, align: 8, elements: !223)
!223 = !{!224, !229, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !8, line: 1, baseType: !225, size: 64, align: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !30, line: 1, size: 64, align: 8, elements: !226)
!226 = !{!227, !192}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !30, line: 1, baseType: !228, align: 8)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !30, line: 1, align: 1, elements: !33)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !8, line: 1, baseType: !75, size: 32, align: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !8, line: 1, baseType: !231, size: 64, align: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !233)
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!89, !89}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 15552)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 15584)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !30, line: 1, baseType: !241, align: 8, offset: 15616)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !30, line: 1, align: 1, elements: !33)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !30, line: 1, baseType: !243, size: 8, align: 8, offset: 15616)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !30, line: 1, size: 8, align: 1, elements: !244)
!244 = !{!245}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !30, line: 1, baseType: !77, size: 8, align: 8)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15680)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !30, line: 1, baseType: !248, size: 1280, align: 64, offset: 15744)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 1280, align: 8, elements: !254)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !30, line: 1, size: 128, align: 8, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !30, line: 1, baseType: !72, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !30, line: 1, baseType: !253, size: 64, align: 64, offset: 64)
!253 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!254 = !{!255}
!255 = !DISubrange(count: 10, lowerBound: 0)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 17024)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 17088)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 17152)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 17160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !30, line: 1, baseType: !190, size: 64, align: 64, offset: 17216)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !158, size: 64, align: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !30, line: 1, baseType: !269, size: 8, align: 8, offset: 640)
!269 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 648)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 656)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 664)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 672)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 680)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 688)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 696)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 712)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !30, line: 1, baseType: !77, size: 8, align: 8, offset: 720)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !30, line: 1, baseType: !177, size: 8, align: 8, offset: 728)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 736)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 744)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !30, line: 1, baseType: !77, size: 8, align: 8, offset: 752)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 768)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 832)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 896)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !30, line: 1, baseType: !141, size: 64, align: 64, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !30, line: 1, baseType: !160, size: 64, align: 64, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !30, line: 1, baseType: !195, size: 64, align: 64, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 1152)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !30, line: 1, baseType: !292, size: 192, align: 64, offset: 1216)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !8, size: 192, align: 8, elements: !293)
!293 = !{!294, !114, !115}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !91, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 1408)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 1472)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 1536)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 1600)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !30, line: 1, baseType: !300, size: 64, align: 64, offset: 1664)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !8, size: 192, align: 8, elements: !302)
!302 = !{!303, !114, !115}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !30, line: 1, size: 320, align: 8, elements: !306)
!306 = !{!307, !312, !313}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !30, line: 1, baseType: !308, size: 192, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !8, size: 192, align: 8, elements: !309)
!309 = !{!310, !114, !115}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 1728)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !30, line: 1, baseType: !316, size: 64, align: 64, offset: 1792)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !30, line: 1, size: 704, align: 8, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 424)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !30, line: 1, baseType: !332, size: 64, align: 64, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !30, line: 1, size: 768, align: 8, elements: !334)
!334 = !{!335, !337, !338, !339, !341, !342, !374, !375, !376, !381, !382}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !30, line: 1, baseType: !336, size: 64, align: 64)
!336 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !30, line: 1, baseType: !336, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !30, line: 1, baseType: !340, size: 16, align: 16, offset: 192)
!340 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !30, line: 1, baseType: !343, size: 64, align: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !30, line: 1, size: 512, align: 8, elements: !345)
!345 = !{!346, !347, !348, !349, !351, !352, !353, !354, !355, !356, !357, !373}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !30, line: 1, baseType: !72, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !30, line: 1, baseType: !350, size: 8, align: 8, offset: 160)
!350 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !30, line: 1, baseType: !77, size: 8, align: 8, offset: 168)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !30, line: 1, baseType: !77, size: 8, align: 8, offset: 176)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !30, line: 1, baseType: !77, size: 8, align: 8, offset: 184)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !30, line: 1, baseType: !211, size: 64, align: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !30, line: 1, baseType: !91, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !30, line: 1, baseType: !93, size: 64, align: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !30, line: 1, baseType: !358, size: 64, align: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !30, line: 1, size: 320, align: 8, elements: !360)
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !30, line: 1, baseType: !93, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !30, line: 1, baseType: !93, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !30, line: 1, baseType: !364, size: 192, align: 64, offset: 128)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !8, size: 192, align: 8, elements: !365)
!365 = !{!366, !114, !115}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !30, line: 1, size: 320, align: 8, elements: !369)
!369 = !{!361, !362, !370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !30, line: 1, baseType: !336, size: 64, align: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !30, line: 1, baseType: !336, size: 64, align: 64, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !30, line: 1, baseType: !377, size: 128, align: 64, offset: 448)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !30, line: 1, size: 128, align: 8, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !30, line: 1, baseType: !377, size: 128, align: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !30, line: 1, baseType: !225, size: 64, align: 64, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1856)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !30, line: 1, baseType: !385, size: 64, align: 64, offset: 1920)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !30, line: 1, size: 576, align: 8, elements: !387)
!387 = !{!388, !389, !390, !391, !399, !400, !401, !402}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !30, line: 1, baseType: !160, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !30, line: 1, baseType: !392, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!16, !65, !72}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !65, size: 128, align: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !30, line: 1, baseType: !75, size: 32, align: 32, offset: 1984)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !30, line: 1, baseType: !164, size: 64, align: 64, offset: 2048)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2112)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 2176)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 2240)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 2304)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 2368)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 2432)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2496)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 2560)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2624)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !30, line: 1, baseType: !415, size: 7808, align: 64, offset: 2688)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 7808, align: 8, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 122, lowerBound: 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !30, line: 1, baseType: !419, size: 64, align: 64, offset: 10496)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!16, !15}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 10560)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 10624)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 10688)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 10696)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 10752)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 10816)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 10880)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 10888)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 10896)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 10904)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !30, line: 1, baseType: !89, size: 8, align: 8, offset: 10912)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !72, size: 64, align: 64, offset: 10944)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !30, line: 1, baseType: !415, size: 7808, align: 64, offset: 11008)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !30, line: 1, baseType: !440, size: 640, align: 64, offset: 18816)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 640, align: 8, elements: !254)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !8, size: 128, align: 8, elements: !443)
!443 = !{!444, !448}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !8, line: 1, baseType: !445, size: 64, align: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !30, line: 1, size: 64, align: 8, elements: !446)
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !30, line: 1, baseType: !158, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !8, line: 1, baseType: !166, size: 32, align: 32, offset: 64)
!449 = !DILocalVariable(name: "$this21", arg: 1, scope: !53, file: !30, line: 1, type: !441)
!450 = !DILocation(line: 1, column: 1, scope: !53)
!451 = !DILocalVariable(name: "$ret1", scope: !53, file: !30, line: 1, type: !56)
!452 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !30, line: 1, type: !453, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!453 = !DISubroutineType(types: !454)
!454 = !{!16, !441, !441, !455}
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !30, line: 1, size: 128, align: 8, elements: !456)
!456 = !{!447, !457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !30, line: 1, baseType: !158, size: 64, align: 64, offset: 64)
!458 = !DILocalVariable(name: "$this22", arg: 1, scope: !452, file: !30, line: 1, type: !441)
!459 = !DILocation(line: 1, column: 1, scope: !452)
!460 = !DILocalVariable(name: "$p23", arg: 2, scope: !452, file: !30, line: 1, type: !455)
!461 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !30, line: 1, type: !462, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!462 = !DISubroutineType(types: !463)
!463 = !{!16, !441, !441, !56}
!464 = !DILocalVariable(name: "$this24", arg: 1, scope: !461, file: !30, line: 1, type: !441)
!465 = !DILocation(line: 1, column: 1, scope: !461)
!466 = !DILocalVariable(name: "$p25", arg: 2, scope: !461, file: !30, line: 1, type: !56)
!467 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !30, line: 1, type: !468, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!468 = !DISubroutineType(types: !469)
!469 = !{!89, !441, !441}
!470 = !DILocalVariable(name: "$this26", arg: 1, scope: !467, file: !30, line: 1, type: !441)
!471 = !DILocation(line: 1, column: 1, scope: !467)
!472 = !DILocalVariable(name: "$ret2", scope: !467, file: !30, line: 1, type: !89)
!473 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !36, line: 1, type: !87, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!474 = !DILocalVariable(name: "key1", arg: 1, scope: !473, file: !36, line: 1, type: !15)
!475 = !DILocation(line: 1, column: 1, scope: !473)
!476 = !DILocalVariable(name: "key2", arg: 2, scope: !473, file: !36, line: 1, type: !15)
!477 = !DILocalVariable(name: "$ret3", scope: !473, file: !36, line: 1, type: !89)
!478 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !36, line: 1, type: !87, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!479 = !DILocalVariable(name: "key1", arg: 1, scope: !478, file: !36, line: 1, type: !15)
!480 = !DILocation(line: 1, column: 1, scope: !478)
!481 = !DILocalVariable(name: "key2", arg: 2, scope: !478, file: !36, line: 1, type: !15)
!482 = !DILocalVariable(name: "$ret4", scope: !478, file: !36, line: 1, type: !89)
!483 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !36, line: 1, type: !87, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!484 = !DILocalVariable(name: "key1", arg: 1, scope: !483, file: !36, line: 1, type: !15)
!485 = !DILocation(line: 1, column: 1, scope: !483)
!486 = !DILocalVariable(name: "key2", arg: 2, scope: !483, file: !36, line: 1, type: !15)
!487 = !DILocalVariable(name: "$ret5", scope: !483, file: !36, line: 1, type: !89)
!488 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !87, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!489 = !DILocalVariable(name: "key1", arg: 1, scope: !488, file: !36, line: 1, type: !15)
!490 = !DILocation(line: 1, column: 1, scope: !488)
!491 = !DILocalVariable(name: "key2", arg: 2, scope: !488, file: !36, line: 1, type: !15)
!492 = !DILocalVariable(name: "$ret6", scope: !488, file: !36, line: 1, type: !89)
!493 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !87, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!494 = !DILocalVariable(name: "key1", arg: 1, scope: !493, file: !36, line: 1, type: !15)
!495 = !DILocation(line: 1, column: 1, scope: !493)
!496 = !DILocalVariable(name: "key2", arg: 2, scope: !493, file: !36, line: 1, type: !15)
