; ModuleID = 'utbotgo/package/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./struct.go", directory: "/workspace")
!5 = !{!6, !19, !21, !23, !25, !27, !29}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !8, size: 128, align: 8, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, align: 8, elements: !17)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "void")
!17 = !{!18}
!18 = !DISubrange(count: 1, lowerBound: 0)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "main..types", linkageName: "main..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!31 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !32, line: 1, type: !33, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !35)
!32 = !DIFile(filename: "struct.go", directory: ".")
!33 = !DISubroutineType(types: !34)
!34 = !{!16}
!35 = !{}
!36 = !DILocation(line: 1, column: 1, scope: !37)
!37 = !DILexicalBlockFile(scope: !31, file: !38, discriminator: 0)
!38 = !DIFile(filename: "<built-in>", directory: "")
!39 = distinct !DISubprogram(name: "main.getSign", scope: null, file: !32, line: 7, type: !40, scopeLine: 7, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !35)
!40 = !DISubroutineType(types: !41)
!41 = !{!12, !42}
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "Input", file: !32, line: 3, size: 64, align: 8, elements: !43)
!43 = !{!44}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "A", file: !32, line: 4, baseType: !12, size: 64, align: 64)
!45 = !DILocalVariable(name: "i", arg: 1, scope: !39, file: !32, line: 7, type: !42)
!46 = !DILocation(line: 7, column: 14, scope: !39)
!47 = !DILocalVariable(name: "$ret0", scope: !39, file: !32, line: 7, type: !12)
!48 = !DILocation(line: 7, column: 23, scope: !39)
!49 = !DILocation(line: 8, column: 6, scope: !39)
!50 = !DILocation(line: 8, column: 9, scope: !39)
!51 = !DILocation(line: 8, column: 2, scope: !39)
!52 = !DILocation(line: 9, column: 3, scope: !39)
!53 = !DILocation(line: 11, column: 6, scope: !39)
!54 = !DILocation(line: 11, column: 9, scope: !39)
!55 = !DILocation(line: 11, column: 2, scope: !39)
!56 = !DILocation(line: 12, column: 3, scope: !39)
!57 = !DILocation(line: 14, column: 2, scope: !39)
!58 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !32, line: 1, type: !59, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !35)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !446, !446}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !32, line: 1, size: 19456, align: 8, elements: !63)
!63 = !{!64, !127, !140, !266, !267, !268, !269, !270, !271, !272, !273, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !300, !301, !302, !303, !304, !319, !320, !388, !389, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !423, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !32, line: 1, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !32, line: 1, size: 256, align: 8, elements: !67)
!67 = !{!68, !69, !123, !124, !125, !126}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !32, line: 1, baseType: !15, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !32, line: 1, baseType: !70, size: 128, align: 64, offset: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !8, size: 128, align: 8, elements: !71)
!71 = !{!72, !122}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !38, line: 1, size: 512, align: 8, elements: !75)
!75 = !{!76, !78, !79, !81, !83, !84, !85, !86, !95, !97, !103, !121}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !38, line: 1, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !38, line: 1, baseType: !77, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !38, line: 1, baseType: !80, size: 32, align: 32, offset: 128)
!80 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !38, line: 1, baseType: !82, size: 8, align: 8, offset: 160)
!82 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !38, line: 1, baseType: !82, size: 8, align: 8, offset: 168)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !38, line: 1, baseType: !82, size: 8, align: 8, offset: 176)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !38, line: 1, baseType: !82, size: 8, align: 8, offset: 184)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !38, line: 1, baseType: !87, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !15, !15}
!94 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !38, line: 1, baseType: !96, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !38, line: 1, baseType: !98, size: 64, align: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !38, line: 1, size: 128, align: 8, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !38, line: 1, baseType: !96, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !38, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !38, line: 1, baseType: !104, size: 64, align: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !38, line: 1, size: 320, align: 8, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !38, line: 1, baseType: !98, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !38, line: 1, baseType: !98, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !38, line: 1, baseType: !110, size: 192, align: 64, offset: 128)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !8, size: 192, align: 8, elements: !111)
!111 = !{!112, !119, !120}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !38, line: 1, size: 320, align: 8, elements: !115)
!115 = !{!107, !108, !116, !117, !118}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 200)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 208)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 216)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !32, line: 1, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !32, line: 1, size: 512, align: 8, elements: !130)
!130 = !{!68, !131, !133, !134, !135, !136, !137, !138, !139}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !32, line: 1, baseType: !132, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !32, line: 1, baseType: !65, size: 64, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !32, line: 1, baseType: !65, size: 64, align: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 456)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !32, line: 1, baseType: !141, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !32, line: 1, size: 17280, align: 8, elements: !143)
!143 = !{!144, !145, !147, !148, !155, !161, !162, !164, !166, !167, !168, !170, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !183, !184, !185, !189, !190, !191, !192, !193, !194, !198, !199, !201, !202, !212, !213, !214, !215, !220, !221, !222, !223, !224, !225, !226, !243, !244, !245, !247, !251, !252, !261, !262, !263, !264, !265}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !32, line: 1, baseType: !15, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !32, line: 1, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !32, line: 1, baseType: !149, size: 1024, align: 64, offset: 192)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !32, line: 1, size: 1024, align: 8, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !32, line: 1, baseType: !152, size: 1024, align: 64)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 1024, align: 8, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 16, lowerBound: 0)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !32, line: 1, baseType: !156, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !32, line: 1, size: 64, align: 8, elements: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !32, line: 1, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 1280)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !32, line: 1, baseType: !163, size: 64, align: 64, offset: 1344)
!163 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !32, line: 1, baseType: !165, size: 64, align: 64, offset: 1408)
!165 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !32, line: 1, baseType: !165, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !32, line: 1, baseType: !165, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 1600)
!169 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !32, line: 1, baseType: !171, size: 32, align: 32, offset: 1664)
!171 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !32, line: 1, baseType: !171, size: 32, align: 32, offset: 1696)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !32, line: 1, baseType: !99, size: 128, align: 64, offset: 1728)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !32, line: 1, baseType: !171, size: 32, align: 32, offset: 1856)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !32, line: 1, baseType: !171, size: 32, align: 32, offset: 1888)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !32, line: 1, baseType: !171, size: 32, align: 32, offset: 1920)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !32, line: 1, baseType: !171, size: 32, align: 32, offset: 1952)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 1984)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 1992)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 2000)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !32, line: 1, baseType: !182, size: 8, align: 8, offset: 2008)
!182 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 2016)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 2048)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !32, line: 1, baseType: !186, size: 64, align: 32, offset: 2080)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 64, align: 4, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 2, lowerBound: 0)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 2144)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !32, line: 1, baseType: !82, size: 8, align: 8, offset: 2152)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !32, line: 1, baseType: !146, size: 64, align: 64, offset: 2176)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !32, line: 1, baseType: !171, size: 32, align: 32, offset: 2240)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 2272)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !32, line: 1, baseType: !195, size: 64, align: 64, offset: 2304)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !32, line: 1, size: 64, align: 8, elements: !196)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !32, line: 1, baseType: !77, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 2368)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !32, line: 1, baseType: !200, size: 64, align: 64, offset: 2432)
!200 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !32, line: 1, baseType: !163, size: 64, align: 64, offset: 2496)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !32, line: 1, baseType: !203, size: 12288, align: 64, offset: 2560)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 12288, align: 8, elements: !210)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !32, line: 1, size: 384, align: 8, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !32, line: 1, baseType: !77, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !32, line: 1, baseType: !99, size: 128, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !32, line: 1, baseType: !99, size: 128, align: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !32, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!210 = !{!211}
!211 = !DISubrange(count: 32, lowerBound: 0)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 14848)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 14880)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !32, line: 1, baseType: !200, size: 64, align: 64, offset: 14912)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !32, line: 1, baseType: !216, size: 64, align: 64, offset: 14976)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !32, line: 1, size: 64, align: 8, elements: !218)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !32, line: 1, baseType: !91, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 15040)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !32, line: 1, baseType: !82, size: 8, align: 8, offset: 15104)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !32, line: 1, baseType: !12, size: 64, align: 64, offset: 15168)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 15232)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 15264)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 15296)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !32, line: 1, baseType: !227, size: 192, align: 64, offset: 15360)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !8, size: 192, align: 8, elements: !228)
!228 = !{!229, !234, !235}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !8, line: 1, baseType: !230, size: 64, align: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !32, line: 1, size: 64, align: 8, elements: !231)
!231 = !{!232, !197}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !32, line: 1, baseType: !233, align: 8)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !32, line: 1, align: 1, elements: !35)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !8, line: 1, baseType: !80, size: 32, align: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !8, line: 1, baseType: !236, size: 64, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !32, line: 1, size: 64, align: 8, elements: !238)
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !32, line: 1, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!94, !94}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 15552)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 15584)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !32, line: 1, baseType: !246, align: 8, offset: 15616)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !32, line: 1, align: 1, elements: !35)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !32, line: 1, baseType: !248, size: 8, align: 8, offset: 15616)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !32, line: 1, size: 8, align: 1, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !32, line: 1, baseType: !82, size: 8, align: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !32, line: 1, baseType: !12, size: 64, align: 64, offset: 15680)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !32, line: 1, baseType: !253, size: 1280, align: 64, offset: 15744)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 1280, align: 8, elements: !259)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !32, line: 1, size: 128, align: 8, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !32, line: 1, baseType: !77, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !32, line: 1, baseType: !258, size: 64, align: 64, offset: 64)
!258 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!259 = !{!260}
!260 = !DISubrange(count: 10, lowerBound: 0)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 17024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 17088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 17152)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 17160)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !32, line: 1, baseType: !195, size: 64, align: 64, offset: 17216)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !32, line: 1, baseType: !163, size: 64, align: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !32, line: 1, baseType: !274, size: 8, align: 8, offset: 640)
!274 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 648)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 656)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 664)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 672)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 680)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 688)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 696)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 712)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !32, line: 1, baseType: !82, size: 8, align: 8, offset: 720)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !32, line: 1, baseType: !182, size: 8, align: 8, offset: 728)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 736)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 744)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !32, line: 1, baseType: !82, size: 8, align: 8, offset: 752)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 768)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 896)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !32, line: 1, baseType: !146, size: 64, align: 64, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !32, line: 1, baseType: !165, size: 64, align: 64, offset: 1024)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !32, line: 1, baseType: !200, size: 64, align: 64, offset: 1088)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 1152)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !32, line: 1, baseType: !297, size: 192, align: 64, offset: 1216)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !8, size: 192, align: 8, elements: !298)
!298 = !{!299, !119, !120}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !96, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 1408)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 1472)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 1536)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 1600)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !32, line: 1, baseType: !305, size: 64, align: 64, offset: 1664)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !8, size: 192, align: 8, elements: !307)
!307 = !{!308, !119, !120}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !32, line: 1, size: 320, align: 8, elements: !311)
!311 = !{!312, !317, !318}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !32, line: 1, baseType: !313, size: 192, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !8, size: 192, align: 8, elements: !314)
!314 = !{!315, !119, !120}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 1728)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !32, line: 1, baseType: !321, size: 64, align: 64, offset: 1792)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !32, line: 1, size: 704, align: 8, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !32, line: 1, baseType: !15, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 416)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 424)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 576)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !32, line: 1, baseType: !337, size: 64, align: 64, offset: 640)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !32, line: 1, size: 768, align: 8, elements: !339)
!339 = !{!340, !342, !343, !344, !346, !347, !379, !380, !381, !386, !387}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !32, line: 1, baseType: !341, size: 64, align: 64)
!341 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !32, line: 1, baseType: !341, size: 64, align: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !32, line: 1, baseType: !345, size: 16, align: 16, offset: 192)
!345 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 224)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !32, line: 1, baseType: !348, size: 64, align: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !32, line: 1, size: 512, align: 8, elements: !350)
!350 = !{!351, !352, !353, !354, !356, !357, !358, !359, !360, !361, !362, !378}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !32, line: 1, baseType: !77, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !32, line: 1, baseType: !355, size: 8, align: 8, offset: 160)
!355 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !32, line: 1, baseType: !82, size: 8, align: 8, offset: 168)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !32, line: 1, baseType: !82, size: 8, align: 8, offset: 176)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !32, line: 1, baseType: !82, size: 8, align: 8, offset: 184)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !32, line: 1, baseType: !216, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !32, line: 1, baseType: !96, size: 64, align: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !32, line: 1, baseType: !98, size: 64, align: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !32, line: 1, baseType: !363, size: 64, align: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !32, line: 1, size: 320, align: 8, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !32, line: 1, baseType: !98, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !32, line: 1, baseType: !98, size: 64, align: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !32, line: 1, baseType: !369, size: 192, align: 64, offset: 128)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !8, size: 192, align: 8, elements: !370)
!370 = !{!371, !119, !120}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !32, line: 1, size: 320, align: 8, elements: !374)
!374 = !{!366, !367, !375, !376, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !32, line: 1, baseType: !341, size: 64, align: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !32, line: 1, baseType: !341, size: 64, align: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !32, line: 1, baseType: !382, size: 128, align: 64, offset: 448)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !32, line: 1, size: 128, align: 8, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !32, line: 1, baseType: !15, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !32, line: 1, baseType: !382, size: 128, align: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !32, line: 1, baseType: !230, size: 64, align: 64, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 1856)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !32, line: 1, baseType: !390, size: 64, align: 64, offset: 1920)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !32, line: 1, size: 576, align: 8, elements: !392)
!392 = !{!393, !394, !395, !396, !404, !405, !406, !407}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !32, line: 1, baseType: !165, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !32, line: 1, baseType: !397, size: 64, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !32, line: 1, size: 64, align: 8, elements: !399)
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !32, line: 1, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!16, !70, !77}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !32, line: 1, baseType: !70, size: 128, align: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !32, line: 1, baseType: !80, size: 32, align: 32, offset: 1984)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !32, line: 1, baseType: !169, size: 64, align: 64, offset: 2048)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 2112)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 2176)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 2240)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 2304)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 2368)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 2432)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 2496)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 2560)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !32, line: 1, baseType: !15, size: 64, align: 64, offset: 2624)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !32, line: 1, baseType: !420, size: 7808, align: 64, offset: 2688)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 7808, align: 8, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 122, lowerBound: 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !32, line: 1, baseType: !424, size: 64, align: 64, offset: 10496)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !32, line: 1, size: 64, align: 8, elements: !426)
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !32, line: 1, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!16, !15}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 10560)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 10624)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 10688)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 10696)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 10752)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 10816)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 10880)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 10888)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 10896)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 10904)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !32, line: 1, baseType: !94, size: 8, align: 8, offset: 10912)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !32, line: 1, baseType: !77, size: 64, align: 64, offset: 10944)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !32, line: 1, baseType: !420, size: 7808, align: 64, offset: 11008)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !32, line: 1, baseType: !445, size: 640, align: 64, offset: 18816)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 640, align: 8, elements: !259)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !8, size: 128, align: 8, elements: !448)
!448 = !{!449, !453}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !8, line: 1, baseType: !450, size: 64, align: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !32, line: 1, size: 64, align: 8, elements: !451)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !32, line: 1, baseType: !163, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !8, line: 1, baseType: !171, size: 32, align: 32, offset: 64)
!454 = !DILocalVariable(name: "$this21", arg: 1, scope: !58, file: !32, line: 1, type: !446)
!455 = !DILocation(line: 1, column: 1, scope: !58)
!456 = !DILocalVariable(name: "$ret1", scope: !58, file: !32, line: 1, type: !61)
!457 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !32, line: 1, type: !458, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !35)
!458 = !DISubroutineType(types: !459)
!459 = !{!16, !446, !446, !460}
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !32, line: 1, size: 128, align: 8, elements: !461)
!461 = !{!452, !462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !32, line: 1, baseType: !163, size: 64, align: 64, offset: 64)
!463 = !DILocalVariable(name: "$this22", arg: 1, scope: !457, file: !32, line: 1, type: !446)
!464 = !DILocation(line: 1, column: 1, scope: !457)
!465 = !DILocalVariable(name: "$p23", arg: 2, scope: !457, file: !32, line: 1, type: !460)
!466 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !32, line: 1, type: !467, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !35)
!467 = !DISubroutineType(types: !468)
!468 = !{!16, !446, !446, !61}
!469 = !DILocalVariable(name: "$this24", arg: 1, scope: !466, file: !32, line: 1, type: !446)
!470 = !DILocation(line: 1, column: 1, scope: !466)
!471 = !DILocalVariable(name: "$p25", arg: 2, scope: !466, file: !32, line: 1, type: !61)
!472 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !32, line: 1, type: !473, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !35)
!473 = !DISubroutineType(types: !474)
!474 = !{!94, !446, !446}
!475 = !DILocalVariable(name: "$this26", arg: 1, scope: !472, file: !32, line: 1, type: !446)
!476 = !DILocation(line: 1, column: 1, scope: !472)
!477 = !DILocalVariable(name: "$ret2", scope: !472, file: !32, line: 1, type: !94)
!478 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !38, line: 1, type: !92, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !35)
!479 = !DILocalVariable(name: "key1", arg: 1, scope: !478, file: !38, line: 1, type: !15)
!480 = !DILocation(line: 1, column: 1, scope: !478)
!481 = !DILocalVariable(name: "key2", arg: 2, scope: !478, file: !38, line: 1, type: !15)
!482 = !DILocalVariable(name: "$ret3", scope: !478, file: !38, line: 1, type: !94)
!483 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !38, line: 1, type: !92, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !35)
!484 = !DILocalVariable(name: "key1", arg: 1, scope: !483, file: !38, line: 1, type: !15)
!485 = !DILocation(line: 1, column: 1, scope: !483)
!486 = !DILocalVariable(name: "key2", arg: 2, scope: !483, file: !38, line: 1, type: !15)
!487 = !DILocalVariable(name: "$ret4", scope: !483, file: !38, line: 1, type: !94)
!488 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !38, line: 1, type: !92, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !35)
!489 = !DILocalVariable(name: "key1", arg: 1, scope: !488, file: !38, line: 1, type: !15)
!490 = !DILocation(line: 1, column: 1, scope: !488)
!491 = !DILocalVariable(name: "key2", arg: 2, scope: !488, file: !38, line: 1, type: !15)
!492 = !DILocalVariable(name: "$ret5", scope: !488, file: !38, line: 1, type: !94)
!493 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !38, line: 1, type: !92, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !35)
!494 = !DILocalVariable(name: "key1", arg: 1, scope: !493, file: !38, line: 1, type: !15)
!495 = !DILocation(line: 1, column: 1, scope: !493)
!496 = !DILocalVariable(name: "key2", arg: 2, scope: !493, file: !38, line: 1, type: !15)
!497 = !DILocalVariable(name: "$ret6", scope: !493, file: !38, line: 1, type: !94)
!498 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !38, line: 1, type: !92, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !35)
!499 = !DILocalVariable(name: "key1", arg: 1, scope: !498, file: !38, line: 1, type: !15)
!500 = !DILocation(line: 1, column: 1, scope: !498)
!501 = !DILocalVariable(name: "key2", arg: 2, scope: !498, file: !38, line: 1, type: !15)
