; ModuleID = 'utbotgo/package/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./has_negative.go", directory: "/workspace")
!5 = !{!6, !19, !21, !23, !25, !27}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !8, size: 128, align: 8, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, align: 8, elements: !17)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "void")
!17 = !{!18}
!18 = !DISubrange(count: 1, lowerBound: 0)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!29 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !30, line: 1, type: !31, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!30 = !DIFile(filename: "has_negative.go", directory: ".")
!31 = !DISubroutineType(types: !32)
!32 = !{!16}
!33 = !{}
!34 = !DILocation(line: 1, column: 1, scope: !35)
!35 = !DILexicalBlockFile(scope: !29, file: !36, discriminator: 0)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = distinct !DISubprogram(name: "main.hasNegativeSlice", scope: null, file: !30, line: 3, type: !38, scopeLine: 3, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !8, size: 192, align: 8, elements: !42)
!42 = !{!43, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 128)
!47 = !DILocalVariable(name: "a", arg: 1, scope: !37, file: !30, line: 3, type: !41)
!48 = !DILocation(line: 3, column: 23, scope: !37)
!49 = !DILocalVariable(name: "$ret0", scope: !37, file: !30, line: 3, type: !40)
!50 = !DILocation(line: 3, column: 32, scope: !37)
!51 = !DILocalVariable(name: "i", scope: !52, file: !30, line: 4, type: !12)
!52 = distinct !DILexicalBlock(scope: !37, file: !30, line: 4, column: 2)
!53 = !DILocation(line: 4, column: 6, scope: !37)
!54 = !DILocation(line: 4, column: 2, scope: !52)
!55 = !DILocation(line: 5, column: 6, scope: !52)
!56 = !DILocation(line: 5, column: 8, scope: !52)
!57 = !DILocation(line: 5, column: 7, scope: !52)
!58 = !DILocation(line: 5, column: 11, scope: !52)
!59 = !DILocation(line: 5, column: 3, scope: !52)
!60 = !DILocation(line: 6, column: 4, scope: !52)
!61 = !DILocation(line: 9, column: 2, scope: !37)
!62 = distinct !DISubprogram(name: "main.hasNegativeArr", scope: null, file: !30, line: 12, type: !63, scopeLine: 12, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!63 = !DISubroutineType(types: !64)
!64 = !{!40, !65}
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, align: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3, lowerBound: 0)
!68 = !DILocalVariable(name: "a", arg: 1, scope: !62, file: !30, line: 12, type: !65)
!69 = !DILocation(line: 12, column: 21, scope: !62)
!70 = !DILocalVariable(name: "$ret1", scope: !62, file: !30, line: 12, type: !40)
!71 = !DILocation(line: 12, column: 31, scope: !62)
!72 = !DILocalVariable(name: "i", scope: !73, file: !30, line: 13, type: !12)
!73 = distinct !DILexicalBlock(scope: !62, file: !30, line: 13, column: 2)
!74 = !DILocation(line: 13, column: 6, scope: !62)
!75 = !DILocation(line: 13, column: 2, scope: !73)
!76 = !DILocation(line: 14, column: 8, scope: !73)
!77 = !DILocation(line: 14, column: 7, scope: !73)
!78 = !DILocation(line: 14, column: 11, scope: !73)
!79 = !DILocation(line: 14, column: 3, scope: !73)
!80 = !DILocation(line: 15, column: 4, scope: !73)
!81 = !DILocation(line: 18, column: 2, scope: !62)
!82 = distinct !DISubprogram(name: "main.hasNegativeVarargs", scope: null, file: !30, line: 21, type: !38, scopeLine: 21, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!83 = !DILocalVariable(name: "a", arg: 1, scope: !82, file: !30, line: 21, type: !41)
!84 = !DILocation(line: 21, column: 25, scope: !82)
!85 = !DILocalVariable(name: "$ret2", scope: !82, file: !30, line: 21, type: !40)
!86 = !DILocation(line: 21, column: 35, scope: !82)
!87 = !DILocalVariable(name: "i", scope: !88, file: !30, line: 22, type: !12)
!88 = distinct !DILexicalBlock(scope: !82, file: !30, line: 22, column: 2)
!89 = !DILocation(line: 22, column: 6, scope: !82)
!90 = !DILocation(line: 22, column: 2, scope: !88)
!91 = !DILocation(line: 23, column: 6, scope: !88)
!92 = !DILocation(line: 23, column: 8, scope: !88)
!93 = !DILocation(line: 23, column: 7, scope: !88)
!94 = !DILocation(line: 23, column: 11, scope: !88)
!95 = !DILocation(line: 23, column: 3, scope: !88)
!96 = !DILocation(line: 24, column: 4, scope: !88)
!97 = !DILocation(line: 27, column: 2, scope: !82)
!98 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !30, line: 1, type: !99, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !483, !483}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !30, line: 1, size: 19456, align: 8, elements: !103)
!103 = !{!104, !164, !177, !303, !304, !305, !306, !307, !308, !309, !310, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !337, !338, !339, !340, !341, !356, !357, !425, !426, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !460, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !30, line: 1, size: 256, align: 8, elements: !107)
!107 = !{!108, !109, !160, !161, !162, !163}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !110, size: 128, align: 64, offset: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !8, size: 128, align: 8, elements: !111)
!111 = !{!112, !159}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 512, align: 8, elements: !115)
!115 = !{!116, !118, !119, !121, !123, !124, !125, !126, !134, !136, !142, !158}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !117, size: 64, align: 64)
!117 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !117, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !120, size: 32, align: 32, offset: 128)
!120 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !36, line: 1, baseType: !122, size: 8, align: 8, offset: 160)
!122 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !122, size: 8, align: 8, offset: 168)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !122, size: 8, align: 8, offset: 176)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !122, size: 8, align: 8, offset: 184)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !36, line: 1, baseType: !127, size: 64, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!40, !15, !15}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !135, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !137, size: 64, align: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !135, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !143, size: 64, align: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !145)
!145 = !{!146, !147, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !137, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !137, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !149, size: 192, align: 64, offset: 128)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !8, size: 192, align: 8, elements: !150)
!150 = !{!151, !45, !46}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !154)
!154 = !{!146, !147, !155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 200)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 208)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !30, line: 1, baseType: !165, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !30, line: 1, size: 512, align: 8, elements: !167)
!167 = !{!108, !168, !170, !171, !172, !173, !174, !175, !176}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !30, line: 1, baseType: !169, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !30, line: 1, baseType: !105, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !105, size: 64, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 456)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !30, line: 1, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !30, line: 1, size: 17280, align: 8, elements: !180)
!180 = !{!181, !182, !184, !185, !192, !198, !199, !201, !203, !204, !205, !207, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !220, !221, !222, !226, !227, !228, !229, !230, !231, !235, !236, !238, !239, !249, !250, !251, !252, !257, !258, !259, !260, !261, !262, !263, !280, !281, !282, !284, !288, !289, !298, !299, !300, !301, !302}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !30, line: 1, baseType: !183, size: 64, align: 64, offset: 64)
!183 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !30, line: 1, baseType: !186, size: 1024, align: 64, offset: 192)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !30, line: 1, size: 1024, align: 8, elements: !187)
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !30, line: 1, baseType: !189, size: 1024, align: 64)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 1024, align: 8, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 16, lowerBound: 0)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !30, line: 1, baseType: !193, size: 64, align: 64, offset: 1216)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1280)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !30, line: 1, baseType: !200, size: 64, align: 64, offset: 1344)
!200 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !30, line: 1, baseType: !202, size: 64, align: 64, offset: 1408)
!202 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !30, line: 1, baseType: !202, size: 64, align: 64, offset: 1472)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !30, line: 1, baseType: !202, size: 64, align: 64, offset: 1536)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 1600)
!206 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !30, line: 1, baseType: !208, size: 32, align: 32, offset: 1664)
!208 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !30, line: 1, baseType: !208, size: 32, align: 32, offset: 1696)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !30, line: 1, baseType: !138, size: 128, align: 64, offset: 1728)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !30, line: 1, baseType: !208, size: 32, align: 32, offset: 1856)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !30, line: 1, baseType: !208, size: 32, align: 32, offset: 1888)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !30, line: 1, baseType: !208, size: 32, align: 32, offset: 1920)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !30, line: 1, baseType: !208, size: 32, align: 32, offset: 1952)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 1984)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 1992)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 2000)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !30, line: 1, baseType: !219, size: 8, align: 8, offset: 2008)
!219 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 2016)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 2048)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !30, line: 1, baseType: !223, size: 64, align: 32, offset: 2080)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, align: 4, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 2, lowerBound: 0)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 2144)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 2152)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !30, line: 1, baseType: !183, size: 64, align: 64, offset: 2176)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !30, line: 1, baseType: !208, size: 32, align: 32, offset: 2240)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 2272)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !30, line: 1, baseType: !232, size: 64, align: 64, offset: 2304)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !30, line: 1, size: 64, align: 8, elements: !233)
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !30, line: 1, baseType: !117, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2368)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !237, size: 64, align: 64, offset: 2432)
!237 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !30, line: 1, baseType: !200, size: 64, align: 64, offset: 2496)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !30, line: 1, baseType: !240, size: 12288, align: 64, offset: 2560)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 12288, align: 8, elements: !247)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !30, line: 1, size: 384, align: 8, elements: !242)
!242 = !{!243, !244, !245, !246}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !30, line: 1, baseType: !117, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !30, line: 1, baseType: !138, size: 128, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !30, line: 1, baseType: !138, size: 128, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!247 = !{!248}
!248 = !DISubrange(count: 32, lowerBound: 0)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 14848)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 14880)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !30, line: 1, baseType: !237, size: 64, align: 64, offset: 14912)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !30, line: 1, baseType: !253, size: 64, align: 64, offset: 14976)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !255)
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !131, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15040)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 15104)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15168)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 15232)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 15264)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15296)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !30, line: 1, baseType: !264, size: 192, align: 64, offset: 15360)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !8, size: 192, align: 8, elements: !265)
!265 = !{!266, !271, !272}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !8, line: 1, baseType: !267, size: 64, align: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !30, line: 1, size: 64, align: 8, elements: !268)
!268 = !{!269, !234}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !30, line: 1, baseType: !270, align: 8)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !30, line: 1, align: 1, elements: !33)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !8, line: 1, baseType: !120, size: 32, align: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !8, line: 1, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !275)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!40, !40}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 15552)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 15584)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !30, line: 1, baseType: !283, align: 8, offset: 15616)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !30, line: 1, align: 1, elements: !33)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !30, line: 1, baseType: !285, size: 8, align: 8, offset: 15616)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !30, line: 1, size: 8, align: 1, elements: !286)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !30, line: 1, baseType: !122, size: 8, align: 8)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15680)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !30, line: 1, baseType: !290, size: 1280, align: 64, offset: 15744)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 1280, align: 8, elements: !296)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !30, line: 1, size: 128, align: 8, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !30, line: 1, baseType: !117, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !30, line: 1, baseType: !295, size: 64, align: 64, offset: 64)
!295 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!296 = !{!297}
!297 = !DISubrange(count: 10, lowerBound: 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 17024)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 17088)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 17152)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 17160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !30, line: 1, baseType: !232, size: 64, align: 64, offset: 17216)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !200, size: 64, align: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !30, line: 1, baseType: !311, size: 8, align: 8, offset: 640)
!311 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 648)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 656)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 664)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 672)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 680)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 688)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 696)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 704)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 712)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 720)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !30, line: 1, baseType: !219, size: 8, align: 8, offset: 728)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 736)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 744)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 752)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 832)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !30, line: 1, baseType: !183, size: 64, align: 64, offset: 960)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !30, line: 1, baseType: !202, size: 64, align: 64, offset: 1024)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !30, line: 1, baseType: !237, size: 64, align: 64, offset: 1088)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 1152)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !30, line: 1, baseType: !334, size: 192, align: 64, offset: 1216)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !8, size: 192, align: 8, elements: !335)
!335 = !{!336, !45, !46}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !135, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 1408)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 1472)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 1536)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 1600)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !30, line: 1, baseType: !342, size: 64, align: 64, offset: 1664)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !8, size: 192, align: 8, elements: !344)
!344 = !{!345, !45, !46}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !30, line: 1, size: 320, align: 8, elements: !348)
!348 = !{!349, !354, !355}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !30, line: 1, baseType: !350, size: 192, align: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !8, size: 192, align: 8, elements: !351)
!351 = !{!352, !45, !46}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 1728)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !30, line: 1, baseType: !358, size: 64, align: 64, offset: 1792)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !30, line: 1, size: 704, align: 8, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 416)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 424)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !30, line: 1, baseType: !374, size: 64, align: 64, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !30, line: 1, size: 768, align: 8, elements: !376)
!376 = !{!377, !379, !380, !381, !383, !384, !416, !417, !418, !423, !424}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !30, line: 1, baseType: !378, size: 64, align: 64)
!378 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !30, line: 1, baseType: !378, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !30, line: 1, baseType: !382, size: 16, align: 16, offset: 192)
!382 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !30, line: 1, baseType: !385, size: 64, align: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !30, line: 1, size: 512, align: 8, elements: !387)
!387 = !{!388, !389, !390, !391, !393, !394, !395, !396, !397, !398, !399, !415}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !30, line: 1, baseType: !117, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !30, line: 1, baseType: !392, size: 8, align: 8, offset: 160)
!392 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 168)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 176)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 184)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !30, line: 1, baseType: !253, size: 64, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !30, line: 1, baseType: !135, size: 64, align: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !30, line: 1, baseType: !137, size: 64, align: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !30, line: 1, baseType: !400, size: 64, align: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !30, line: 1, size: 320, align: 8, elements: !402)
!402 = !{!403, !404, !405}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !30, line: 1, baseType: !137, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !30, line: 1, baseType: !137, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !30, line: 1, baseType: !406, size: 192, align: 64, offset: 128)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !8, size: 192, align: 8, elements: !407)
!407 = !{!408, !45, !46}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !30, line: 1, size: 320, align: 8, elements: !411)
!411 = !{!403, !404, !412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !30, line: 1, baseType: !378, size: 64, align: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !30, line: 1, baseType: !378, size: 64, align: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !30, line: 1, baseType: !419, size: 128, align: 64, offset: 448)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !30, line: 1, size: 128, align: 8, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !30, line: 1, baseType: !419, size: 128, align: 64, offset: 576)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !30, line: 1, baseType: !267, size: 64, align: 64, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1856)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !30, line: 1, baseType: !427, size: 64, align: 64, offset: 1920)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !30, line: 1, size: 576, align: 8, elements: !429)
!429 = !{!430, !431, !432, !433, !441, !442, !443, !444}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !30, line: 1, baseType: !202, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !30, line: 1, baseType: !434, size: 64, align: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!16, !110, !117}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !110, size: 128, align: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 1984)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !30, line: 1, baseType: !206, size: 64, align: 64, offset: 2048)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2112)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 2176)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 2240)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 2304)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 2368)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 2432)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2496)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 2560)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2624)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !30, line: 1, baseType: !457, size: 7808, align: 64, offset: 2688)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 7808, align: 8, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 122, lowerBound: 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !30, line: 1, baseType: !461, size: 64, align: 64, offset: 10496)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !463)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!16, !15}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 10560)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 10624)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10688)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10696)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 10752)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 10816)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10880)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10888)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10896)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10904)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !30, line: 1, baseType: !40, size: 8, align: 8, offset: 10912)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 10944)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !30, line: 1, baseType: !457, size: 7808, align: 64, offset: 11008)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !30, line: 1, baseType: !482, size: 640, align: 64, offset: 18816)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 640, align: 8, elements: !296)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !8, size: 128, align: 8, elements: !485)
!485 = !{!486, !490}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !8, line: 1, baseType: !487, size: 64, align: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !30, line: 1, size: 64, align: 8, elements: !488)
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !30, line: 1, baseType: !200, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !8, line: 1, baseType: !208, size: 32, align: 32, offset: 64)
!491 = !DILocalVariable(name: "$this21", arg: 1, scope: !98, file: !30, line: 1, type: !483)
!492 = !DILocation(line: 1, column: 1, scope: !98)
!493 = !DILocalVariable(name: "$ret3", scope: !98, file: !30, line: 1, type: !101)
!494 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !30, line: 1, type: !495, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!495 = !DISubroutineType(types: !496)
!496 = !{!16, !483, !483, !497}
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !30, line: 1, size: 128, align: 8, elements: !498)
!498 = !{!489, !499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !30, line: 1, baseType: !200, size: 64, align: 64, offset: 64)
!500 = !DILocalVariable(name: "$this22", arg: 1, scope: !494, file: !30, line: 1, type: !483)
!501 = !DILocation(line: 1, column: 1, scope: !494)
!502 = !DILocalVariable(name: "$p23", arg: 2, scope: !494, file: !30, line: 1, type: !497)
!503 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !30, line: 1, type: !504, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!504 = !DISubroutineType(types: !505)
!505 = !{!16, !483, !483, !101}
!506 = !DILocalVariable(name: "$this24", arg: 1, scope: !503, file: !30, line: 1, type: !483)
!507 = !DILocation(line: 1, column: 1, scope: !503)
!508 = !DILocalVariable(name: "$p25", arg: 2, scope: !503, file: !30, line: 1, type: !101)
!509 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !30, line: 1, type: !510, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!510 = !DISubroutineType(types: !511)
!511 = !{!40, !483, !483}
!512 = !DILocalVariable(name: "$this26", arg: 1, scope: !509, file: !30, line: 1, type: !483)
!513 = !DILocation(line: 1, column: 1, scope: !509)
!514 = !DILocalVariable(name: "$ret4", scope: !509, file: !30, line: 1, type: !40)
!515 = distinct !DISubprogram(name: "main._63_7int..eq", scope: null, file: !36, line: 1, type: !132, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!516 = !DILocalVariable(name: "key1", arg: 1, scope: !515, file: !36, line: 1, type: !15)
!517 = !DILocation(line: 1, column: 1, scope: !515)
!518 = !DILocalVariable(name: "key2", arg: 2, scope: !515, file: !36, line: 1, type: !15)
!519 = !DILocalVariable(name: "$ret5", scope: !515, file: !36, line: 1, type: !40)
!520 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !36, line: 1, type: !132, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!521 = !DILocalVariable(name: "key1", arg: 1, scope: !520, file: !36, line: 1, type: !15)
!522 = !DILocation(line: 1, column: 1, scope: !520)
!523 = !DILocalVariable(name: "key2", arg: 2, scope: !520, file: !36, line: 1, type: !15)
!524 = !DILocalVariable(name: "$ret6", scope: !520, file: !36, line: 1, type: !40)
!525 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !36, line: 1, type: !132, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!526 = !DILocalVariable(name: "key1", arg: 1, scope: !525, file: !36, line: 1, type: !15)
!527 = !DILocation(line: 1, column: 1, scope: !525)
!528 = !DILocalVariable(name: "key2", arg: 2, scope: !525, file: !36, line: 1, type: !15)
!529 = !DILocalVariable(name: "$ret7", scope: !525, file: !36, line: 1, type: !40)
!530 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !36, line: 1, type: !132, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!531 = !DILocalVariable(name: "key1", arg: 1, scope: !530, file: !36, line: 1, type: !15)
!532 = !DILocation(line: 1, column: 1, scope: !530)
!533 = !DILocalVariable(name: "key2", arg: 2, scope: !530, file: !36, line: 1, type: !15)
!534 = !DILocalVariable(name: "$ret8", scope: !530, file: !36, line: 1, type: !40)
!535 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !132, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!536 = !DILocalVariable(name: "key1", arg: 1, scope: !535, file: !36, line: 1, type: !15)
!537 = !DILocation(line: 1, column: 1, scope: !535)
!538 = !DILocalVariable(name: "key2", arg: 2, scope: !535, file: !36, line: 1, type: !15)
!539 = !DILocalVariable(name: "$ret9", scope: !535, file: !36, line: 1, type: !40)
