; ModuleID = 'utbotgo/functions/panicFunc/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 7, !"Dwarf Version", i32 4}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"uwtable", i32 1}
!5 = !{i32 7, !"frame-pointer", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_Go, file: !7, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !8)
!7 = !DIFile(filename: "./panic.go", directory: "/workspace")
!8 = !{!9, !22, !24, !26, !28, !30}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "", directory: "")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !11, size: 128, align: 8, elements: !13)
!13 = !{!14, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !11, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !11, line: 1, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, align: 8, elements: !20)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "void")
!20 = !{!21}
!21 = !DISubrange(count: 1, lowerBound: 0)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!33 = !DIFile(filename: "/klee/runtime/Freestanding/memcmp.c", directory: "/klee/build/runtime/Freestanding")
!34 = distinct !DICompileUnit(language: DW_LANG_C99, file: !35, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!35 = !DIFile(filename: "/klee/runtime/Freestanding/memcpy.c", directory: "/klee/build/runtime/Freestanding")
!36 = !{!"clang version 14.0.0"}
!37 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !38, line: 1, type: !39, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!38 = !DIFile(filename: "panic.go", directory: ".")
!39 = !DISubroutineType(types: !40)
!40 = !{!19}
!41 = !{}
!42 = !DILocation(line: 1, column: 1, scope: !43)
!43 = !DILexicalBlockFile(scope: !37, file: !44, discriminator: 0)
!44 = !DIFile(filename: "<built-in>", directory: "")
!45 = distinct !DISubprogram(name: "main.panicFunc", scope: null, file: !38, line: 3, type: !46, scopeLine: 3, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!46 = !DISubroutineType(types: !47)
!47 = !{!15, !15}
!48 = !DILocalVariable(name: "a", arg: 1, scope: !45, file: !38, line: 3, type: !15)
!49 = !DILocation(line: 3, column: 16, scope: !45)
!50 = !DILocalVariable(name: "$ret0", scope: !45, file: !38, line: 3, type: !15)
!51 = !DILocation(line: 3, column: 23, scope: !45)
!52 = !DILocation(line: 4, column: 5, scope: !45)
!53 = !DILocation(line: 4, column: 7, scope: !45)
!54 = !DILocation(line: 4, column: 2, scope: !45)
!55 = !DILocation(line: 0, scope: !45)
!56 = !DILocation(line: 5, column: 3, scope: !45)
!57 = !DILocation(line: 7, column: 5, scope: !45)
!58 = !DILocation(line: 7, column: 7, scope: !45)
!59 = !DILocation(line: 7, column: 2, scope: !45)
!60 = !DILocation(line: 8, column: 3, scope: !45)
!61 = !DILocation(line: 10, column: 2, scope: !45)
!62 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !38, line: 1, type: !63, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !450, !450}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !38, line: 1, size: 19456, align: 8, elements: !67)
!67 = !{!68, !131, !144, !270, !271, !272, !273, !274, !275, !276, !277, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !304, !305, !306, !307, !308, !323, !324, !392, !393, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !427, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !38, line: 1, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !38, line: 1, size: 256, align: 8, elements: !71)
!71 = !{!72, !73, !127, !128, !129, !130}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !74, size: 128, align: 64, offset: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !11, size: 128, align: 8, elements: !75)
!75 = !{!76, !126}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !44, line: 1, size: 512, align: 8, elements: !79)
!79 = !{!80, !82, !83, !85, !87, !88, !89, !90, !99, !101, !107, !125}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !44, line: 1, baseType: !81, size: 64, align: 64)
!81 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !44, line: 1, baseType: !81, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !44, line: 1, baseType: !84, size: 32, align: 32, offset: 128)
!84 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !44, line: 1, baseType: !86, size: 8, align: 8, offset: 160)
!86 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !44, line: 1, baseType: !86, size: 8, align: 8, offset: 168)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !44, line: 1, baseType: !86, size: 8, align: 8, offset: 176)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !44, line: 1, baseType: !86, size: 8, align: 8, offset: 184)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !44, line: 1, baseType: !91, size: 64, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !44, line: 1, size: 64, align: 8, elements: !93)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !44, line: 1, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !18, !18}
!98 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !44, line: 1, baseType: !100, size: 64, align: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !44, line: 1, baseType: !102, size: 64, align: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !44, line: 1, size: 128, align: 8, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !44, line: 1, baseType: !100, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !44, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !44, line: 1, baseType: !108, size: 64, align: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !44, line: 1, size: 320, align: 8, elements: !110)
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !44, line: 1, baseType: !102, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !44, line: 1, baseType: !102, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !44, line: 1, baseType: !114, size: 192, align: 64, offset: 128)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !11, size: 192, align: 8, elements: !115)
!115 = !{!116, !123, !124}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !44, line: 1, size: 320, align: 8, elements: !119)
!119 = !{!111, !112, !120, !121, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 200)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 208)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 216)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !38, line: 1, baseType: !132, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !38, line: 1, size: 512, align: 8, elements: !134)
!134 = !{!72, !135, !137, !138, !139, !140, !141, !142, !143}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !38, line: 1, baseType: !136, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !38, line: 1, baseType: !69, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !38, line: 1, baseType: !69, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 456)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !38, line: 1, baseType: !145, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !38, line: 1, size: 17280, align: 8, elements: !147)
!147 = !{!148, !149, !151, !152, !159, !165, !166, !168, !170, !171, !172, !174, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !187, !188, !189, !193, !194, !195, !196, !197, !198, !202, !203, !205, !206, !216, !217, !218, !219, !224, !225, !226, !227, !228, !229, !230, !247, !248, !249, !251, !255, !256, !265, !266, !267, !268, !269}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !38, line: 1, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !38, line: 1, baseType: !153, size: 1024, align: 64, offset: 192)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !38, line: 1, size: 1024, align: 8, elements: !154)
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !38, line: 1, baseType: !156, size: 1024, align: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 1024, align: 8, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 16, lowerBound: 0)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !38, line: 1, baseType: !160, size: 64, align: 64, offset: 1216)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !38, line: 1, baseType: !167, size: 64, align: 64, offset: 1344)
!167 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !38, line: 1, baseType: !169, size: 64, align: 64, offset: 1408)
!169 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !38, line: 1, baseType: !169, size: 64, align: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !38, line: 1, baseType: !169, size: 64, align: 64, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 1600)
!173 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !38, line: 1, baseType: !175, size: 32, align: 32, offset: 1664)
!175 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !38, line: 1, baseType: !175, size: 32, align: 32, offset: 1696)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !38, line: 1, baseType: !103, size: 128, align: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !38, line: 1, baseType: !175, size: 32, align: 32, offset: 1856)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !38, line: 1, baseType: !175, size: 32, align: 32, offset: 1888)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !38, line: 1, baseType: !175, size: 32, align: 32, offset: 1920)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !38, line: 1, baseType: !175, size: 32, align: 32, offset: 1952)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 1984)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 1992)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 2000)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !38, line: 1, baseType: !186, size: 8, align: 8, offset: 2008)
!186 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 2016)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 2048)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !38, line: 1, baseType: !190, size: 64, align: 32, offset: 2080)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, align: 4, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 2, lowerBound: 0)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 2144)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !38, line: 1, baseType: !86, size: 8, align: 8, offset: 2152)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !38, line: 1, baseType: !150, size: 64, align: 64, offset: 2176)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !38, line: 1, baseType: !175, size: 32, align: 32, offset: 2240)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 2272)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !38, line: 1, baseType: !199, size: 64, align: 64, offset: 2304)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !38, line: 1, size: 64, align: 8, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !38, line: 1, baseType: !81, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2368)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !38, line: 1, baseType: !204, size: 64, align: 64, offset: 2432)
!204 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !38, line: 1, baseType: !167, size: 64, align: 64, offset: 2496)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !38, line: 1, baseType: !207, size: 12288, align: 64, offset: 2560)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 12288, align: 8, elements: !214)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !38, line: 1, size: 384, align: 8, elements: !209)
!209 = !{!210, !211, !212, !213}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !38, line: 1, baseType: !81, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !38, line: 1, baseType: !103, size: 128, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !38, line: 1, baseType: !103, size: 128, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!214 = !{!215}
!215 = !DISubrange(count: 32, lowerBound: 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 14848)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 14880)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !38, line: 1, baseType: !204, size: 64, align: 64, offset: 14912)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !38, line: 1, baseType: !220, size: 64, align: 64, offset: 14976)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !222)
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !95, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 15040)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !38, line: 1, baseType: !86, size: 8, align: 8, offset: 15104)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 15168)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 15232)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 15264)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 15296)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !38, line: 1, baseType: !231, size: 192, align: 64, offset: 15360)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !11, size: 192, align: 8, elements: !232)
!232 = !{!233, !238, !239}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !11, line: 1, baseType: !234, size: 64, align: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !38, line: 1, size: 64, align: 8, elements: !235)
!235 = !{!236, !201}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !38, line: 1, baseType: !237, align: 8)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !38, line: 1, align: 1, elements: !41)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !11, line: 1, baseType: !84, size: 32, align: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !11, line: 1, baseType: !240, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !242)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!98, !98}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 15552)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 15584)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !38, line: 1, baseType: !250, align: 8, offset: 15616)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !38, line: 1, align: 1, elements: !41)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !38, line: 1, baseType: !252, size: 8, align: 8, offset: 15616)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !38, line: 1, size: 8, align: 1, elements: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !38, line: 1, baseType: !86, size: 8, align: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 15680)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !38, line: 1, baseType: !257, size: 1280, align: 64, offset: 15744)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 1280, align: 8, elements: !263)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !38, line: 1, size: 128, align: 8, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !38, line: 1, baseType: !81, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !38, line: 1, baseType: !262, size: 64, align: 64, offset: 64)
!262 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!263 = !{!264}
!264 = !DISubrange(count: 10, lowerBound: 0)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 17024)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 17088)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 17152)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 17160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !38, line: 1, baseType: !199, size: 64, align: 64, offset: 17216)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !38, line: 1, baseType: !167, size: 64, align: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !38, line: 1, baseType: !278, size: 8, align: 8, offset: 640)
!278 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 648)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 656)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 664)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 672)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 680)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 688)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 696)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 704)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 712)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !38, line: 1, baseType: !86, size: 8, align: 8, offset: 720)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !38, line: 1, baseType: !186, size: 8, align: 8, offset: 728)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 736)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 744)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !38, line: 1, baseType: !86, size: 8, align: 8, offset: 752)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 768)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 832)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 896)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !38, line: 1, baseType: !150, size: 64, align: 64, offset: 960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !38, line: 1, baseType: !169, size: 64, align: 64, offset: 1024)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !38, line: 1, baseType: !204, size: 64, align: 64, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 1152)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !38, line: 1, baseType: !301, size: 192, align: 64, offset: 1216)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !11, size: 192, align: 8, elements: !302)
!302 = !{!303, !123, !124}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !100, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 1408)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 1472)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 1536)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 1600)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !38, line: 1, baseType: !309, size: 64, align: 64, offset: 1664)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !11, size: 192, align: 8, elements: !311)
!311 = !{!312, !123, !124}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !38, line: 1, size: 320, align: 8, elements: !315)
!315 = !{!316, !321, !322}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !38, line: 1, baseType: !317, size: 192, align: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !11, size: 192, align: 8, elements: !318)
!318 = !{!319, !123, !124}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 1728)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !38, line: 1, baseType: !325, size: 64, align: 64, offset: 1792)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !38, line: 1, size: 704, align: 8, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 416)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 424)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !38, line: 1, baseType: !341, size: 64, align: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !38, line: 1, size: 768, align: 8, elements: !343)
!343 = !{!344, !346, !347, !348, !350, !351, !383, !384, !385, !390, !391}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !38, line: 1, baseType: !345, size: 64, align: 64)
!345 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !38, line: 1, baseType: !345, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !38, line: 1, baseType: !349, size: 16, align: 16, offset: 192)
!349 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !38, line: 1, baseType: !352, size: 64, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !38, line: 1, size: 512, align: 8, elements: !354)
!354 = !{!355, !356, !357, !358, !360, !361, !362, !363, !364, !365, !366, !382}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !38, line: 1, baseType: !81, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !38, line: 1, baseType: !359, size: 8, align: 8, offset: 160)
!359 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !38, line: 1, baseType: !86, size: 8, align: 8, offset: 168)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !38, line: 1, baseType: !86, size: 8, align: 8, offset: 176)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !38, line: 1, baseType: !86, size: 8, align: 8, offset: 184)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !38, line: 1, baseType: !220, size: 64, align: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !38, line: 1, baseType: !100, size: 64, align: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !38, line: 1, baseType: !102, size: 64, align: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !38, line: 1, baseType: !367, size: 64, align: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !38, line: 1, size: 320, align: 8, elements: !369)
!369 = !{!370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !38, line: 1, baseType: !102, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !38, line: 1, baseType: !102, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !38, line: 1, baseType: !373, size: 192, align: 64, offset: 128)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !11, size: 192, align: 8, elements: !374)
!374 = !{!375, !123, !124}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !38, line: 1, size: 320, align: 8, elements: !378)
!378 = !{!370, !371, !379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !38, line: 1, baseType: !345, size: 64, align: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !38, line: 1, baseType: !345, size: 64, align: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !38, line: 1, baseType: !386, size: 128, align: 64, offset: 448)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !38, line: 1, size: 128, align: 8, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !38, line: 1, baseType: !386, size: 128, align: 64, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !38, line: 1, baseType: !234, size: 64, align: 64, offset: 704)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 1856)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !38, line: 1, baseType: !394, size: 64, align: 64, offset: 1920)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !38, line: 1, size: 576, align: 8, elements: !396)
!396 = !{!397, !398, !399, !400, !408, !409, !410, !411}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !38, line: 1, baseType: !169, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !38, line: 1, baseType: !401, size: 64, align: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!19, !74, !81}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !74, size: 128, align: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !38, line: 1, baseType: !84, size: 32, align: 32, offset: 1984)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !38, line: 1, baseType: !173, size: 64, align: 64, offset: 2048)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2112)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 2176)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 2240)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 2304)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 2368)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 2432)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2496)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 2560)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2624)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !38, line: 1, baseType: !424, size: 7808, align: 64, offset: 2688)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 7808, align: 8, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 122, lowerBound: 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !38, line: 1, baseType: !428, size: 64, align: 64, offset: 10496)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!19, !18}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 10560)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 10624)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 10688)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 10696)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 10752)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 10816)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 10880)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 10888)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 10896)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 10904)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !38, line: 1, baseType: !98, size: 8, align: 8, offset: 10912)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !38, line: 1, baseType: !81, size: 64, align: 64, offset: 10944)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !38, line: 1, baseType: !424, size: 7808, align: 64, offset: 11008)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !38, line: 1, baseType: !449, size: 640, align: 64, offset: 18816)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 640, align: 8, elements: !263)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !11, size: 128, align: 8, elements: !452)
!452 = !{!453, !457}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !11, line: 1, baseType: !454, size: 64, align: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !38, line: 1, size: 64, align: 8, elements: !455)
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !38, line: 1, baseType: !167, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !11, line: 1, baseType: !175, size: 32, align: 32, offset: 64)
!458 = !DILocalVariable(name: "$this21", arg: 1, scope: !62, file: !38, line: 1, type: !450)
!459 = !DILocation(line: 1, column: 1, scope: !62)
!460 = !DILocalVariable(name: "$ret1", scope: !62, file: !38, line: 1, type: !65)
!461 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !38, line: 1, type: !462, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!462 = !DISubroutineType(types: !463)
!463 = !{!19, !450, !450, !464}
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !38, line: 1, size: 128, align: 8, elements: !465)
!465 = !{!456, !466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !38, line: 1, baseType: !167, size: 64, align: 64, offset: 64)
!467 = !DILocalVariable(name: "$this22", arg: 1, scope: !461, file: !38, line: 1, type: !450)
!468 = !DILocation(line: 1, column: 1, scope: !461)
!469 = !DILocalVariable(name: "$p23", arg: 2, scope: !461, file: !38, line: 1, type: !464)
!470 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !38, line: 1, type: !471, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!471 = !DISubroutineType(types: !472)
!472 = !{!19, !450, !450, !65}
!473 = !DILocalVariable(name: "$this24", arg: 1, scope: !470, file: !38, line: 1, type: !450)
!474 = !DILocation(line: 1, column: 1, scope: !470)
!475 = !DILocalVariable(name: "$p25", arg: 2, scope: !470, file: !38, line: 1, type: !65)
!476 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !38, line: 1, type: !477, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!477 = !DISubroutineType(types: !478)
!478 = !{!98, !450, !450}
!479 = !DILocalVariable(name: "$this26", arg: 1, scope: !476, file: !38, line: 1, type: !450)
!480 = !DILocation(line: 1, column: 1, scope: !476)
!481 = !DILocalVariable(name: "$ret2", scope: !476, file: !38, line: 1, type: !98)
!482 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !44, line: 1, type: !96, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!483 = !DILocalVariable(name: "key1", arg: 1, scope: !482, file: !44, line: 1, type: !18)
!484 = !DILocation(line: 1, column: 1, scope: !482)
!485 = !DILocalVariable(name: "key2", arg: 2, scope: !482, file: !44, line: 1, type: !18)
!486 = !DILocalVariable(name: "$ret3", scope: !482, file: !44, line: 1, type: !98)
!487 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !44, line: 1, type: !96, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!488 = !DILocalVariable(name: "key1", arg: 1, scope: !487, file: !44, line: 1, type: !18)
!489 = !DILocation(line: 1, column: 1, scope: !487)
!490 = !DILocalVariable(name: "key2", arg: 2, scope: !487, file: !44, line: 1, type: !18)
!491 = !DILocalVariable(name: "$ret4", scope: !487, file: !44, line: 1, type: !98)
!492 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !44, line: 1, type: !96, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!493 = !DILocalVariable(name: "key1", arg: 1, scope: !492, file: !44, line: 1, type: !18)
!494 = !DILocation(line: 1, column: 1, scope: !492)
!495 = !DILocalVariable(name: "key2", arg: 2, scope: !492, file: !44, line: 1, type: !18)
!496 = !DILocalVariable(name: "$ret5", scope: !492, file: !44, line: 1, type: !98)
!497 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !44, line: 1, type: !96, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!498 = !DILocalVariable(name: "key1", arg: 1, scope: !497, file: !44, line: 1, type: !18)
!499 = !DILocation(line: 1, column: 1, scope: !497)
!500 = !DILocalVariable(name: "key2", arg: 2, scope: !497, file: !44, line: 1, type: !18)
!501 = !DILocalVariable(name: "$ret6", scope: !497, file: !44, line: 1, type: !98)
!502 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !44, line: 1, type: !96, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!503 = !DILocalVariable(name: "key1", arg: 1, scope: !502, file: !44, line: 1, type: !18)
!504 = !DILocation(line: 1, column: 1, scope: !502)
!505 = !DILocalVariable(name: "key2", arg: 2, scope: !502, file: !44, line: 1, type: !18)
