; ModuleID = 'utbotgo/functions/hasNegativeArr/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 7, !"Dwarf Version", i32 4}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"uwtable", i32 1}
!5 = !{i32 7, !"frame-pointer", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_Go, file: !7, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !8)
!7 = !DIFile(filename: "./has_negative.go", directory: "/workspace")
!8 = !{!9, !22, !24, !26, !28, !30}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "", directory: "")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !11, size: 128, align: 8, elements: !13)
!13 = !{!14, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !11, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !11, line: 1, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, align: 8, elements: !20)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "void")
!20 = !{!21}
!21 = !DISubrange(count: 1, lowerBound: 0)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!33 = !DIFile(filename: "/klee/runtime/Freestanding/memcmp.c", directory: "/klee/build/runtime/Freestanding")
!34 = distinct !DICompileUnit(language: DW_LANG_C99, file: !35, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!35 = !DIFile(filename: "/klee/runtime/Freestanding/memcpy.c", directory: "/klee/build/runtime/Freestanding")
!36 = !{!"clang version 14.0.0"}
!37 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !38, line: 1, type: !39, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!38 = !DIFile(filename: "has_negative.go", directory: ".")
!39 = !DISubroutineType(types: !40)
!40 = !{!19}
!41 = !{}
!42 = !DILocation(line: 1, column: 1, scope: !43)
!43 = !DILexicalBlockFile(scope: !37, file: !44, discriminator: 0)
!44 = !DIFile(filename: "<built-in>", directory: "")
!45 = distinct !DISubprogram(name: "main.hasNegativeSlice", scope: null, file: !38, line: 3, type: !46, scopeLine: 3, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !49}
!48 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !11, size: 192, align: 8, elements: !50)
!50 = !{!51, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!55 = !DILocalVariable(name: "a", arg: 1, scope: !45, file: !38, line: 3, type: !49)
!56 = !DILocation(line: 3, column: 23, scope: !45)
!57 = !DILocalVariable(name: "$ret0", scope: !45, file: !38, line: 3, type: !48)
!58 = !DILocation(line: 3, column: 32, scope: !45)
!59 = !DILocalVariable(name: "i", scope: !60, file: !38, line: 4, type: !15)
!60 = distinct !DILexicalBlock(scope: !45, file: !38, line: 4, column: 2)
!61 = !DILocation(line: 4, column: 6, scope: !45)
!62 = !DILocation(line: 4, column: 2, scope: !60)
!63 = !DILocation(line: 5, column: 6, scope: !60)
!64 = !DILocation(line: 5, column: 8, scope: !60)
!65 = !DILocation(line: 5, column: 7, scope: !60)
!66 = !DILocation(line: 5, column: 11, scope: !60)
!67 = !DILocation(line: 5, column: 3, scope: !60)
!68 = !DILocation(line: 0, scope: !45)
!69 = !DILocation(line: 6, column: 4, scope: !60)
!70 = !DILocation(line: 9, column: 2, scope: !45)
!71 = distinct !DISubprogram(name: "main.hasNegativeArr", scope: null, file: !38, line: 12, type: !72, scopeLine: 12, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!72 = !DISubroutineType(types: !73)
!73 = !{!48, !74}
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, align: 8, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 3, lowerBound: 0)
!77 = !DILocalVariable(name: "a", arg: 1, scope: !71, file: !38, line: 12, type: !74)
!78 = !DILocation(line: 12, column: 21, scope: !71)
!79 = !DILocalVariable(name: "$ret1", scope: !71, file: !38, line: 12, type: !48)
!80 = !DILocation(line: 12, column: 31, scope: !71)
!81 = !DILocalVariable(name: "i", scope: !82, file: !38, line: 13, type: !15)
!82 = distinct !DILexicalBlock(scope: !71, file: !38, line: 13, column: 2)
!83 = !DILocation(line: 13, column: 6, scope: !71)
!84 = !DILocation(line: 13, column: 2, scope: !82)
!85 = !DILocation(line: 14, column: 8, scope: !82)
!86 = !DILocation(line: 14, column: 7, scope: !82)
!87 = !DILocation(line: 14, column: 11, scope: !82)
!88 = !DILocation(line: 14, column: 3, scope: !82)
!89 = !DILocation(line: 0, scope: !71)
!90 = !DILocation(line: 15, column: 4, scope: !82)
!91 = !DILocation(line: 18, column: 2, scope: !71)
!92 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !38, line: 1, type: !93, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !477, !477}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !38, line: 1, size: 19456, align: 8, elements: !97)
!97 = !{!98, !158, !171, !297, !298, !299, !300, !301, !302, !303, !304, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !331, !332, !333, !334, !335, !350, !351, !419, !420, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !454, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !38, line: 1, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !38, line: 1, size: 256, align: 8, elements: !101)
!101 = !{!102, !103, !154, !155, !156, !157}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !104, size: 128, align: 64, offset: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !11, size: 128, align: 8, elements: !105)
!105 = !{!106, !153}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !44, line: 1, size: 512, align: 8, elements: !109)
!109 = !{!110, !112, !113, !115, !117, !118, !119, !120, !128, !130, !136, !152}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !44, line: 1, baseType: !111, size: 64, align: 64)
!111 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !44, line: 1, baseType: !111, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !44, line: 1, baseType: !114, size: 32, align: 32, offset: 128)
!114 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !44, line: 1, baseType: !116, size: 8, align: 8, offset: 160)
!116 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !44, line: 1, baseType: !116, size: 8, align: 8, offset: 168)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !44, line: 1, baseType: !116, size: 8, align: 8, offset: 176)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !44, line: 1, baseType: !116, size: 8, align: 8, offset: 184)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !44, line: 1, baseType: !121, size: 64, align: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !44, line: 1, size: 64, align: 8, elements: !123)
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !44, line: 1, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!48, !18, !18}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !44, line: 1, baseType: !129, size: 64, align: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !44, line: 1, baseType: !131, size: 64, align: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !44, line: 1, size: 128, align: 8, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !44, line: 1, baseType: !129, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !44, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !44, line: 1, baseType: !137, size: 64, align: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !44, line: 1, size: 320, align: 8, elements: !139)
!139 = !{!140, !141, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !44, line: 1, baseType: !131, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !44, line: 1, baseType: !131, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !44, line: 1, baseType: !143, size: 192, align: 64, offset: 128)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !11, size: 192, align: 8, elements: !144)
!144 = !{!145, !53, !54}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !44, line: 1, size: 320, align: 8, elements: !148)
!148 = !{!140, !141, !149, !150, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !44, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 200)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 208)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 216)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !38, line: 1, baseType: !159, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !38, line: 1, size: 512, align: 8, elements: !161)
!161 = !{!102, !162, !164, !165, !166, !167, !168, !169, !170}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !38, line: 1, baseType: !163, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !38, line: 1, baseType: !99, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !38, line: 1, baseType: !99, size: 64, align: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 456)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !38, line: 1, baseType: !172, size: 64, align: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !38, line: 1, size: 17280, align: 8, elements: !174)
!174 = !{!175, !176, !178, !179, !186, !192, !193, !195, !197, !198, !199, !201, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !214, !215, !216, !220, !221, !222, !223, !224, !225, !229, !230, !232, !233, !243, !244, !245, !246, !251, !252, !253, !254, !255, !256, !257, !274, !275, !276, !278, !282, !283, !292, !293, !294, !295, !296}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !38, line: 1, baseType: !177, size: 64, align: 64, offset: 64)
!177 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !38, line: 1, baseType: !180, size: 1024, align: 64, offset: 192)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !38, line: 1, size: 1024, align: 8, elements: !181)
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !38, line: 1, baseType: !183, size: 1024, align: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 1024, align: 8, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 16, lowerBound: 0)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !38, line: 1, baseType: !187, size: 64, align: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !189)
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 1280)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !38, line: 1, baseType: !194, size: 64, align: 64, offset: 1344)
!194 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !38, line: 1, baseType: !196, size: 64, align: 64, offset: 1408)
!196 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !38, line: 1, baseType: !196, size: 64, align: 64, offset: 1472)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !38, line: 1, baseType: !196, size: 64, align: 64, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 1600)
!200 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !38, line: 1, baseType: !202, size: 32, align: 32, offset: 1664)
!202 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !38, line: 1, baseType: !202, size: 32, align: 32, offset: 1696)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !38, line: 1, baseType: !132, size: 128, align: 64, offset: 1728)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !38, line: 1, baseType: !202, size: 32, align: 32, offset: 1856)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !38, line: 1, baseType: !202, size: 32, align: 32, offset: 1888)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !38, line: 1, baseType: !202, size: 32, align: 32, offset: 1920)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !38, line: 1, baseType: !202, size: 32, align: 32, offset: 1952)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 1984)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 1992)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 2000)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !38, line: 1, baseType: !213, size: 8, align: 8, offset: 2008)
!213 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 2016)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 2048)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !38, line: 1, baseType: !217, size: 64, align: 32, offset: 2080)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 64, align: 4, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 2, lowerBound: 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 2144)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !38, line: 1, baseType: !116, size: 8, align: 8, offset: 2152)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !38, line: 1, baseType: !177, size: 64, align: 64, offset: 2176)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !38, line: 1, baseType: !202, size: 32, align: 32, offset: 2240)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 2272)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !38, line: 1, baseType: !226, size: 64, align: 64, offset: 2304)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !38, line: 1, size: 64, align: 8, elements: !227)
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !38, line: 1, baseType: !111, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2368)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !38, line: 1, baseType: !231, size: 64, align: 64, offset: 2432)
!231 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !38, line: 1, baseType: !194, size: 64, align: 64, offset: 2496)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !38, line: 1, baseType: !234, size: 12288, align: 64, offset: 2560)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 12288, align: 8, elements: !241)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !38, line: 1, size: 384, align: 8, elements: !236)
!236 = !{!237, !238, !239, !240}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !38, line: 1, baseType: !111, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !38, line: 1, baseType: !132, size: 128, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !38, line: 1, baseType: !132, size: 128, align: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!241 = !{!242}
!242 = !DISubrange(count: 32, lowerBound: 0)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 14848)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 14880)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !38, line: 1, baseType: !231, size: 64, align: 64, offset: 14912)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !38, line: 1, baseType: !247, size: 64, align: 64, offset: 14976)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !125, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 15040)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !38, line: 1, baseType: !116, size: 8, align: 8, offset: 15104)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 15168)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 15232)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 15264)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 15296)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !38, line: 1, baseType: !258, size: 192, align: 64, offset: 15360)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !11, size: 192, align: 8, elements: !259)
!259 = !{!260, !265, !266}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !11, line: 1, baseType: !261, size: 64, align: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !38, line: 1, size: 64, align: 8, elements: !262)
!262 = !{!263, !228}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !38, line: 1, baseType: !264, align: 8)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !38, line: 1, align: 1, elements: !41)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !11, line: 1, baseType: !114, size: 32, align: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !11, line: 1, baseType: !267, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!48, !48}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 15552)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 15584)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !38, line: 1, baseType: !277, align: 8, offset: 15616)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !38, line: 1, align: 1, elements: !41)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !38, line: 1, baseType: !279, size: 8, align: 8, offset: 15616)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !38, line: 1, size: 8, align: 1, elements: !280)
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !38, line: 1, baseType: !116, size: 8, align: 8)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !38, line: 1, baseType: !15, size: 64, align: 64, offset: 15680)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !38, line: 1, baseType: !284, size: 1280, align: 64, offset: 15744)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 1280, align: 8, elements: !290)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !38, line: 1, size: 128, align: 8, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !38, line: 1, baseType: !111, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !38, line: 1, baseType: !289, size: 64, align: 64, offset: 64)
!289 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!290 = !{!291}
!291 = !DISubrange(count: 10, lowerBound: 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 17024)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 17088)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 17152)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 17160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !38, line: 1, baseType: !226, size: 64, align: 64, offset: 17216)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !38, line: 1, baseType: !194, size: 64, align: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !38, line: 1, baseType: !305, size: 8, align: 8, offset: 640)
!305 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 648)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 656)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 664)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 672)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 680)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 688)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 696)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 704)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 712)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !38, line: 1, baseType: !116, size: 8, align: 8, offset: 720)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !38, line: 1, baseType: !213, size: 8, align: 8, offset: 728)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 736)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 744)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !38, line: 1, baseType: !116, size: 8, align: 8, offset: 752)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 768)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 896)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !38, line: 1, baseType: !177, size: 64, align: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !38, line: 1, baseType: !196, size: 64, align: 64, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !38, line: 1, baseType: !231, size: 64, align: 64, offset: 1088)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 1152)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !38, line: 1, baseType: !328, size: 192, align: 64, offset: 1216)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !11, size: 192, align: 8, elements: !329)
!329 = !{!330, !53, !54}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !129, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 1408)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 1472)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 1536)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 1600)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !38, line: 1, baseType: !336, size: 64, align: 64, offset: 1664)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !11, size: 192, align: 8, elements: !338)
!338 = !{!339, !53, !54}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !38, line: 1, size: 320, align: 8, elements: !342)
!342 = !{!343, !348, !349}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !38, line: 1, baseType: !344, size: 192, align: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !11, size: 192, align: 8, elements: !345)
!345 = !{!346, !53, !54}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 1728)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !38, line: 1, baseType: !352, size: 64, align: 64, offset: 1792)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !38, line: 1, size: 704, align: 8, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 416)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 424)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !38, line: 1, baseType: !368, size: 64, align: 64, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !38, line: 1, size: 768, align: 8, elements: !370)
!370 = !{!371, !373, !374, !375, !377, !378, !410, !411, !412, !417, !418}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !38, line: 1, baseType: !372, size: 64, align: 64)
!372 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !38, line: 1, baseType: !372, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !38, line: 1, baseType: !376, size: 16, align: 16, offset: 192)
!376 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !38, line: 1, baseType: !379, size: 64, align: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !38, line: 1, size: 512, align: 8, elements: !381)
!381 = !{!382, !383, !384, !385, !387, !388, !389, !390, !391, !392, !393, !409}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !38, line: 1, baseType: !111, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !38, line: 1, baseType: !386, size: 8, align: 8, offset: 160)
!386 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !38, line: 1, baseType: !116, size: 8, align: 8, offset: 168)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !38, line: 1, baseType: !116, size: 8, align: 8, offset: 176)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !38, line: 1, baseType: !116, size: 8, align: 8, offset: 184)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !38, line: 1, baseType: !247, size: 64, align: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !38, line: 1, baseType: !129, size: 64, align: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !38, line: 1, baseType: !131, size: 64, align: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !38, line: 1, baseType: !394, size: 64, align: 64, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !38, line: 1, size: 320, align: 8, elements: !396)
!396 = !{!397, !398, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !38, line: 1, baseType: !131, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !38, line: 1, baseType: !131, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !38, line: 1, baseType: !400, size: 192, align: 64, offset: 128)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !11, size: 192, align: 8, elements: !401)
!401 = !{!402, !53, !54}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !38, line: 1, size: 320, align: 8, elements: !405)
!405 = !{!397, !398, !406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !38, line: 1, baseType: !372, size: 64, align: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !38, line: 1, baseType: !372, size: 64, align: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !38, line: 1, baseType: !413, size: 128, align: 64, offset: 448)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !38, line: 1, size: 128, align: 8, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !38, line: 1, baseType: !18, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !38, line: 1, baseType: !413, size: 128, align: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !38, line: 1, baseType: !261, size: 64, align: 64, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 1856)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !38, line: 1, baseType: !421, size: 64, align: 64, offset: 1920)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !38, line: 1, size: 576, align: 8, elements: !423)
!423 = !{!424, !425, !426, !427, !435, !436, !437, !438}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !38, line: 1, baseType: !196, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !38, line: 1, baseType: !428, size: 64, align: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!19, !104, !111}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !38, line: 1, baseType: !104, size: 128, align: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !38, line: 1, baseType: !114, size: 32, align: 32, offset: 1984)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 2048)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2112)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 2176)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 2240)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 2304)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 2368)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 2432)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2496)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 2560)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !38, line: 1, baseType: !18, size: 64, align: 64, offset: 2624)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !38, line: 1, baseType: !451, size: 7808, align: 64, offset: 2688)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 7808, align: 8, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 122, lowerBound: 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !38, line: 1, baseType: !455, size: 64, align: 64, offset: 10496)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !38, line: 1, size: 64, align: 8, elements: !457)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !38, line: 1, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!19, !18}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 10560)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 10624)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10688)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10696)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 10752)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 10816)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10880)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10888)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10896)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10904)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !38, line: 1, baseType: !48, size: 8, align: 8, offset: 10912)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !38, line: 1, baseType: !111, size: 64, align: 64, offset: 10944)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !38, line: 1, baseType: !451, size: 7808, align: 64, offset: 11008)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !38, line: 1, baseType: !476, size: 640, align: 64, offset: 18816)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 640, align: 8, elements: !290)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !11, size: 128, align: 8, elements: !479)
!479 = !{!480, !484}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !11, line: 1, baseType: !481, size: 64, align: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !38, line: 1, size: 64, align: 8, elements: !482)
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !38, line: 1, baseType: !194, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !11, line: 1, baseType: !202, size: 32, align: 32, offset: 64)
!485 = !DILocalVariable(name: "$this21", arg: 1, scope: !92, file: !38, line: 1, type: !477)
!486 = !DILocation(line: 1, column: 1, scope: !92)
!487 = !DILocalVariable(name: "$ret2", scope: !92, file: !38, line: 1, type: !95)
!488 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !38, line: 1, type: !489, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!489 = !DISubroutineType(types: !490)
!490 = !{!19, !477, !477, !491}
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !38, line: 1, size: 128, align: 8, elements: !492)
!492 = !{!483, !493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !38, line: 1, baseType: !194, size: 64, align: 64, offset: 64)
!494 = !DILocalVariable(name: "$this22", arg: 1, scope: !488, file: !38, line: 1, type: !477)
!495 = !DILocation(line: 1, column: 1, scope: !488)
!496 = !DILocalVariable(name: "$p23", arg: 2, scope: !488, file: !38, line: 1, type: !491)
!497 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !38, line: 1, type: !498, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!498 = !DISubroutineType(types: !499)
!499 = !{!19, !477, !477, !95}
!500 = !DILocalVariable(name: "$this24", arg: 1, scope: !497, file: !38, line: 1, type: !477)
!501 = !DILocation(line: 1, column: 1, scope: !497)
!502 = !DILocalVariable(name: "$p25", arg: 2, scope: !497, file: !38, line: 1, type: !95)
!503 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !38, line: 1, type: !504, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !41)
!504 = !DISubroutineType(types: !505)
!505 = !{!48, !477, !477}
!506 = !DILocalVariable(name: "$this26", arg: 1, scope: !503, file: !38, line: 1, type: !477)
!507 = !DILocation(line: 1, column: 1, scope: !503)
!508 = !DILocalVariable(name: "$ret3", scope: !503, file: !38, line: 1, type: !48)
!509 = distinct !DISubprogram(name: "main._63_7int..eq", scope: null, file: !44, line: 1, type: !126, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!510 = !DILocalVariable(name: "key1", arg: 1, scope: !509, file: !44, line: 1, type: !18)
!511 = !DILocation(line: 1, column: 1, scope: !509)
!512 = !DILocalVariable(name: "key2", arg: 2, scope: !509, file: !44, line: 1, type: !18)
!513 = !DILocalVariable(name: "$ret4", scope: !509, file: !44, line: 1, type: !48)
!514 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !44, line: 1, type: !126, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!515 = !DILocalVariable(name: "key1", arg: 1, scope: !514, file: !44, line: 1, type: !18)
!516 = !DILocation(line: 1, column: 1, scope: !514)
!517 = !DILocalVariable(name: "key2", arg: 2, scope: !514, file: !44, line: 1, type: !18)
!518 = !DILocalVariable(name: "$ret5", scope: !514, file: !44, line: 1, type: !48)
!519 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !44, line: 1, type: !126, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!520 = !DILocalVariable(name: "key1", arg: 1, scope: !519, file: !44, line: 1, type: !18)
!521 = !DILocation(line: 1, column: 1, scope: !519)
!522 = !DILocalVariable(name: "key2", arg: 2, scope: !519, file: !44, line: 1, type: !18)
!523 = !DILocalVariable(name: "$ret6", scope: !519, file: !44, line: 1, type: !48)
!524 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !44, line: 1, type: !126, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!525 = !DILocalVariable(name: "key1", arg: 1, scope: !524, file: !44, line: 1, type: !18)
!526 = !DILocation(line: 1, column: 1, scope: !524)
!527 = !DILocalVariable(name: "key2", arg: 2, scope: !524, file: !44, line: 1, type: !18)
!528 = !DILocalVariable(name: "$ret7", scope: !524, file: !44, line: 1, type: !48)
!529 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !44, line: 1, type: !126, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!530 = !DILocalVariable(name: "key1", arg: 1, scope: !529, file: !44, line: 1, type: !18)
!531 = !DILocation(line: 1, column: 1, scope: !529)
!532 = !DILocalVariable(name: "key2", arg: 2, scope: !529, file: !44, line: 1, type: !18)
!533 = !DILocalVariable(name: "$ret8", scope: !529, file: !44, line: 1, type: !48)
