; ModuleID = 'utbotgo/functions/getSign/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 7, !"Dwarf Version", i32 4}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"uwtable", i32 1}
!5 = !{i32 7, !"frame-pointer", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_Go, file: !7, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !8)
!7 = !DIFile(filename: "./struct.go", directory: "/workspace")
!8 = !{!9, !22, !24, !26, !28, !30, !32}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "", directory: "")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !11, size: 128, align: 8, elements: !13)
!13 = !{!14, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !11, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !11, line: 1, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, align: 8, elements: !20)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "void")
!20 = !{!21}
!21 = !DISubrange(count: 1, lowerBound: 0)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "main..types", linkageName: "main..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!34 = distinct !DICompileUnit(language: DW_LANG_C99, file: !35, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!35 = !DIFile(filename: "/klee/runtime/Freestanding/memcmp.c", directory: "/klee/build/runtime/Freestanding")
!36 = distinct !DICompileUnit(language: DW_LANG_C99, file: !37, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!37 = !DIFile(filename: "/klee/runtime/Freestanding/memcpy.c", directory: "/klee/build/runtime/Freestanding")
!38 = !{!"clang version 14.0.0"}
!39 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !40, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!40 = !DIFile(filename: "struct.go", directory: ".")
!41 = !DISubroutineType(types: !42)
!42 = !{!19}
!43 = !{}
!44 = !DILocation(line: 1, column: 1, scope: !45)
!45 = !DILexicalBlockFile(scope: !39, file: !46, discriminator: 0)
!46 = !DIFile(filename: "<built-in>", directory: "")
!47 = distinct !DISubprogram(name: "main.getSign", scope: null, file: !40, line: 7, type: !48, scopeLine: 7, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!48 = !DISubroutineType(types: !49)
!49 = !{!15, !50}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "Input", file: !40, line: 3, size: 64, align: 8, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "A", file: !40, line: 4, baseType: !15, size: 64, align: 64)
!53 = !DILocalVariable(name: "i", arg: 1, scope: !47, file: !40, line: 7, type: !50)
!54 = !DILocation(line: 7, column: 14, scope: !47)
!55 = !DILocalVariable(name: "$ret0", scope: !47, file: !40, line: 7, type: !15)
!56 = !DILocation(line: 7, column: 23, scope: !47)
!57 = !DILocation(line: 8, column: 6, scope: !47)
!58 = !DILocation(line: 8, column: 9, scope: !47)
!59 = !DILocation(line: 8, column: 2, scope: !47)
!60 = !DILocation(line: 0, scope: !47)
!61 = !DILocation(line: 9, column: 3, scope: !47)
!62 = !DILocation(line: 11, column: 6, scope: !47)
!63 = !DILocation(line: 11, column: 9, scope: !47)
!64 = !DILocation(line: 11, column: 2, scope: !47)
!65 = !DILocation(line: 12, column: 3, scope: !47)
!66 = !DILocation(line: 14, column: 2, scope: !47)
!67 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !40, line: 1, type: !68, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !455, !455}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !40, line: 1, size: 19456, align: 8, elements: !72)
!72 = !{!73, !136, !149, !275, !276, !277, !278, !279, !280, !281, !282, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !309, !310, !311, !312, !313, !328, !329, !397, !398, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !432, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !40, line: 1, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !40, line: 1, size: 256, align: 8, elements: !76)
!76 = !{!77, !78, !132, !133, !134, !135}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !40, line: 1, baseType: !79, size: 128, align: 64, offset: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !11, size: 128, align: 8, elements: !80)
!80 = !{!81, !131}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !46, line: 1, size: 512, align: 8, elements: !84)
!84 = !{!85, !87, !88, !90, !92, !93, !94, !95, !104, !106, !112, !130}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !46, line: 1, baseType: !86, size: 64, align: 64)
!86 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !46, line: 1, baseType: !86, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !46, line: 1, baseType: !89, size: 32, align: 32, offset: 128)
!89 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !46, line: 1, baseType: !91, size: 8, align: 8, offset: 160)
!91 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !46, line: 1, baseType: !91, size: 8, align: 8, offset: 168)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !46, line: 1, baseType: !91, size: 8, align: 8, offset: 176)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !46, line: 1, baseType: !91, size: 8, align: 8, offset: 184)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !46, line: 1, baseType: !96, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !46, line: 1, size: 64, align: 8, elements: !98)
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !46, line: 1, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!103, !18, !18}
!103 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !46, line: 1, baseType: !105, size: 64, align: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !46, line: 1, baseType: !107, size: 64, align: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !46, line: 1, size: 128, align: 8, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !46, line: 1, baseType: !105, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !46, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !46, line: 1, baseType: !113, size: 64, align: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !46, line: 1, size: 320, align: 8, elements: !115)
!115 = !{!116, !117, !118}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !46, line: 1, baseType: !107, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !46, line: 1, baseType: !107, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !46, line: 1, baseType: !119, size: 192, align: 64, offset: 128)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !11, size: 192, align: 8, elements: !120)
!120 = !{!121, !128, !129}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !46, line: 1, size: 320, align: 8, elements: !124)
!124 = !{!116, !117, !125, !126, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 200)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 208)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 216)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !40, line: 1, baseType: !137, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !40, line: 1, size: 512, align: 8, elements: !139)
!139 = !{!77, !140, !142, !143, !144, !145, !146, !147, !148}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !40, line: 1, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !40, line: 1, baseType: !74, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !40, line: 1, baseType: !74, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 456)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !40, line: 1, baseType: !150, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !40, line: 1, size: 17280, align: 8, elements: !152)
!152 = !{!153, !154, !156, !157, !164, !170, !171, !173, !175, !176, !177, !179, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !192, !193, !194, !198, !199, !200, !201, !202, !203, !207, !208, !210, !211, !221, !222, !223, !224, !229, !230, !231, !232, !233, !234, !235, !252, !253, !254, !256, !260, !261, !270, !271, !272, !273, !274}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !40, line: 1, baseType: !155, size: 64, align: 64, offset: 64)
!155 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !40, line: 1, baseType: !158, size: 1024, align: 64, offset: 192)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !40, line: 1, size: 1024, align: 8, elements: !159)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !40, line: 1, baseType: !161, size: 1024, align: 64)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 1024, align: 8, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 16, lowerBound: 0)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !40, line: 1, baseType: !165, size: 64, align: 64, offset: 1216)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !167)
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !40, line: 1, baseType: !172, size: 64, align: 64, offset: 1344)
!172 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !40, line: 1, baseType: !174, size: 64, align: 64, offset: 1408)
!174 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !40, line: 1, baseType: !174, size: 64, align: 64, offset: 1472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !40, line: 1, baseType: !174, size: 64, align: 64, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 1600)
!178 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !40, line: 1, baseType: !180, size: 32, align: 32, offset: 1664)
!180 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !40, line: 1, baseType: !180, size: 32, align: 32, offset: 1696)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !40, line: 1, baseType: !108, size: 128, align: 64, offset: 1728)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !40, line: 1, baseType: !180, size: 32, align: 32, offset: 1856)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !40, line: 1, baseType: !180, size: 32, align: 32, offset: 1888)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !40, line: 1, baseType: !180, size: 32, align: 32, offset: 1920)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !40, line: 1, baseType: !180, size: 32, align: 32, offset: 1952)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 1984)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 1992)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 2000)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !40, line: 1, baseType: !191, size: 8, align: 8, offset: 2008)
!191 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 2016)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 2048)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !40, line: 1, baseType: !195, size: 64, align: 32, offset: 2080)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 64, align: 4, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 2, lowerBound: 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 2144)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !40, line: 1, baseType: !91, size: 8, align: 8, offset: 2152)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !40, line: 1, baseType: !155, size: 64, align: 64, offset: 2176)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !40, line: 1, baseType: !180, size: 32, align: 32, offset: 2240)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 2272)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !40, line: 1, baseType: !204, size: 64, align: 64, offset: 2304)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !40, line: 1, size: 64, align: 8, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !40, line: 1, baseType: !86, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2368)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !40, line: 1, baseType: !209, size: 64, align: 64, offset: 2432)
!209 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !40, line: 1, baseType: !172, size: 64, align: 64, offset: 2496)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !40, line: 1, baseType: !212, size: 12288, align: 64, offset: 2560)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 12288, align: 8, elements: !219)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !40, line: 1, size: 384, align: 8, elements: !214)
!214 = !{!215, !216, !217, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !40, line: 1, baseType: !86, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !40, line: 1, baseType: !108, size: 128, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !40, line: 1, baseType: !108, size: 128, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !40, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!219 = !{!220}
!220 = !DISubrange(count: 32, lowerBound: 0)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 14848)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 14880)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !40, line: 1, baseType: !209, size: 64, align: 64, offset: 14912)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !40, line: 1, baseType: !225, size: 64, align: 64, offset: 14976)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !227)
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !100, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 15040)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !40, line: 1, baseType: !91, size: 8, align: 8, offset: 15104)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !40, line: 1, baseType: !15, size: 64, align: 64, offset: 15168)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 15232)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 15264)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 15296)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !40, line: 1, baseType: !236, size: 192, align: 64, offset: 15360)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !11, size: 192, align: 8, elements: !237)
!237 = !{!238, !243, !244}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !11, line: 1, baseType: !239, size: 64, align: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !40, line: 1, size: 64, align: 8, elements: !240)
!240 = !{!241, !206}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !40, line: 1, baseType: !242, align: 8)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !40, line: 1, align: 1, elements: !43)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !11, line: 1, baseType: !89, size: 32, align: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !11, line: 1, baseType: !245, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !247)
!247 = !{!248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!103, !103}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 15552)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 15584)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !40, line: 1, baseType: !255, align: 8, offset: 15616)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !40, line: 1, align: 1, elements: !43)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !40, line: 1, baseType: !257, size: 8, align: 8, offset: 15616)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !40, line: 1, size: 8, align: 1, elements: !258)
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !40, line: 1, baseType: !91, size: 8, align: 8)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !40, line: 1, baseType: !15, size: 64, align: 64, offset: 15680)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !40, line: 1, baseType: !262, size: 1280, align: 64, offset: 15744)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 1280, align: 8, elements: !268)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !40, line: 1, size: 128, align: 8, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !40, line: 1, baseType: !86, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !40, line: 1, baseType: !267, size: 64, align: 64, offset: 64)
!267 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!268 = !{!269}
!269 = !DISubrange(count: 10, lowerBound: 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 17024)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 17088)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 17152)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 17160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !40, line: 1, baseType: !204, size: 64, align: 64, offset: 17216)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !40, line: 1, baseType: !172, size: 64, align: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !40, line: 1, baseType: !283, size: 8, align: 8, offset: 640)
!283 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 648)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 656)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 672)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 680)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 688)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 696)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 712)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !40, line: 1, baseType: !91, size: 8, align: 8, offset: 720)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !40, line: 1, baseType: !191, size: 8, align: 8, offset: 728)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 736)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 744)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !40, line: 1, baseType: !91, size: 8, align: 8, offset: 752)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !40, line: 1, baseType: !155, size: 64, align: 64, offset: 960)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !40, line: 1, baseType: !174, size: 64, align: 64, offset: 1024)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !40, line: 1, baseType: !209, size: 64, align: 64, offset: 1088)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 1152)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !40, line: 1, baseType: !306, size: 192, align: 64, offset: 1216)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !11, size: 192, align: 8, elements: !307)
!307 = !{!308, !128, !129}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !105, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 1472)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 1536)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 1600)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !40, line: 1, baseType: !314, size: 64, align: 64, offset: 1664)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !11, size: 192, align: 8, elements: !316)
!316 = !{!317, !128, !129}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !40, line: 1, size: 320, align: 8, elements: !320)
!320 = !{!321, !326, !327}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !40, line: 1, baseType: !322, size: 192, align: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !11, size: 192, align: 8, elements: !323)
!323 = !{!324, !128, !129}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 1728)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !40, line: 1, baseType: !330, size: 64, align: 64, offset: 1792)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !40, line: 1, size: 704, align: 8, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 416)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 424)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !40, line: 1, baseType: !346, size: 64, align: 64, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !40, line: 1, size: 768, align: 8, elements: !348)
!348 = !{!349, !351, !352, !353, !355, !356, !388, !389, !390, !395, !396}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !40, line: 1, baseType: !350, size: 64, align: 64)
!350 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !40, line: 1, baseType: !350, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !40, line: 1, baseType: !354, size: 16, align: 16, offset: 192)
!354 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 224)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !40, line: 1, baseType: !357, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !40, line: 1, size: 512, align: 8, elements: !359)
!359 = !{!360, !361, !362, !363, !365, !366, !367, !368, !369, !370, !371, !387}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !40, line: 1, baseType: !86, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !40, line: 1, baseType: !364, size: 8, align: 8, offset: 160)
!364 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !40, line: 1, baseType: !91, size: 8, align: 8, offset: 168)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !40, line: 1, baseType: !91, size: 8, align: 8, offset: 176)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !40, line: 1, baseType: !91, size: 8, align: 8, offset: 184)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !40, line: 1, baseType: !225, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !40, line: 1, baseType: !105, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !40, line: 1, baseType: !107, size: 64, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !40, line: 1, baseType: !372, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !40, line: 1, size: 320, align: 8, elements: !374)
!374 = !{!375, !376, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !40, line: 1, baseType: !107, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !40, line: 1, baseType: !107, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !40, line: 1, baseType: !378, size: 192, align: 64, offset: 128)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !11, size: 192, align: 8, elements: !379)
!379 = !{!380, !128, !129}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !40, line: 1, size: 320, align: 8, elements: !383)
!383 = !{!375, !376, !384, !385, !386}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !40, line: 1, baseType: !350, size: 64, align: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !40, line: 1, baseType: !350, size: 64, align: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !40, line: 1, baseType: !391, size: 128, align: 64, offset: 448)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !40, line: 1, size: 128, align: 8, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !40, line: 1, baseType: !391, size: 128, align: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !40, line: 1, baseType: !239, size: 64, align: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 1856)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !40, line: 1, baseType: !399, size: 64, align: 64, offset: 1920)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !40, line: 1, size: 576, align: 8, elements: !401)
!401 = !{!402, !403, !404, !405, !413, !414, !415, !416}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !40, line: 1, baseType: !174, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !40, line: 1, baseType: !406, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!19, !79, !86}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !40, line: 1, baseType: !79, size: 128, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !40, line: 1, baseType: !89, size: 32, align: 32, offset: 1984)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !40, line: 1, baseType: !178, size: 64, align: 64, offset: 2048)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2112)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 2176)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 2240)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 2304)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 2368)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 2432)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2496)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 2560)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2624)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !40, line: 1, baseType: !429, size: 7808, align: 64, offset: 2688)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 7808, align: 8, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 122, lowerBound: 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !40, line: 1, baseType: !433, size: 64, align: 64, offset: 10496)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !435)
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!19, !18}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 10560)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 10624)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 10688)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 10696)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 10752)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 10816)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 10880)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 10888)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 10896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 10904)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !40, line: 1, baseType: !103, size: 8, align: 8, offset: 10912)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !40, line: 1, baseType: !86, size: 64, align: 64, offset: 10944)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !40, line: 1, baseType: !429, size: 7808, align: 64, offset: 11008)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !40, line: 1, baseType: !454, size: 640, align: 64, offset: 18816)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 640, align: 8, elements: !268)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !11, size: 128, align: 8, elements: !457)
!457 = !{!458, !462}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !11, line: 1, baseType: !459, size: 64, align: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !40, line: 1, size: 64, align: 8, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !40, line: 1, baseType: !172, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !11, line: 1, baseType: !180, size: 32, align: 32, offset: 64)
!463 = !DILocalVariable(name: "$this21", arg: 1, scope: !67, file: !40, line: 1, type: !455)
!464 = !DILocation(line: 1, column: 1, scope: !67)
!465 = !DILocalVariable(name: "$ret1", scope: !67, file: !40, line: 1, type: !70)
!466 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !40, line: 1, type: !467, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!467 = !DISubroutineType(types: !468)
!468 = !{!19, !455, !455, !469}
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !40, line: 1, size: 128, align: 8, elements: !470)
!470 = !{!461, !471}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !40, line: 1, baseType: !172, size: 64, align: 64, offset: 64)
!472 = !DILocalVariable(name: "$this22", arg: 1, scope: !466, file: !40, line: 1, type: !455)
!473 = !DILocation(line: 1, column: 1, scope: !466)
!474 = !DILocalVariable(name: "$p23", arg: 2, scope: !466, file: !40, line: 1, type: !469)
!475 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !40, line: 1, type: !476, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!476 = !DISubroutineType(types: !477)
!477 = !{!19, !455, !455, !70}
!478 = !DILocalVariable(name: "$this24", arg: 1, scope: !475, file: !40, line: 1, type: !455)
!479 = !DILocation(line: 1, column: 1, scope: !475)
!480 = !DILocalVariable(name: "$p25", arg: 2, scope: !475, file: !40, line: 1, type: !70)
!481 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !40, line: 1, type: !482, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!482 = !DISubroutineType(types: !483)
!483 = !{!103, !455, !455}
!484 = !DILocalVariable(name: "$this26", arg: 1, scope: !481, file: !40, line: 1, type: !455)
!485 = !DILocation(line: 1, column: 1, scope: !481)
!486 = !DILocalVariable(name: "$ret2", scope: !481, file: !40, line: 1, type: !103)
!487 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !46, line: 1, type: !101, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!488 = !DILocalVariable(name: "key1", arg: 1, scope: !487, file: !46, line: 1, type: !18)
!489 = !DILocation(line: 1, column: 1, scope: !487)
!490 = !DILocalVariable(name: "key2", arg: 2, scope: !487, file: !46, line: 1, type: !18)
!491 = !DILocalVariable(name: "$ret3", scope: !487, file: !46, line: 1, type: !103)
!492 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !46, line: 1, type: !101, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!493 = !DILocalVariable(name: "key1", arg: 1, scope: !492, file: !46, line: 1, type: !18)
!494 = !DILocation(line: 1, column: 1, scope: !492)
!495 = !DILocalVariable(name: "key2", arg: 2, scope: !492, file: !46, line: 1, type: !18)
!496 = !DILocalVariable(name: "$ret4", scope: !492, file: !46, line: 1, type: !103)
!497 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !46, line: 1, type: !101, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!498 = !DILocalVariable(name: "key1", arg: 1, scope: !497, file: !46, line: 1, type: !18)
!499 = !DILocation(line: 1, column: 1, scope: !497)
!500 = !DILocalVariable(name: "key2", arg: 2, scope: !497, file: !46, line: 1, type: !18)
!501 = !DILocalVariable(name: "$ret5", scope: !497, file: !46, line: 1, type: !103)
!502 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !46, line: 1, type: !101, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!503 = !DILocalVariable(name: "key1", arg: 1, scope: !502, file: !46, line: 1, type: !18)
!504 = !DILocation(line: 1, column: 1, scope: !502)
!505 = !DILocalVariable(name: "key2", arg: 2, scope: !502, file: !46, line: 1, type: !18)
!506 = !DILocalVariable(name: "$ret6", scope: !502, file: !46, line: 1, type: !103)
!507 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !46, line: 1, type: !101, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!508 = !DILocalVariable(name: "key1", arg: 1, scope: !507, file: !46, line: 1, type: !18)
!509 = !DILocation(line: 1, column: 1, scope: !507)
!510 = !DILocalVariable(name: "key2", arg: 2, scope: !507, file: !46, line: 1, type: !18)
