; ModuleID = 'utbotgo/package/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./get_sign.go", directory: "/workspace")
!5 = !{!6, !19, !21, !23, !25, !27}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !8, size: 128, align: 8, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, align: 8, elements: !17)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "void")
!17 = !{!18}
!18 = !DISubrange(count: 1, lowerBound: 0)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!29 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !30, line: 1, type: !31, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!30 = !DIFile(filename: "get_sign.go", directory: ".")
!31 = !DISubroutineType(types: !32)
!32 = !{!16}
!33 = !{}
!34 = !DILocation(line: 1, column: 1, scope: !35)
!35 = !DILexicalBlockFile(scope: !29, file: !36, discriminator: 0)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = distinct !DISubprogram(name: "main.getSign", scope: null, file: !30, line: 3, type: !38, scopeLine: 3, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!38 = !DISubroutineType(types: !39)
!39 = !{!12, !40}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!41 = !DILocalVariable(name: "i", arg: 1, scope: !37, file: !30, line: 3, type: !40)
!42 = !DILocation(line: 3, column: 14, scope: !37)
!43 = !DILocalVariable(name: "$ret0", scope: !37, file: !30, line: 3, type: !12)
!44 = !DILocation(line: 3, column: 22, scope: !37)
!45 = !DILocation(line: 4, column: 6, scope: !37)
!46 = !DILocation(line: 4, column: 5, scope: !37)
!47 = !DILocation(line: 4, column: 8, scope: !37)
!48 = !DILocation(line: 4, column: 2, scope: !37)
!49 = !DILocation(line: 5, column: 3, scope: !37)
!50 = !DILocation(line: 7, column: 6, scope: !37)
!51 = !DILocation(line: 7, column: 5, scope: !37)
!52 = !DILocation(line: 7, column: 8, scope: !37)
!53 = !DILocation(line: 7, column: 2, scope: !37)
!54 = !DILocation(line: 8, column: 3, scope: !37)
!55 = !DILocation(line: 10, column: 2, scope: !37)
!56 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !30, line: 1, type: !57, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !444, !444}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !30, line: 1, size: 19456, align: 8, elements: !61)
!61 = !{!62, !125, !138, !264, !265, !266, !267, !268, !269, !270, !271, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !298, !299, !300, !301, !302, !317, !318, !386, !387, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !421, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !30, line: 1, size: 256, align: 8, elements: !65)
!65 = !{!66, !67, !121, !122, !123, !124}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !68, size: 128, align: 64, offset: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !8, size: 128, align: 8, elements: !69)
!69 = !{!70, !120}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 512, align: 8, elements: !73)
!73 = !{!74, !76, !77, !79, !81, !82, !83, !84, !93, !95, !101, !119}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !75, size: 64, align: 64)
!75 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !75, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !78, size: 32, align: 32, offset: 128)
!78 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !36, line: 1, baseType: !80, size: 8, align: 8, offset: 160)
!80 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !80, size: 8, align: 8, offset: 168)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !80, size: 8, align: 8, offset: 176)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !80, size: 8, align: 8, offset: 184)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !36, line: 1, baseType: !85, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !87)
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !15, !15}
!92 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !94, size: 64, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !96, size: 64, align: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !98)
!98 = !{!99, !100}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !94, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !102, size: 64, align: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !104)
!104 = !{!105, !106, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !96, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !96, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !108, size: 192, align: 64, offset: 128)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !8, size: 192, align: 8, elements: !109)
!109 = !{!110, !117, !118}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !113)
!113 = !{!105, !106, !114, !115, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 200)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 208)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 216)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !30, line: 1, baseType: !126, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !30, line: 1, size: 512, align: 8, elements: !128)
!128 = !{!66, !129, !131, !132, !133, !134, !135, !136, !137}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !30, line: 1, baseType: !130, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !30, line: 1, baseType: !63, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !63, size: 64, align: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 456)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !30, line: 1, baseType: !139, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !30, line: 1, size: 17280, align: 8, elements: !141)
!141 = !{!142, !143, !145, !146, !153, !159, !160, !162, !164, !165, !166, !168, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !181, !182, !183, !187, !188, !189, !190, !191, !192, !196, !197, !199, !200, !210, !211, !212, !213, !218, !219, !220, !221, !222, !223, !224, !241, !242, !243, !245, !249, !250, !259, !260, !261, !262, !263}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !30, line: 1, baseType: !144, size: 64, align: 64, offset: 64)
!144 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !30, line: 1, baseType: !147, size: 1024, align: 64, offset: 192)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !30, line: 1, size: 1024, align: 8, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !30, line: 1, baseType: !150, size: 1024, align: 64)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 1024, align: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 16, lowerBound: 0)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !30, line: 1, baseType: !154, size: 64, align: 64, offset: 1216)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !30, line: 1, baseType: !161, size: 64, align: 64, offset: 1344)
!161 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 1408)
!163 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 1472)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 1536)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 1600)
!167 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !30, line: 1, baseType: !169, size: 32, align: 32, offset: 1664)
!169 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !30, line: 1, baseType: !169, size: 32, align: 32, offset: 1696)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !30, line: 1, baseType: !97, size: 128, align: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !30, line: 1, baseType: !169, size: 32, align: 32, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !30, line: 1, baseType: !169, size: 32, align: 32, offset: 1888)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !30, line: 1, baseType: !169, size: 32, align: 32, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !30, line: 1, baseType: !169, size: 32, align: 32, offset: 1952)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 1984)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 1992)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 2000)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !30, line: 1, baseType: !180, size: 8, align: 8, offset: 2008)
!180 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 2016)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 2048)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !30, line: 1, baseType: !184, size: 64, align: 32, offset: 2080)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, align: 4, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 2, lowerBound: 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 2144)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !80, size: 8, align: 8, offset: 2152)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !30, line: 1, baseType: !144, size: 64, align: 64, offset: 2176)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !30, line: 1, baseType: !169, size: 32, align: 32, offset: 2240)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 2272)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !30, line: 1, baseType: !193, size: 64, align: 64, offset: 2304)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !30, line: 1, size: 64, align: 8, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !30, line: 1, baseType: !75, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2368)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !198, size: 64, align: 64, offset: 2432)
!198 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !30, line: 1, baseType: !161, size: 64, align: 64, offset: 2496)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !30, line: 1, baseType: !201, size: 12288, align: 64, offset: 2560)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 12288, align: 8, elements: !208)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !30, line: 1, size: 384, align: 8, elements: !203)
!203 = !{!204, !205, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !30, line: 1, baseType: !75, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !30, line: 1, baseType: !97, size: 128, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !30, line: 1, baseType: !97, size: 128, align: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!208 = !{!209}
!209 = !DISubrange(count: 32, lowerBound: 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 14848)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 14880)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !30, line: 1, baseType: !198, size: 64, align: 64, offset: 14912)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !30, line: 1, baseType: !214, size: 64, align: 64, offset: 14976)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !216)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !89, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15040)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !30, line: 1, baseType: !80, size: 8, align: 8, offset: 15104)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15168)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 15232)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 15264)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15296)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !30, line: 1, baseType: !225, size: 192, align: 64, offset: 15360)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !8, size: 192, align: 8, elements: !226)
!226 = !{!227, !232, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !8, line: 1, baseType: !228, size: 64, align: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !30, line: 1, size: 64, align: 8, elements: !229)
!229 = !{!230, !195}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !30, line: 1, baseType: !231, align: 8)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !30, line: 1, align: 1, elements: !33)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !8, line: 1, baseType: !78, size: 32, align: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !8, line: 1, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !236)
!236 = !{!237}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!92, !92}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 15552)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 15584)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !30, line: 1, baseType: !244, align: 8, offset: 15616)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !30, line: 1, align: 1, elements: !33)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !30, line: 1, baseType: !246, size: 8, align: 8, offset: 15616)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !30, line: 1, size: 8, align: 1, elements: !247)
!247 = !{!248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !30, line: 1, baseType: !80, size: 8, align: 8)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15680)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !30, line: 1, baseType: !251, size: 1280, align: 64, offset: 15744)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 1280, align: 8, elements: !257)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !30, line: 1, size: 128, align: 8, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !30, line: 1, baseType: !75, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !30, line: 1, baseType: !256, size: 64, align: 64, offset: 64)
!256 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!257 = !{!258}
!258 = !DISubrange(count: 10, lowerBound: 0)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 17024)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 17088)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 17152)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 17160)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !30, line: 1, baseType: !193, size: 64, align: 64, offset: 17216)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !161, size: 64, align: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !30, line: 1, baseType: !272, size: 8, align: 8, offset: 640)
!272 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 648)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 656)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 664)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 672)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 680)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 688)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 696)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 712)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !30, line: 1, baseType: !80, size: 8, align: 8, offset: 720)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !30, line: 1, baseType: !180, size: 8, align: 8, offset: 728)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 736)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 744)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !30, line: 1, baseType: !80, size: 8, align: 8, offset: 752)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 768)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 832)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 896)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !30, line: 1, baseType: !144, size: 64, align: 64, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 1024)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !30, line: 1, baseType: !198, size: 64, align: 64, offset: 1088)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 1152)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !30, line: 1, baseType: !295, size: 192, align: 64, offset: 1216)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !8, size: 192, align: 8, elements: !296)
!296 = !{!297, !117, !118}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !94, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 1408)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 1472)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 1536)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 1600)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !30, line: 1, baseType: !303, size: 64, align: 64, offset: 1664)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !8, size: 192, align: 8, elements: !305)
!305 = !{!306, !117, !118}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !30, line: 1, size: 320, align: 8, elements: !309)
!309 = !{!310, !315, !316}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !30, line: 1, baseType: !311, size: 192, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !8, size: 192, align: 8, elements: !312)
!312 = !{!313, !117, !118}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 1728)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !30, line: 1, baseType: !319, size: 64, align: 64, offset: 1792)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !30, line: 1, size: 704, align: 8, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 416)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 424)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !30, line: 1, baseType: !335, size: 64, align: 64, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !30, line: 1, size: 768, align: 8, elements: !337)
!337 = !{!338, !340, !341, !342, !344, !345, !377, !378, !379, !384, !385}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !30, line: 1, baseType: !339, size: 64, align: 64)
!339 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !30, line: 1, baseType: !339, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !30, line: 1, baseType: !343, size: 16, align: 16, offset: 192)
!343 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 224)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !30, line: 1, baseType: !346, size: 64, align: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !30, line: 1, size: 512, align: 8, elements: !348)
!348 = !{!349, !350, !351, !352, !354, !355, !356, !357, !358, !359, !360, !376}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !30, line: 1, baseType: !75, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !30, line: 1, baseType: !353, size: 8, align: 8, offset: 160)
!353 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !30, line: 1, baseType: !80, size: 8, align: 8, offset: 168)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !30, line: 1, baseType: !80, size: 8, align: 8, offset: 176)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !30, line: 1, baseType: !80, size: 8, align: 8, offset: 184)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !30, line: 1, baseType: !214, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !30, line: 1, baseType: !94, size: 64, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !30, line: 1, baseType: !96, size: 64, align: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !30, line: 1, baseType: !361, size: 64, align: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !30, line: 1, size: 320, align: 8, elements: !363)
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !30, line: 1, baseType: !96, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !30, line: 1, baseType: !96, size: 64, align: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !30, line: 1, baseType: !367, size: 192, align: 64, offset: 128)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !8, size: 192, align: 8, elements: !368)
!368 = !{!369, !117, !118}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !30, line: 1, size: 320, align: 8, elements: !372)
!372 = !{!364, !365, !373, !374, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !30, line: 1, baseType: !339, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !30, line: 1, baseType: !339, size: 64, align: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !30, line: 1, baseType: !380, size: 128, align: 64, offset: 448)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !30, line: 1, size: 128, align: 8, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !30, line: 1, baseType: !380, size: 128, align: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !30, line: 1, baseType: !228, size: 64, align: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1856)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !30, line: 1, baseType: !388, size: 64, align: 64, offset: 1920)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !30, line: 1, size: 576, align: 8, elements: !390)
!390 = !{!391, !392, !393, !394, !402, !403, !404, !405}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !30, line: 1, baseType: !163, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !30, line: 1, baseType: !395, size: 64, align: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!16, !68, !75}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !68, size: 128, align: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !30, line: 1, baseType: !78, size: 32, align: 32, offset: 1984)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 2048)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2112)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 2176)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 2240)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 2304)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 2368)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 2432)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2496)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 2560)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2624)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !30, line: 1, baseType: !418, size: 7808, align: 64, offset: 2688)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 7808, align: 8, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 122, lowerBound: 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !30, line: 1, baseType: !422, size: 64, align: 64, offset: 10496)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !424)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!16, !15}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 10560)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 10624)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 10688)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 10696)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 10752)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 10816)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 10880)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 10888)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 10896)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 10904)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !30, line: 1, baseType: !92, size: 8, align: 8, offset: 10912)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !75, size: 64, align: 64, offset: 10944)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !30, line: 1, baseType: !418, size: 7808, align: 64, offset: 11008)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !30, line: 1, baseType: !443, size: 640, align: 64, offset: 18816)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 640, align: 8, elements: !257)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !8, size: 128, align: 8, elements: !446)
!446 = !{!447, !451}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !8, line: 1, baseType: !448, size: 64, align: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !30, line: 1, size: 64, align: 8, elements: !449)
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !30, line: 1, baseType: !161, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !8, line: 1, baseType: !169, size: 32, align: 32, offset: 64)
!452 = !DILocalVariable(name: "$this21", arg: 1, scope: !56, file: !30, line: 1, type: !444)
!453 = !DILocation(line: 1, column: 1, scope: !56)
!454 = !DILocalVariable(name: "$ret1", scope: !56, file: !30, line: 1, type: !59)
!455 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !30, line: 1, type: !456, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!456 = !DISubroutineType(types: !457)
!457 = !{!16, !444, !444, !458}
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !30, line: 1, size: 128, align: 8, elements: !459)
!459 = !{!450, !460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !30, line: 1, baseType: !161, size: 64, align: 64, offset: 64)
!461 = !DILocalVariable(name: "$this22", arg: 1, scope: !455, file: !30, line: 1, type: !444)
!462 = !DILocation(line: 1, column: 1, scope: !455)
!463 = !DILocalVariable(name: "$p23", arg: 2, scope: !455, file: !30, line: 1, type: !458)
!464 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !30, line: 1, type: !465, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!465 = !DISubroutineType(types: !466)
!466 = !{!16, !444, !444, !59}
!467 = !DILocalVariable(name: "$this24", arg: 1, scope: !464, file: !30, line: 1, type: !444)
!468 = !DILocation(line: 1, column: 1, scope: !464)
!469 = !DILocalVariable(name: "$p25", arg: 2, scope: !464, file: !30, line: 1, type: !59)
!470 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !30, line: 1, type: !471, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!471 = !DISubroutineType(types: !472)
!472 = !{!92, !444, !444}
!473 = !DILocalVariable(name: "$this26", arg: 1, scope: !470, file: !30, line: 1, type: !444)
!474 = !DILocation(line: 1, column: 1, scope: !470)
!475 = !DILocalVariable(name: "$ret2", scope: !470, file: !30, line: 1, type: !92)
!476 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !36, line: 1, type: !90, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!477 = !DILocalVariable(name: "key1", arg: 1, scope: !476, file: !36, line: 1, type: !15)
!478 = !DILocation(line: 1, column: 1, scope: !476)
!479 = !DILocalVariable(name: "key2", arg: 2, scope: !476, file: !36, line: 1, type: !15)
!480 = !DILocalVariable(name: "$ret3", scope: !476, file: !36, line: 1, type: !92)
!481 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !36, line: 1, type: !90, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!482 = !DILocalVariable(name: "key1", arg: 1, scope: !481, file: !36, line: 1, type: !15)
!483 = !DILocation(line: 1, column: 1, scope: !481)
!484 = !DILocalVariable(name: "key2", arg: 2, scope: !481, file: !36, line: 1, type: !15)
!485 = !DILocalVariable(name: "$ret4", scope: !481, file: !36, line: 1, type: !92)
!486 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !36, line: 1, type: !90, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!487 = !DILocalVariable(name: "key1", arg: 1, scope: !486, file: !36, line: 1, type: !15)
!488 = !DILocation(line: 1, column: 1, scope: !486)
!489 = !DILocalVariable(name: "key2", arg: 2, scope: !486, file: !36, line: 1, type: !15)
!490 = !DILocalVariable(name: "$ret5", scope: !486, file: !36, line: 1, type: !92)
!491 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !90, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!492 = !DILocalVariable(name: "key1", arg: 1, scope: !491, file: !36, line: 1, type: !15)
!493 = !DILocation(line: 1, column: 1, scope: !491)
!494 = !DILocalVariable(name: "key2", arg: 2, scope: !491, file: !36, line: 1, type: !15)
!495 = !DILocalVariable(name: "$ret6", scope: !491, file: !36, line: 1, type: !92)
!496 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !90, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!497 = !DILocalVariable(name: "key1", arg: 1, scope: !496, file: !36, line: 1, type: !15)
!498 = !DILocation(line: 1, column: 1, scope: !496)
!499 = !DILocalVariable(name: "key2", arg: 2, scope: !496, file: !36, line: 1, type: !15)
