; ModuleID = 'utbotgo/package/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./perfect_number.go", directory: "/workspace")
!5 = !{!6, !19, !21, !23, !25, !27}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !8, size: 128, align: 8, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, align: 8, elements: !17)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "void")
!17 = !{!18}
!18 = !DISubrange(count: 1, lowerBound: 0)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!29 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !30, line: 1, type: !31, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!30 = !DIFile(filename: "perfect_number.go", directory: ".")
!31 = !DISubroutineType(types: !32)
!32 = !{!16}
!33 = !{}
!34 = !DILocation(line: 1, column: 1, scope: !35)
!35 = !DILexicalBlockFile(scope: !29, file: !36, discriminator: 0)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = distinct !DISubprogram(name: "main.SumOfProperDivisors", scope: null, file: !30, line: 3, type: !38, scopeLine: 3, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !40}
!40 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!41 = !DILocalVariable(name: "n", arg: 1, scope: !37, file: !30, line: 3, type: !40)
!42 = !DILocation(line: 3, column: 26, scope: !37)
!43 = !DILocalVariable(name: "$ret0", scope: !37, file: !30, line: 3, type: !40)
!44 = !DILocation(line: 3, column: 34, scope: !37)
!45 = !DILocalVariable(name: "res", scope: !46, file: !30, line: 4, type: !40)
!46 = distinct !DILexicalBlock(scope: !37, file: !30, line: 3, column: 1)
!47 = !DILocation(line: 4, column: 6, scope: !37)
!48 = !DILocation(line: 5, column: 5, scope: !46)
!49 = !DILocation(line: 5, column: 7, scope: !46)
!50 = !DILocation(line: 5, column: 2, scope: !46)
!51 = !DILocation(line: 6, column: 7, scope: !46)
!52 = !DILocalVariable(name: "curDivisor", scope: !53, file: !30, line: 8, type: !40)
!53 = distinct !DILexicalBlock(scope: !46, file: !30, line: 8, column: 2)
!54 = !DILocation(line: 8, column: 6, scope: !46)
!55 = !DILocation(line: 8, column: 29, scope: !53)
!56 = !DILocation(line: 8, column: 40, scope: !53)
!57 = !DILocation(line: 8, column: 39, scope: !53)
!58 = !DILocation(line: 8, column: 54, scope: !53)
!59 = !DILocation(line: 8, column: 51, scope: !53)
!60 = !DILocation(line: 9, column: 8, scope: !53)
!61 = !DILocation(line: 9, column: 7, scope: !53)
!62 = !DILocation(line: 9, column: 6, scope: !53)
!63 = !DILocation(line: 9, column: 19, scope: !53)
!64 = !DILocation(line: 9, column: 3, scope: !53)
!65 = !DILocation(line: 10, column: 4, scope: !53)
!66 = !DILocation(line: 10, column: 11, scope: !53)
!67 = !DILocation(line: 10, column: 8, scope: !53)
!68 = !DILocation(line: 11, column: 7, scope: !53)
!69 = !DILocation(line: 11, column: 18, scope: !53)
!70 = !DILocation(line: 11, column: 17, scope: !53)
!71 = !DILocation(line: 11, column: 32, scope: !53)
!72 = !DILocation(line: 11, column: 29, scope: !53)
!73 = !DILocation(line: 11, column: 4, scope: !53)
!74 = !DILocation(line: 8, column: 57, scope: !53)
!75 = !DILocation(line: 12, column: 5, scope: !53)
!76 = !DILocation(line: 12, column: 16, scope: !53)
!77 = !DILocation(line: 12, column: 14, scope: !53)
!78 = !DILocation(line: 12, column: 12, scope: !53)
!79 = !DILocation(line: 12, column: 9, scope: !53)
!80 = !DILocation(line: 16, column: 9, scope: !46)
!81 = !DILocation(line: 16, column: 2, scope: !46)
!82 = distinct !DISubprogram(name: "main.IsPerfectNumber", scope: null, file: !30, line: 19, type: !83, scopeLine: 19, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !40}
!85 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!86 = !DILocalVariable(name: "n", arg: 1, scope: !82, file: !30, line: 19, type: !40)
!87 = !DILocation(line: 19, column: 22, scope: !82)
!88 = !DILocalVariable(name: "$ret1", scope: !82, file: !30, line: 19, type: !85)
!89 = !DILocation(line: 19, column: 30, scope: !82)
!90 = !DILocation(line: 20, column: 9, scope: !82)
!91 = !DILocation(line: 20, column: 11, scope: !82)
!92 = !DILocation(line: 20, column: 15, scope: !82)
!93 = !DILocation(line: 20, column: 38, scope: !82)
!94 = !DILocation(line: 20, column: 18, scope: !82)
!95 = !DILocation(line: 20, column: 44, scope: !82)
!96 = !DILocation(line: 20, column: 41, scope: !82)
!97 = !DILocation(line: 20, column: 2, scope: !82)
!98 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !30, line: 1, type: !99, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !484, !484}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !30, line: 1, size: 19456, align: 8, elements: !103)
!103 = !{!104, !166, !179, !305, !306, !307, !308, !309, !310, !311, !312, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !339, !340, !341, !342, !343, !358, !359, !426, !427, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !461, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !30, line: 1, size: 256, align: 8, elements: !107)
!107 = !{!108, !109, !162, !163, !164, !165}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !110, size: 128, align: 64, offset: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !8, size: 128, align: 8, elements: !111)
!111 = !{!112, !161}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 512, align: 8, elements: !115)
!115 = !{!116, !118, !119, !121, !123, !124, !125, !126, !134, !136, !142, !160}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !117, size: 64, align: 64)
!117 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !117, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !120, size: 32, align: 32, offset: 128)
!120 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !36, line: 1, baseType: !122, size: 8, align: 8, offset: 160)
!122 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !122, size: 8, align: 8, offset: 168)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !122, size: 8, align: 8, offset: 176)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !122, size: 8, align: 8, offset: 184)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !36, line: 1, baseType: !127, size: 64, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!85, !15, !15}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !135, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !137, size: 64, align: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !135, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !143, size: 64, align: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !145)
!145 = !{!146, !147, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !137, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !137, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !149, size: 192, align: 64, offset: 128)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !8, size: 192, align: 8, elements: !150)
!150 = !{!151, !158, !159}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !154)
!154 = !{!146, !147, !155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 200)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 208)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 216)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !30, line: 1, size: 512, align: 8, elements: !169)
!169 = !{!108, !170, !172, !173, !174, !175, !176, !177, !178}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !30, line: 1, baseType: !105, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !105, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 456)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !30, line: 1, baseType: !180, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !30, line: 1, size: 17280, align: 8, elements: !182)
!182 = !{!183, !184, !186, !187, !194, !200, !201, !203, !205, !206, !207, !209, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !222, !223, !224, !228, !229, !230, !231, !232, !233, !237, !238, !240, !241, !251, !252, !253, !254, !259, !260, !261, !262, !263, !264, !265, !282, !283, !284, !286, !290, !291, !300, !301, !302, !303, !304}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !30, line: 1, baseType: !185, size: 64, align: 64, offset: 64)
!185 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !30, line: 1, baseType: !188, size: 1024, align: 64, offset: 192)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !30, line: 1, size: 1024, align: 8, elements: !189)
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !30, line: 1, baseType: !191, size: 1024, align: 64)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 1024, align: 8, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 16, lowerBound: 0)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !30, line: 1, baseType: !195, size: 64, align: 64, offset: 1216)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !197)
!197 = !{!198}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1280)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !30, line: 1, baseType: !202, size: 64, align: 64, offset: 1344)
!202 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !30, line: 1, baseType: !204, size: 64, align: 64, offset: 1408)
!204 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !30, line: 1, baseType: !204, size: 64, align: 64, offset: 1472)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !30, line: 1, baseType: !204, size: 64, align: 64, offset: 1536)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 1600)
!208 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !30, line: 1, baseType: !210, size: 32, align: 32, offset: 1664)
!210 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !30, line: 1, baseType: !210, size: 32, align: 32, offset: 1696)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !30, line: 1, baseType: !138, size: 128, align: 64, offset: 1728)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !30, line: 1, baseType: !210, size: 32, align: 32, offset: 1856)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !30, line: 1, baseType: !210, size: 32, align: 32, offset: 1888)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !30, line: 1, baseType: !210, size: 32, align: 32, offset: 1920)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !30, line: 1, baseType: !210, size: 32, align: 32, offset: 1952)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 1984)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 1992)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 2000)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !30, line: 1, baseType: !221, size: 8, align: 8, offset: 2008)
!221 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 2016)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 2048)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !30, line: 1, baseType: !225, size: 64, align: 32, offset: 2080)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, align: 4, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 2, lowerBound: 0)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 2144)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 2152)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !30, line: 1, baseType: !185, size: 64, align: 64, offset: 2176)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !30, line: 1, baseType: !210, size: 32, align: 32, offset: 2240)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 2272)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !30, line: 1, baseType: !234, size: 64, align: 64, offset: 2304)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !30, line: 1, size: 64, align: 8, elements: !235)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !30, line: 1, baseType: !117, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2368)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !239, size: 64, align: 64, offset: 2432)
!239 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !30, line: 1, baseType: !202, size: 64, align: 64, offset: 2496)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !30, line: 1, baseType: !242, size: 12288, align: 64, offset: 2560)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 12288, align: 8, elements: !249)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !30, line: 1, size: 384, align: 8, elements: !244)
!244 = !{!245, !246, !247, !248}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !30, line: 1, baseType: !117, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !30, line: 1, baseType: !138, size: 128, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !30, line: 1, baseType: !138, size: 128, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!249 = !{!250}
!250 = !DISubrange(count: 32, lowerBound: 0)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 14848)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 14880)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !30, line: 1, baseType: !239, size: 64, align: 64, offset: 14912)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !30, line: 1, baseType: !255, size: 64, align: 64, offset: 14976)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !257)
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !131, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15040)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 15104)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15168)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 15232)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 15264)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15296)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !30, line: 1, baseType: !266, size: 192, align: 64, offset: 15360)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !8, size: 192, align: 8, elements: !267)
!267 = !{!268, !273, !274}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !8, line: 1, baseType: !269, size: 64, align: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !30, line: 1, size: 64, align: 8, elements: !270)
!270 = !{!271, !236}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !30, line: 1, baseType: !272, align: 8)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !30, line: 1, align: 1, elements: !33)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !8, line: 1, baseType: !120, size: 32, align: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !8, line: 1, baseType: !275, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !277)
!277 = !{!278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!85, !85}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 15552)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 15584)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !30, line: 1, baseType: !285, align: 8, offset: 15616)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !30, line: 1, align: 1, elements: !33)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !30, line: 1, baseType: !287, size: 8, align: 8, offset: 15616)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !30, line: 1, size: 8, align: 1, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !30, line: 1, baseType: !122, size: 8, align: 8)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15680)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !30, line: 1, baseType: !292, size: 1280, align: 64, offset: 15744)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 1280, align: 8, elements: !298)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !30, line: 1, size: 128, align: 8, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !30, line: 1, baseType: !117, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !30, line: 1, baseType: !297, size: 64, align: 64, offset: 64)
!297 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!298 = !{!299}
!299 = !DISubrange(count: 10, lowerBound: 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 17024)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 17088)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 17152)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 17160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !30, line: 1, baseType: !234, size: 64, align: 64, offset: 17216)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !202, size: 64, align: 64, offset: 512)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !30, line: 1, baseType: !313, size: 8, align: 8, offset: 640)
!313 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 648)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 656)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 664)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 672)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 680)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 688)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 696)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 712)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 720)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !30, line: 1, baseType: !221, size: 8, align: 8, offset: 728)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 736)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 744)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 752)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 832)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 896)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !30, line: 1, baseType: !185, size: 64, align: 64, offset: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !30, line: 1, baseType: !204, size: 64, align: 64, offset: 1024)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !30, line: 1, baseType: !239, size: 64, align: 64, offset: 1088)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 1152)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !30, line: 1, baseType: !336, size: 192, align: 64, offset: 1216)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !8, size: 192, align: 8, elements: !337)
!337 = !{!338, !158, !159}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !135, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 1408)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 1472)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 1536)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 1600)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !30, line: 1, baseType: !344, size: 64, align: 64, offset: 1664)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !8, size: 192, align: 8, elements: !346)
!346 = !{!347, !158, !159}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !30, line: 1, size: 320, align: 8, elements: !350)
!350 = !{!351, !356, !357}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !30, line: 1, baseType: !352, size: 192, align: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !8, size: 192, align: 8, elements: !353)
!353 = !{!354, !158, !159}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 1728)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !30, line: 1, baseType: !360, size: 64, align: 64, offset: 1792)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !30, line: 1, size: 704, align: 8, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 416)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 424)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !30, line: 1, baseType: !376, size: 64, align: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !30, line: 1, size: 768, align: 8, elements: !378)
!378 = !{!379, !380, !381, !382, !384, !385, !417, !418, !419, !424, !425}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !30, line: 1, baseType: !40, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !30, line: 1, baseType: !383, size: 16, align: 16, offset: 192)
!383 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !30, line: 1, baseType: !386, size: 64, align: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !30, line: 1, size: 512, align: 8, elements: !388)
!388 = !{!389, !390, !391, !392, !394, !395, !396, !397, !398, !399, !400, !416}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !30, line: 1, baseType: !117, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !30, line: 1, baseType: !393, size: 8, align: 8, offset: 160)
!393 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 168)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 176)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !30, line: 1, baseType: !122, size: 8, align: 8, offset: 184)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !30, line: 1, baseType: !255, size: 64, align: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !30, line: 1, baseType: !135, size: 64, align: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !30, line: 1, baseType: !137, size: 64, align: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !30, line: 1, baseType: !401, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !30, line: 1, size: 320, align: 8, elements: !403)
!403 = !{!404, !405, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !30, line: 1, baseType: !137, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !30, line: 1, baseType: !137, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !30, line: 1, baseType: !407, size: 192, align: 64, offset: 128)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !8, size: 192, align: 8, elements: !408)
!408 = !{!409, !158, !159}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !30, line: 1, size: 320, align: 8, elements: !412)
!412 = !{!404, !405, !413, !414, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !30, line: 1, baseType: !40, size: 64, align: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !30, line: 1, baseType: !420, size: 128, align: 64, offset: 448)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !30, line: 1, size: 128, align: 8, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !30, line: 1, baseType: !420, size: 128, align: 64, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !30, line: 1, baseType: !269, size: 64, align: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1856)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !30, line: 1, baseType: !428, size: 64, align: 64, offset: 1920)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !30, line: 1, size: 576, align: 8, elements: !430)
!430 = !{!431, !432, !433, !434, !442, !443, !444, !445}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !30, line: 1, baseType: !204, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !30, line: 1, baseType: !435, size: 64, align: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !437)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!16, !110, !117}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !110, size: 128, align: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !30, line: 1, baseType: !120, size: 32, align: 32, offset: 1984)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !30, line: 1, baseType: !208, size: 64, align: 64, offset: 2048)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2112)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 2176)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 2240)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 2304)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 2368)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 2432)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2496)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 2560)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2624)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !30, line: 1, baseType: !458, size: 7808, align: 64, offset: 2688)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 7808, align: 8, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 122, lowerBound: 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !30, line: 1, baseType: !462, size: 64, align: 64, offset: 10496)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !464)
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!16, !15}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 10560)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 10624)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 10688)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 10696)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 10752)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 10816)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 10880)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 10888)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 10896)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 10904)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !30, line: 1, baseType: !85, size: 8, align: 8, offset: 10912)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !117, size: 64, align: 64, offset: 10944)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !30, line: 1, baseType: !458, size: 7808, align: 64, offset: 11008)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !30, line: 1, baseType: !483, size: 640, align: 64, offset: 18816)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 640, align: 8, elements: !298)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !8, size: 128, align: 8, elements: !486)
!486 = !{!487, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !8, line: 1, baseType: !488, size: 64, align: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !30, line: 1, size: 64, align: 8, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !30, line: 1, baseType: !202, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !8, line: 1, baseType: !210, size: 32, align: 32, offset: 64)
!492 = !DILocalVariable(name: "$this21", arg: 1, scope: !98, file: !30, line: 1, type: !484)
!493 = !DILocation(line: 1, column: 1, scope: !98)
!494 = !DILocalVariable(name: "$ret2", scope: !98, file: !30, line: 1, type: !101)
!495 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !30, line: 1, type: !496, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!496 = !DISubroutineType(types: !497)
!497 = !{!16, !484, !484, !498}
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !30, line: 1, size: 128, align: 8, elements: !499)
!499 = !{!490, !500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !30, line: 1, baseType: !202, size: 64, align: 64, offset: 64)
!501 = !DILocalVariable(name: "$this22", arg: 1, scope: !495, file: !30, line: 1, type: !484)
!502 = !DILocation(line: 1, column: 1, scope: !495)
!503 = !DILocalVariable(name: "$p23", arg: 2, scope: !495, file: !30, line: 1, type: !498)
!504 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !30, line: 1, type: !505, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!505 = !DISubroutineType(types: !506)
!506 = !{!16, !484, !484, !101}
!507 = !DILocalVariable(name: "$this24", arg: 1, scope: !504, file: !30, line: 1, type: !484)
!508 = !DILocation(line: 1, column: 1, scope: !504)
!509 = !DILocalVariable(name: "$p25", arg: 2, scope: !504, file: !30, line: 1, type: !101)
!510 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !30, line: 1, type: !511, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!511 = !DISubroutineType(types: !512)
!512 = !{!85, !484, !484}
!513 = !DILocalVariable(name: "$this26", arg: 1, scope: !510, file: !30, line: 1, type: !484)
!514 = !DILocation(line: 1, column: 1, scope: !510)
!515 = !DILocalVariable(name: "$ret3", scope: !510, file: !30, line: 1, type: !85)
!516 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !36, line: 1, type: !132, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!517 = !DILocalVariable(name: "key1", arg: 1, scope: !516, file: !36, line: 1, type: !15)
!518 = !DILocation(line: 1, column: 1, scope: !516)
!519 = !DILocalVariable(name: "key2", arg: 2, scope: !516, file: !36, line: 1, type: !15)
!520 = !DILocalVariable(name: "$ret4", scope: !516, file: !36, line: 1, type: !85)
!521 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !36, line: 1, type: !132, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!522 = !DILocalVariable(name: "key1", arg: 1, scope: !521, file: !36, line: 1, type: !15)
!523 = !DILocation(line: 1, column: 1, scope: !521)
!524 = !DILocalVariable(name: "key2", arg: 2, scope: !521, file: !36, line: 1, type: !15)
!525 = !DILocalVariable(name: "$ret5", scope: !521, file: !36, line: 1, type: !85)
!526 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !36, line: 1, type: !132, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!527 = !DILocalVariable(name: "key1", arg: 1, scope: !526, file: !36, line: 1, type: !15)
!528 = !DILocation(line: 1, column: 1, scope: !526)
!529 = !DILocalVariable(name: "key2", arg: 2, scope: !526, file: !36, line: 1, type: !15)
!530 = !DILocalVariable(name: "$ret6", scope: !526, file: !36, line: 1, type: !85)
!531 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !132, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!532 = !DILocalVariable(name: "key1", arg: 1, scope: !531, file: !36, line: 1, type: !15)
!533 = !DILocation(line: 1, column: 1, scope: !531)
!534 = !DILocalVariable(name: "key2", arg: 2, scope: !531, file: !36, line: 1, type: !15)
!535 = !DILocalVariable(name: "$ret7", scope: !531, file: !36, line: 1, type: !85)
!536 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !132, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!537 = !DILocalVariable(name: "key1", arg: 1, scope: !536, file: !36, line: 1, type: !15)
!538 = !DILocation(line: 1, column: 1, scope: !536)
!539 = !DILocalVariable(name: "key2", arg: 2, scope: !536, file: !36, line: 1, type: !15)
