; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./goroutine.go", directory: "/workspace")
!5 = !{!6, !19, !21, !23, !25, !27}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !8, size: 128, align: 8, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, align: 8, elements: !17)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "void")
!17 = !{!18}
!18 = !DISubrange(count: 1, lowerBound: 0)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!29 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !30, line: 1, type: !31, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!30 = !DIFile(filename: "goroutine.go", directory: ".")
!31 = !DISubroutineType(types: !32)
!32 = !{!16}
!33 = !{}
!34 = !DILocation(line: 1, column: 1, scope: !35)
!35 = !DILexicalBlockFile(scope: !29, file: !36, discriminator: 0)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = distinct !DISubprogram(name: "main.goroutine", scope: null, file: !30, line: 3, type: !38, scopeLine: 3, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!38 = !DISubroutineType(types: !39)
!39 = !{!12, !12}
!40 = !DILocalVariable(name: "a", arg: 1, scope: !37, file: !30, line: 3, type: !12)
!41 = !DILocation(line: 3, column: 16, scope: !37)
!42 = !DILocalVariable(name: "$ret0", scope: !37, file: !30, line: 3, type: !12)
!43 = !DILocation(line: 3, column: 23, scope: !37)
!44 = !DILocation(line: 4, column: 2, scope: !37)
!45 = !DILocation(line: 7, column: 5, scope: !37)
!46 = !DILocation(line: 7, column: 7, scope: !37)
!47 = !DILocation(line: 7, column: 2, scope: !37)
!48 = !DILocation(line: 8, column: 3, scope: !37)
!49 = !DILocation(line: 10, column: 2, scope: !37)
!50 = distinct !DISubprogram(name: "main.goroutine..func1", scope: null, file: !30, line: 4, type: !31, scopeLine: 4, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!51 = !DILocation(line: 5, column: 3, scope: !50)
!52 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !30, line: 1, type: !53, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !440, !440}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !30, line: 1, size: 19456, align: 8, elements: !57)
!57 = !{!58, !121, !134, !260, !261, !262, !263, !264, !265, !266, !267, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !294, !295, !296, !297, !298, !313, !314, !382, !383, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !417, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !30, line: 1, size: 256, align: 8, elements: !61)
!61 = !{!62, !63, !117, !118, !119, !120}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !64, size: 128, align: 64, offset: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !8, size: 128, align: 8, elements: !65)
!65 = !{!66, !116}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 512, align: 8, elements: !69)
!69 = !{!70, !72, !73, !75, !77, !78, !79, !80, !89, !91, !97, !115}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !71, size: 64, align: 64)
!71 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !74, size: 32, align: 32, offset: 128)
!74 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !36, line: 1, baseType: !76, size: 8, align: 8, offset: 160)
!76 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !76, size: 8, align: 8, offset: 168)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !76, size: 8, align: 8, offset: 176)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !76, size: 8, align: 8, offset: 184)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !36, line: 1, baseType: !81, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !15, !15}
!88 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !90, size: 64, align: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !92, size: 64, align: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !90, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !98, size: 64, align: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !100)
!100 = !{!101, !102, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !92, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !92, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !104, size: 192, align: 64, offset: 128)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !8, size: 192, align: 8, elements: !105)
!105 = !{!106, !113, !114}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !109)
!109 = !{!101, !102, !110, !111, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 200)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 208)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !30, line: 1, baseType: !122, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !30, line: 1, size: 512, align: 8, elements: !124)
!124 = !{!62, !125, !127, !128, !129, !130, !131, !132, !133}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !30, line: 1, baseType: !126, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !30, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !59, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 456)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !30, line: 1, baseType: !135, size: 64, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !30, line: 1, size: 17280, align: 8, elements: !137)
!137 = !{!138, !139, !141, !142, !149, !155, !156, !158, !160, !161, !162, !164, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !177, !178, !179, !183, !184, !185, !186, !187, !188, !192, !193, !195, !196, !206, !207, !208, !209, !214, !215, !216, !217, !218, !219, !220, !237, !238, !239, !241, !245, !246, !255, !256, !257, !258, !259}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !30, line: 1, baseType: !140, size: 64, align: 64, offset: 64)
!140 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !30, line: 1, baseType: !143, size: 1024, align: 64, offset: 192)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !30, line: 1, size: 1024, align: 8, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !30, line: 1, baseType: !146, size: 1024, align: 64)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 1024, align: 8, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 16, lowerBound: 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !30, line: 1, baseType: !150, size: 64, align: 64, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1280)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !30, line: 1, baseType: !157, size: 64, align: 64, offset: 1344)
!157 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !30, line: 1, baseType: !159, size: 64, align: 64, offset: 1408)
!159 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !30, line: 1, baseType: !159, size: 64, align: 64, offset: 1472)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !30, line: 1, baseType: !159, size: 64, align: 64, offset: 1536)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 1600)
!163 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !30, line: 1, baseType: !165, size: 32, align: 32, offset: 1664)
!165 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !30, line: 1, baseType: !165, size: 32, align: 32, offset: 1696)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !30, line: 1, baseType: !93, size: 128, align: 64, offset: 1728)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !30, line: 1, baseType: !165, size: 32, align: 32, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !30, line: 1, baseType: !165, size: 32, align: 32, offset: 1888)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !30, line: 1, baseType: !165, size: 32, align: 32, offset: 1920)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !30, line: 1, baseType: !165, size: 32, align: 32, offset: 1952)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 1984)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 1992)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 2000)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !30, line: 1, baseType: !176, size: 8, align: 8, offset: 2008)
!176 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 2016)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 2048)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !30, line: 1, baseType: !180, size: 64, align: 32, offset: 2080)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 64, align: 4, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 2, lowerBound: 0)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 2144)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !76, size: 8, align: 8, offset: 2152)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !30, line: 1, baseType: !140, size: 64, align: 64, offset: 2176)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !30, line: 1, baseType: !165, size: 32, align: 32, offset: 2240)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 2272)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !30, line: 1, baseType: !189, size: 64, align: 64, offset: 2304)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !30, line: 1, size: 64, align: 8, elements: !190)
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !30, line: 1, baseType: !71, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2368)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !194, size: 64, align: 64, offset: 2432)
!194 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !30, line: 1, baseType: !157, size: 64, align: 64, offset: 2496)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !30, line: 1, baseType: !197, size: 12288, align: 64, offset: 2560)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 12288, align: 8, elements: !204)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !30, line: 1, size: 384, align: 8, elements: !199)
!199 = !{!200, !201, !202, !203}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !30, line: 1, baseType: !71, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !30, line: 1, baseType: !93, size: 128, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !30, line: 1, baseType: !93, size: 128, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!204 = !{!205}
!205 = !DISubrange(count: 32, lowerBound: 0)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 14848)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 14880)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !30, line: 1, baseType: !194, size: 64, align: 64, offset: 14912)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !30, line: 1, baseType: !210, size: 64, align: 64, offset: 14976)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !212)
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !85, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15040)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !30, line: 1, baseType: !76, size: 8, align: 8, offset: 15104)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15168)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 15232)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 15264)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15296)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !30, line: 1, baseType: !221, size: 192, align: 64, offset: 15360)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !8, size: 192, align: 8, elements: !222)
!222 = !{!223, !228, !229}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !8, line: 1, baseType: !224, size: 64, align: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !30, line: 1, size: 64, align: 8, elements: !225)
!225 = !{!226, !191}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !30, line: 1, baseType: !227, align: 8)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !30, line: 1, align: 1, elements: !33)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !8, line: 1, baseType: !74, size: 32, align: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !8, line: 1, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!88, !88}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 15552)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 15584)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !30, line: 1, baseType: !240, align: 8, offset: 15616)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !30, line: 1, align: 1, elements: !33)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !30, line: 1, baseType: !242, size: 8, align: 8, offset: 15616)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !30, line: 1, size: 8, align: 1, elements: !243)
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !30, line: 1, baseType: !76, size: 8, align: 8)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15680)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !30, line: 1, baseType: !247, size: 1280, align: 64, offset: 15744)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 1280, align: 8, elements: !253)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !30, line: 1, size: 128, align: 8, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !30, line: 1, baseType: !71, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !30, line: 1, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!253 = !{!254}
!254 = !DISubrange(count: 10, lowerBound: 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 17024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 17088)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 17152)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 17160)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !30, line: 1, baseType: !189, size: 64, align: 64, offset: 17216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !157, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !30, line: 1, baseType: !268, size: 8, align: 8, offset: 640)
!268 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 648)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 656)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 664)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 672)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 680)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 688)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 696)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 704)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 712)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !30, line: 1, baseType: !76, size: 8, align: 8, offset: 720)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !30, line: 1, baseType: !176, size: 8, align: 8, offset: 728)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 736)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 744)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !30, line: 1, baseType: !76, size: 8, align: 8, offset: 752)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 896)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !30, line: 1, baseType: !140, size: 64, align: 64, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !30, line: 1, baseType: !159, size: 64, align: 64, offset: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !30, line: 1, baseType: !194, size: 64, align: 64, offset: 1088)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 1152)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !30, line: 1, baseType: !291, size: 192, align: 64, offset: 1216)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !8, size: 192, align: 8, elements: !292)
!292 = !{!293, !113, !114}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !90, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 1408)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 1472)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 1536)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 1600)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !30, line: 1, baseType: !299, size: 64, align: 64, offset: 1664)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !8, size: 192, align: 8, elements: !301)
!301 = !{!302, !113, !114}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !30, line: 1, size: 320, align: 8, elements: !305)
!305 = !{!306, !311, !312}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !30, line: 1, baseType: !307, size: 192, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !8, size: 192, align: 8, elements: !308)
!308 = !{!309, !113, !114}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 1728)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !30, line: 1, baseType: !315, size: 64, align: 64, offset: 1792)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !30, line: 1, size: 704, align: 8, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 416)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 424)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !30, line: 1, baseType: !331, size: 64, align: 64, offset: 640)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !30, line: 1, size: 768, align: 8, elements: !333)
!333 = !{!334, !336, !337, !338, !340, !341, !373, !374, !375, !380, !381}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !30, line: 1, baseType: !335, size: 64, align: 64)
!335 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !30, line: 1, baseType: !335, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !30, line: 1, baseType: !339, size: 16, align: 16, offset: 192)
!339 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !30, line: 1, baseType: !342, size: 64, align: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !30, line: 1, size: 512, align: 8, elements: !344)
!344 = !{!345, !346, !347, !348, !350, !351, !352, !353, !354, !355, !356, !372}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !30, line: 1, baseType: !71, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !30, line: 1, baseType: !349, size: 8, align: 8, offset: 160)
!349 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !30, line: 1, baseType: !76, size: 8, align: 8, offset: 168)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !30, line: 1, baseType: !76, size: 8, align: 8, offset: 176)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !30, line: 1, baseType: !76, size: 8, align: 8, offset: 184)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !30, line: 1, baseType: !210, size: 64, align: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !30, line: 1, baseType: !90, size: 64, align: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !30, line: 1, baseType: !92, size: 64, align: 64, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !30, line: 1, baseType: !357, size: 64, align: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !30, line: 1, size: 320, align: 8, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !30, line: 1, baseType: !92, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !30, line: 1, baseType: !92, size: 64, align: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !30, line: 1, baseType: !363, size: 192, align: 64, offset: 128)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !8, size: 192, align: 8, elements: !364)
!364 = !{!365, !113, !114}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !30, line: 1, size: 320, align: 8, elements: !368)
!368 = !{!360, !361, !369, !370, !371}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !30, line: 1, baseType: !335, size: 64, align: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !30, line: 1, baseType: !335, size: 64, align: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !30, line: 1, baseType: !376, size: 128, align: 64, offset: 448)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !30, line: 1, size: 128, align: 8, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !30, line: 1, baseType: !376, size: 128, align: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !30, line: 1, baseType: !224, size: 64, align: 64, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1856)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !30, line: 1, baseType: !384, size: 64, align: 64, offset: 1920)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !30, line: 1, size: 576, align: 8, elements: !386)
!386 = !{!387, !388, !389, !390, !398, !399, !400, !401}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !30, line: 1, baseType: !159, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !30, line: 1, baseType: !391, size: 64, align: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !393)
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!16, !64, !71}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !64, size: 128, align: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !30, line: 1, baseType: !74, size: 32, align: 32, offset: 1984)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !30, line: 1, baseType: !163, size: 64, align: 64, offset: 2048)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2112)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 2176)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 2240)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 2304)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 2368)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 2432)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2496)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 2560)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2624)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !30, line: 1, baseType: !414, size: 7808, align: 64, offset: 2688)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 7808, align: 8, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 122, lowerBound: 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !30, line: 1, baseType: !418, size: 64, align: 64, offset: 10496)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !420)
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!16, !15}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 10560)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 10624)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 10688)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 10696)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 10752)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 10816)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 10880)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 10888)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 10896)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 10904)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !30, line: 1, baseType: !88, size: 8, align: 8, offset: 10912)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !71, size: 64, align: 64, offset: 10944)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !30, line: 1, baseType: !414, size: 7808, align: 64, offset: 11008)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !30, line: 1, baseType: !439, size: 640, align: 64, offset: 18816)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 640, align: 8, elements: !253)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !8, size: 128, align: 8, elements: !442)
!442 = !{!443, !447}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !8, line: 1, baseType: !444, size: 64, align: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !30, line: 1, size: 64, align: 8, elements: !445)
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !30, line: 1, baseType: !157, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !8, line: 1, baseType: !165, size: 32, align: 32, offset: 64)
!448 = !DILocalVariable(name: "$this21", arg: 1, scope: !52, file: !30, line: 1, type: !440)
!449 = !DILocation(line: 1, column: 1, scope: !52)
!450 = !DILocalVariable(name: "$ret1", scope: !52, file: !30, line: 1, type: !55)
!451 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !30, line: 1, type: !452, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!452 = !DISubroutineType(types: !453)
!453 = !{!16, !440, !440, !454}
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !30, line: 1, size: 128, align: 8, elements: !455)
!455 = !{!446, !456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !30, line: 1, baseType: !157, size: 64, align: 64, offset: 64)
!457 = !DILocalVariable(name: "$this22", arg: 1, scope: !451, file: !30, line: 1, type: !440)
!458 = !DILocation(line: 1, column: 1, scope: !451)
!459 = !DILocalVariable(name: "$p23", arg: 2, scope: !451, file: !30, line: 1, type: !454)
!460 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !30, line: 1, type: !461, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!461 = !DISubroutineType(types: !462)
!462 = !{!16, !440, !440, !55}
!463 = !DILocalVariable(name: "$this24", arg: 1, scope: !460, file: !30, line: 1, type: !440)
!464 = !DILocation(line: 1, column: 1, scope: !460)
!465 = !DILocalVariable(name: "$p25", arg: 2, scope: !460, file: !30, line: 1, type: !55)
!466 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !30, line: 1, type: !467, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!467 = !DISubroutineType(types: !468)
!468 = !{!88, !440, !440}
!469 = !DILocalVariable(name: "$this26", arg: 1, scope: !466, file: !30, line: 1, type: !440)
!470 = !DILocation(line: 1, column: 1, scope: !466)
!471 = !DILocalVariable(name: "$ret2", scope: !466, file: !30, line: 1, type: !88)
!472 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !36, line: 1, type: !86, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!473 = !DILocalVariable(name: "key1", arg: 1, scope: !472, file: !36, line: 1, type: !15)
!474 = !DILocation(line: 1, column: 1, scope: !472)
!475 = !DILocalVariable(name: "key2", arg: 2, scope: !472, file: !36, line: 1, type: !15)
!476 = !DILocalVariable(name: "$ret3", scope: !472, file: !36, line: 1, type: !88)
!477 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !36, line: 1, type: !86, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!478 = !DILocalVariable(name: "key1", arg: 1, scope: !477, file: !36, line: 1, type: !15)
!479 = !DILocation(line: 1, column: 1, scope: !477)
!480 = !DILocalVariable(name: "key2", arg: 2, scope: !477, file: !36, line: 1, type: !15)
!481 = !DILocalVariable(name: "$ret4", scope: !477, file: !36, line: 1, type: !88)
!482 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !36, line: 1, type: !86, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!483 = !DILocalVariable(name: "key1", arg: 1, scope: !482, file: !36, line: 1, type: !15)
!484 = !DILocation(line: 1, column: 1, scope: !482)
!485 = !DILocalVariable(name: "key2", arg: 2, scope: !482, file: !36, line: 1, type: !15)
!486 = !DILocalVariable(name: "$ret5", scope: !482, file: !36, line: 1, type: !88)
!487 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !86, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!488 = !DILocalVariable(name: "key1", arg: 1, scope: !487, file: !36, line: 1, type: !15)
!489 = !DILocation(line: 1, column: 1, scope: !487)
!490 = !DILocalVariable(name: "key2", arg: 2, scope: !487, file: !36, line: 1, type: !15)
!491 = !DILocalVariable(name: "$ret6", scope: !487, file: !36, line: 1, type: !88)
!492 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !86, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!493 = !DILocalVariable(name: "key1", arg: 1, scope: !492, file: !36, line: 1, type: !15)
!494 = !DILocation(line: 1, column: 1, scope: !492)
!495 = !DILocalVariable(name: "key2", arg: 2, scope: !492, file: !36, line: 1, type: !15)
