; ModuleID = 'utbotgo/functions/IsPerfectNumber/llvm_bitcode.ll'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 7, !"Dwarf Version", i32 4}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"uwtable", i32 1}
!5 = !{i32 7, !"frame-pointer", i32 2}
!6 = distinct !DICompileUnit(language: DW_LANG_Go, file: !7, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !8)
!7 = !DIFile(filename: "./perfect_number.go", directory: "/workspace")
!8 = !{!9, !22, !24, !26, !28, !30}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "", directory: "")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !11, size: 128, align: 8, elements: !13)
!13 = !{!14, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !11, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !11, line: 1, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, align: 8, elements: !20)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "void")
!20 = !{!21}
!21 = !DISubrange(count: 1, lowerBound: 0)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !6, file: !11, type: !12, isLocal: false, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!33 = !DIFile(filename: "/klee/runtime/Freestanding/memcmp.c", directory: "/klee/build/runtime/Freestanding")
!34 = distinct !DICompileUnit(language: DW_LANG_C99, file: !35, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!35 = !DIFile(filename: "/klee/runtime/Freestanding/memcpy.c", directory: "/klee/build/runtime/Freestanding")
!36 = distinct !DICompileUnit(language: DW_LANG_C89, file: !37, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!37 = !DIFile(filename: "/klee/runtime/Intrinsic/klee_div_zero_check.c", directory: "/klee/build/runtime/Intrinsic")
!38 = !{!"clang version 14.0.0"}
!39 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !40, line: 1, type: !41, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!40 = !DIFile(filename: "perfect_number.go", directory: ".")
!41 = !DISubroutineType(types: !42)
!42 = !{!19}
!43 = !{}
!44 = !DILocation(line: 1, column: 1, scope: !45)
!45 = !DILexicalBlockFile(scope: !39, file: !46, discriminator: 0)
!46 = !DIFile(filename: "<built-in>", directory: "")
!47 = distinct !DISubprogram(name: "main.SumOfProperDivisors", scope: null, file: !40, line: 3, type: !48, scopeLine: 3, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !50}
!50 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!51 = !DILocalVariable(name: "n", arg: 1, scope: !47, file: !40, line: 3, type: !50)
!52 = !DILocation(line: 3, column: 26, scope: !47)
!53 = !DILocalVariable(name: "$ret0", scope: !47, file: !40, line: 3, type: !50)
!54 = !DILocation(line: 3, column: 34, scope: !47)
!55 = !DILocalVariable(name: "res", scope: !56, file: !40, line: 4, type: !50)
!56 = distinct !DILexicalBlock(scope: !47, file: !40, line: 3, column: 1)
!57 = !DILocation(line: 4, column: 6, scope: !47)
!58 = !DILocation(line: 5, column: 5, scope: !56)
!59 = !DILocation(line: 5, column: 7, scope: !56)
!60 = !DILocation(line: 5, column: 2, scope: !56)
!61 = !DILocalVariable(name: "curDivisor", scope: !62, file: !40, line: 8, type: !50)
!62 = distinct !DILexicalBlock(scope: !56, file: !40, line: 8, column: 2)
!63 = !DILocation(line: 8, column: 6, scope: !56)
!64 = !DILocation(line: 8, column: 29, scope: !62)
!65 = !DILocation(line: 8, column: 40, scope: !62)
!66 = !DILocation(line: 8, column: 39, scope: !62)
!67 = !DILocation(line: 8, column: 54, scope: !62)
!68 = !DILocation(line: 8, column: 51, scope: !62)
!69 = !DILocation(line: 9, column: 6, scope: !62)
!70 = !DILocation(line: 9, column: 8, scope: !62)
!71 = !DILocation(line: 9, column: 7, scope: !62)
!72 = !DILocation(line: 9, column: 19, scope: !62)
!73 = !DILocation(line: 9, column: 3, scope: !62)
!74 = !{!"True"}
!75 = !DILocation(line: 10, column: 4, scope: !62)
!76 = !DILocation(line: 10, column: 11, scope: !62)
!77 = !DILocation(line: 10, column: 8, scope: !62)
!78 = !DILocation(line: 11, column: 7, scope: !62)
!79 = !DILocation(line: 11, column: 18, scope: !62)
!80 = !DILocation(line: 11, column: 17, scope: !62)
!81 = !DILocation(line: 11, column: 32, scope: !62)
!82 = !DILocation(line: 11, column: 29, scope: !62)
!83 = !DILocation(line: 11, column: 4, scope: !62)
!84 = !DILocation(line: 8, column: 57, scope: !62)
!85 = !DILocation(line: 12, column: 5, scope: !62)
!86 = !DILocation(line: 12, column: 16, scope: !62)
!87 = !DILocation(line: 12, column: 14, scope: !62)
!88 = !DILocation(line: 12, column: 12, scope: !62)
!89 = !DILocation(line: 12, column: 9, scope: !62)
!90 = !DILocation(line: 16, column: 9, scope: !56)
!91 = !DILocation(line: 16, column: 2, scope: !56)
!92 = distinct !DISubprogram(name: "main.IsPerfectNumber", scope: null, file: !40, line: 19, type: !93, scopeLine: 19, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !50}
!95 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!96 = !DILocalVariable(name: "n", arg: 1, scope: !92, file: !40, line: 19, type: !50)
!97 = !DILocation(line: 19, column: 22, scope: !92)
!98 = !DILocalVariable(name: "$ret1", scope: !92, file: !40, line: 19, type: !95)
!99 = !DILocation(line: 19, column: 30, scope: !92)
!100 = !DILocation(line: 20, column: 9, scope: !92)
!101 = !DILocation(line: 20, column: 11, scope: !92)
!102 = !DILocation(line: 20, column: 15, scope: !92)
!103 = !DILocation(line: 20, column: 38, scope: !92)
!104 = !DILocation(line: 20, column: 18, scope: !92)
!105 = !DILocation(line: 20, column: 44, scope: !92)
!106 = !DILocation(line: 20, column: 41, scope: !92)
!107 = !DILocation(line: 20, column: 2, scope: !92)
!108 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !40, line: 1, type: !109, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !494, !494}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !40, line: 1, size: 19456, align: 8, elements: !113)
!113 = !{!114, !176, !189, !315, !316, !317, !318, !319, !320, !321, !322, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !349, !350, !351, !352, !353, !368, !369, !436, !437, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !471, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !40, line: 1, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !40, line: 1, size: 256, align: 8, elements: !117)
!117 = !{!118, !119, !172, !173, !174, !175}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !40, line: 1, baseType: !120, size: 128, align: 64, offset: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !11, size: 128, align: 8, elements: !121)
!121 = !{!122, !171}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !46, line: 1, size: 512, align: 8, elements: !125)
!125 = !{!126, !128, !129, !131, !133, !134, !135, !136, !144, !146, !152, !170}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !46, line: 1, baseType: !127, size: 64, align: 64)
!127 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !46, line: 1, baseType: !127, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !46, line: 1, baseType: !130, size: 32, align: 32, offset: 128)
!130 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !46, line: 1, baseType: !132, size: 8, align: 8, offset: 160)
!132 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !46, line: 1, baseType: !132, size: 8, align: 8, offset: 168)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !46, line: 1, baseType: !132, size: 8, align: 8, offset: 176)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !46, line: 1, baseType: !132, size: 8, align: 8, offset: 184)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !46, line: 1, baseType: !137, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !46, line: 1, size: 64, align: 8, elements: !139)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !46, line: 1, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!95, !18, !18}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !46, line: 1, baseType: !145, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !46, line: 1, baseType: !147, size: 64, align: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !46, line: 1, size: 128, align: 8, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !46, line: 1, baseType: !145, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !46, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !46, line: 1, baseType: !153, size: 64, align: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !46, line: 1, size: 320, align: 8, elements: !155)
!155 = !{!156, !157, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !46, line: 1, baseType: !147, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !46, line: 1, baseType: !147, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !46, line: 1, baseType: !159, size: 192, align: 64, offset: 128)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !11, size: 192, align: 8, elements: !160)
!160 = !{!161, !168, !169}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !46, line: 1, size: 320, align: 8, elements: !164)
!164 = !{!156, !157, !165, !166, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !46, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 200)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 208)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 216)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !40, line: 1, baseType: !177, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !40, line: 1, size: 512, align: 8, elements: !179)
!179 = !{!118, !180, !182, !183, !184, !185, !186, !187, !188}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !40, line: 1, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !40, line: 1, baseType: !115, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !40, line: 1, baseType: !115, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 456)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !40, line: 1, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !40, line: 1, size: 17280, align: 8, elements: !192)
!192 = !{!193, !194, !196, !197, !204, !210, !211, !213, !215, !216, !217, !219, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !232, !233, !234, !238, !239, !240, !241, !242, !243, !247, !248, !250, !251, !261, !262, !263, !264, !269, !270, !271, !272, !273, !274, !275, !292, !293, !294, !296, !300, !301, !310, !311, !312, !313, !314}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !40, line: 1, baseType: !195, size: 64, align: 64, offset: 64)
!195 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !40, line: 1, baseType: !198, size: 1024, align: 64, offset: 192)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !40, line: 1, size: 1024, align: 8, elements: !199)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !40, line: 1, baseType: !201, size: 1024, align: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 1024, align: 8, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 16, lowerBound: 0)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !40, line: 1, baseType: !205, size: 64, align: 64, offset: 1216)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !207)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 1280)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !40, line: 1, baseType: !212, size: 64, align: 64, offset: 1344)
!212 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !40, line: 1, baseType: !214, size: 64, align: 64, offset: 1408)
!214 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !40, line: 1, baseType: !214, size: 64, align: 64, offset: 1472)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !40, line: 1, baseType: !214, size: 64, align: 64, offset: 1536)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 1600)
!218 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !40, line: 1, baseType: !220, size: 32, align: 32, offset: 1664)
!220 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !40, line: 1, baseType: !220, size: 32, align: 32, offset: 1696)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !40, line: 1, baseType: !148, size: 128, align: 64, offset: 1728)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !40, line: 1, baseType: !220, size: 32, align: 32, offset: 1856)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !40, line: 1, baseType: !220, size: 32, align: 32, offset: 1888)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !40, line: 1, baseType: !220, size: 32, align: 32, offset: 1920)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !40, line: 1, baseType: !220, size: 32, align: 32, offset: 1952)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 1984)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 1992)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 2000)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !40, line: 1, baseType: !231, size: 8, align: 8, offset: 2008)
!231 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 2016)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 2048)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !40, line: 1, baseType: !235, size: 64, align: 32, offset: 2080)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 64, align: 4, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 2, lowerBound: 0)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 2144)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !40, line: 1, baseType: !132, size: 8, align: 8, offset: 2152)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !40, line: 1, baseType: !195, size: 64, align: 64, offset: 2176)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !40, line: 1, baseType: !220, size: 32, align: 32, offset: 2240)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 2272)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !40, line: 1, baseType: !244, size: 64, align: 64, offset: 2304)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !40, line: 1, size: 64, align: 8, elements: !245)
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !40, line: 1, baseType: !127, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2368)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !40, line: 1, baseType: !249, size: 64, align: 64, offset: 2432)
!249 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !40, line: 1, baseType: !212, size: 64, align: 64, offset: 2496)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !40, line: 1, baseType: !252, size: 12288, align: 64, offset: 2560)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 12288, align: 8, elements: !259)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !40, line: 1, size: 384, align: 8, elements: !254)
!254 = !{!255, !256, !257, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !40, line: 1, baseType: !127, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !40, line: 1, baseType: !148, size: 128, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !40, line: 1, baseType: !148, size: 128, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !40, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!259 = !{!260}
!260 = !DISubrange(count: 32, lowerBound: 0)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 14848)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 14880)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !40, line: 1, baseType: !249, size: 64, align: 64, offset: 14912)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !40, line: 1, baseType: !265, size: 64, align: 64, offset: 14976)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !267)
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !141, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 15040)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !40, line: 1, baseType: !132, size: 8, align: 8, offset: 15104)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !40, line: 1, baseType: !15, size: 64, align: 64, offset: 15168)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 15232)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 15264)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 15296)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !40, line: 1, baseType: !276, size: 192, align: 64, offset: 15360)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !11, size: 192, align: 8, elements: !277)
!277 = !{!278, !283, !284}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !11, line: 1, baseType: !279, size: 64, align: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !40, line: 1, size: 64, align: 8, elements: !280)
!280 = !{!281, !246}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !40, line: 1, baseType: !282, align: 8)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !40, line: 1, align: 1, elements: !43)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !11, line: 1, baseType: !130, size: 32, align: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !11, line: 1, baseType: !285, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !287)
!287 = !{!288}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!95, !95}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 15552)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 15584)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !40, line: 1, baseType: !295, align: 8, offset: 15616)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !40, line: 1, align: 1, elements: !43)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !40, line: 1, baseType: !297, size: 8, align: 8, offset: 15616)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !40, line: 1, size: 8, align: 1, elements: !298)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !40, line: 1, baseType: !132, size: 8, align: 8)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !40, line: 1, baseType: !15, size: 64, align: 64, offset: 15680)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !40, line: 1, baseType: !302, size: 1280, align: 64, offset: 15744)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 1280, align: 8, elements: !308)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !40, line: 1, size: 128, align: 8, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !40, line: 1, baseType: !127, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !40, line: 1, baseType: !307, size: 64, align: 64, offset: 64)
!307 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!308 = !{!309}
!309 = !DISubrange(count: 10, lowerBound: 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 17024)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 17088)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 17152)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 17160)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !40, line: 1, baseType: !244, size: 64, align: 64, offset: 17216)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !40, line: 1, baseType: !212, size: 64, align: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !40, line: 1, baseType: !323, size: 8, align: 8, offset: 640)
!323 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 648)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 656)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 664)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 672)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 680)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 688)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 696)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 704)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 712)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !40, line: 1, baseType: !132, size: 8, align: 8, offset: 720)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !40, line: 1, baseType: !231, size: 8, align: 8, offset: 728)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 736)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 744)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !40, line: 1, baseType: !132, size: 8, align: 8, offset: 752)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !40, line: 1, baseType: !195, size: 64, align: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !40, line: 1, baseType: !214, size: 64, align: 64, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !40, line: 1, baseType: !249, size: 64, align: 64, offset: 1088)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 1152)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !40, line: 1, baseType: !346, size: 192, align: 64, offset: 1216)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !11, size: 192, align: 8, elements: !347)
!347 = !{!348, !168, !169}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !145, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 1408)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 1472)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 1536)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 1600)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !40, line: 1, baseType: !354, size: 64, align: 64, offset: 1664)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !11, size: 192, align: 8, elements: !356)
!356 = !{!357, !168, !169}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !40, line: 1, size: 320, align: 8, elements: !360)
!360 = !{!361, !366, !367}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !40, line: 1, baseType: !362, size: 192, align: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !11, size: 192, align: 8, elements: !363)
!363 = !{!364, !168, !169}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 1728)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !40, line: 1, baseType: !370, size: 64, align: 64, offset: 1792)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !40, line: 1, size: 704, align: 8, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 416)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 424)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !40, line: 1, baseType: !386, size: 64, align: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !40, line: 1, size: 768, align: 8, elements: !388)
!388 = !{!389, !390, !391, !392, !394, !395, !427, !428, !429, !434, !435}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !40, line: 1, baseType: !50, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !40, line: 1, baseType: !393, size: 16, align: 16, offset: 192)
!393 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 224)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !40, line: 1, baseType: !396, size: 64, align: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !40, line: 1, size: 512, align: 8, elements: !398)
!398 = !{!399, !400, !401, !402, !404, !405, !406, !407, !408, !409, !410, !426}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !40, line: 1, baseType: !127, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !40, line: 1, baseType: !403, size: 8, align: 8, offset: 160)
!403 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !40, line: 1, baseType: !132, size: 8, align: 8, offset: 168)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !40, line: 1, baseType: !132, size: 8, align: 8, offset: 176)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !40, line: 1, baseType: !132, size: 8, align: 8, offset: 184)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !40, line: 1, baseType: !265, size: 64, align: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !40, line: 1, baseType: !145, size: 64, align: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !40, line: 1, baseType: !147, size: 64, align: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !40, line: 1, baseType: !411, size: 64, align: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !40, line: 1, size: 320, align: 8, elements: !413)
!413 = !{!414, !415, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !40, line: 1, baseType: !147, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !40, line: 1, baseType: !147, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !40, line: 1, baseType: !417, size: 192, align: 64, offset: 128)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !11, size: 192, align: 8, elements: !418)
!418 = !{!419, !168, !169}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !40, line: 1, size: 320, align: 8, elements: !422)
!422 = !{!414, !415, !423, !424, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !40, line: 1, baseType: !50, size: 64, align: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !40, line: 1, baseType: !430, size: 128, align: 64, offset: 448)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !40, line: 1, size: 128, align: 8, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !40, line: 1, baseType: !18, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !40, line: 1, baseType: !430, size: 128, align: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !40, line: 1, baseType: !279, size: 64, align: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 1856)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !40, line: 1, baseType: !438, size: 64, align: 64, offset: 1920)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !40, line: 1, size: 576, align: 8, elements: !440)
!440 = !{!441, !442, !443, !444, !452, !453, !454, !455}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !40, line: 1, baseType: !214, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !40, line: 1, baseType: !445, size: 64, align: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !447)
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!19, !120, !127}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !40, line: 1, baseType: !120, size: 128, align: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !40, line: 1, baseType: !130, size: 32, align: 32, offset: 1984)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !40, line: 1, baseType: !218, size: 64, align: 64, offset: 2048)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2112)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 2176)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 2240)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 2304)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 2368)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 2432)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2496)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 2560)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !40, line: 1, baseType: !18, size: 64, align: 64, offset: 2624)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !40, line: 1, baseType: !468, size: 7808, align: 64, offset: 2688)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 7808, align: 8, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 122, lowerBound: 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !40, line: 1, baseType: !472, size: 64, align: 64, offset: 10496)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !40, line: 1, size: 64, align: 8, elements: !474)
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !40, line: 1, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!19, !18}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 10560)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 10624)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 10688)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 10696)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 10752)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 10816)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 10880)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 10888)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 10896)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 10904)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !40, line: 1, baseType: !95, size: 8, align: 8, offset: 10912)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !40, line: 1, baseType: !127, size: 64, align: 64, offset: 10944)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !40, line: 1, baseType: !468, size: 7808, align: 64, offset: 11008)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !40, line: 1, baseType: !493, size: 640, align: 64, offset: 18816)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 640, align: 8, elements: !308)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !11, size: 128, align: 8, elements: !496)
!496 = !{!497, !501}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !11, line: 1, baseType: !498, size: 64, align: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !40, line: 1, size: 64, align: 8, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !40, line: 1, baseType: !212, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !11, line: 1, baseType: !220, size: 32, align: 32, offset: 64)
!502 = !DILocalVariable(name: "$this21", arg: 1, scope: !108, file: !40, line: 1, type: !494)
!503 = !DILocation(line: 1, column: 1, scope: !108)
!504 = !DILocalVariable(name: "$ret2", scope: !108, file: !40, line: 1, type: !111)
!505 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !40, line: 1, type: !506, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!506 = !DISubroutineType(types: !507)
!507 = !{!19, !494, !494, !508}
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !40, line: 1, size: 128, align: 8, elements: !509)
!509 = !{!500, !510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !40, line: 1, baseType: !212, size: 64, align: 64, offset: 64)
!511 = !DILocalVariable(name: "$this22", arg: 1, scope: !505, file: !40, line: 1, type: !494)
!512 = !DILocation(line: 1, column: 1, scope: !505)
!513 = !DILocalVariable(name: "$p23", arg: 2, scope: !505, file: !40, line: 1, type: !508)
!514 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !40, line: 1, type: !515, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!515 = !DISubroutineType(types: !516)
!516 = !{!19, !494, !494, !111}
!517 = !DILocalVariable(name: "$this24", arg: 1, scope: !514, file: !40, line: 1, type: !494)
!518 = !DILocation(line: 1, column: 1, scope: !514)
!519 = !DILocalVariable(name: "$p25", arg: 2, scope: !514, file: !40, line: 1, type: !111)
!520 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !40, line: 1, type: !521, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !43)
!521 = !DISubroutineType(types: !522)
!522 = !{!95, !494, !494}
!523 = !DILocalVariable(name: "$this26", arg: 1, scope: !520, file: !40, line: 1, type: !494)
!524 = !DILocation(line: 1, column: 1, scope: !520)
!525 = !DILocalVariable(name: "$ret3", scope: !520, file: !40, line: 1, type: !95)
!526 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !46, line: 1, type: !142, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!527 = !DILocalVariable(name: "key1", arg: 1, scope: !526, file: !46, line: 1, type: !18)
!528 = !DILocation(line: 1, column: 1, scope: !526)
!529 = !DILocalVariable(name: "key2", arg: 2, scope: !526, file: !46, line: 1, type: !18)
!530 = !DILocalVariable(name: "$ret4", scope: !526, file: !46, line: 1, type: !95)
!531 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !46, line: 1, type: !142, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!532 = !DILocalVariable(name: "key1", arg: 1, scope: !531, file: !46, line: 1, type: !18)
!533 = !DILocation(line: 1, column: 1, scope: !531)
!534 = !DILocalVariable(name: "key2", arg: 2, scope: !531, file: !46, line: 1, type: !18)
!535 = !DILocalVariable(name: "$ret5", scope: !531, file: !46, line: 1, type: !95)
!536 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !46, line: 1, type: !142, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!537 = !DILocalVariable(name: "key1", arg: 1, scope: !536, file: !46, line: 1, type: !18)
!538 = !DILocation(line: 1, column: 1, scope: !536)
!539 = !DILocalVariable(name: "key2", arg: 2, scope: !536, file: !46, line: 1, type: !18)
!540 = !DILocalVariable(name: "$ret6", scope: !536, file: !46, line: 1, type: !95)
!541 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !46, line: 1, type: !142, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!542 = !DILocalVariable(name: "key1", arg: 1, scope: !541, file: !46, line: 1, type: !18)
!543 = !DILocation(line: 1, column: 1, scope: !541)
!544 = !DILocalVariable(name: "key2", arg: 2, scope: !541, file: !46, line: 1, type: !18)
!545 = !DILocalVariable(name: "$ret7", scope: !541, file: !46, line: 1, type: !95)
!546 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !46, line: 1, type: !142, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !43)
!547 = !DILocalVariable(name: "key1", arg: 1, scope: !546, file: !46, line: 1, type: !18)
!548 = !DILocation(line: 1, column: 1, scope: !546)
!549 = !DILocalVariable(name: "key2", arg: 2, scope: !546, file: !46, line: 1, type: !18)
